*** src/lib.rs:602:9: replace StableRouteRouter::get_pending_admin_eta -> Option<u64> with None

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::get_pending_admin_eta -> Option<u64> with None
@@ -594,17 +594,17 @@
         env.storage()
             .persistent()
             .set(&DataKey::Timelock, &delay_seconds);
     }
 
     /// Read the earliest timestamp at which the pending admin transfer may
     /// be accepted, or `None` when no transfer is queued.
     pub fn get_pending_admin_eta(env: Env) -> Option<u64> {
-        env.storage().persistent().get(&DataKey::PendingAdminEta)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Cancel a pending handover, clearing both the pending admin and its
     /// queued eta. No-op if none is pending.
     pub fn cancel_admin_transfer(env: Env) {
         Self::require_admin(&env);
         env.storage().instance().remove(&DataKey::PendingAdmin);
         env.storage().persistent().remove(&DataKey::PendingAdminEta);

---- test::test_timelock_blocks_early_accept stdout ----

thread 'test::test_timelock_blocks_early_accept' (49566) panicked at src/lib.rs:2167:9:
assertion `left == right` failed
  left: None
 right: Some(1100)
Writing test snapshot file for test "test::test_timelock_blocks_early_accept" to "test_snapshots/test/test_timelock_blocks_early_accept.1.json".
note: panic did not contain expected string
      panic message: "assertion `left == right` failed\n  left: None\n right: Some(1100)"
 expected substring: "Error(Contract, #14)"

failures:
    test::test_timelock_blocks_early_accept

test result: FAILED. 233 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 24.53s

*** result: Failure(101)
