*** src/lib.rs:1001:9: replace StableRouteRouter::get_min_fee_absolute -> Option<i128> with Some(0)

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::get_min_fee_absolute -> Option<i128> with Some(0)
@@ -993,17 +993,17 @@
         {
             Some(floor) => fee.max(floor),
             None => fee,
         }
     }
 
     /// Read the absolute per-route fee floor, or `None` when unset.
     pub fn get_min_fee_absolute(env: Env) -> Option<i128> {
-        env.storage().persistent().get(&DataKey::MinFeeAbsolute)
+        Some(0) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Admin sets the absolute per-route fee floor (in source units).
     /// Rejects negative floors with `AmountMustBePositive` (#6). Emits
     /// a `minfee` event. The floor composes with the fee cap: a route is
     /// charged `max(min(amount * fee_bps / 10_000, max_fee_absolute), min_fee_absolute)`.
     pub fn set_min_fee_absolute(env: Env, min_fee: i128) {
         Self::require_admin(&env);

---- test_i42_min_fee_floor::test_fee_above_floor_is_unaffected stdout ----

thread 'test_i42_min_fee_floor::test_fee_above_floor_is_unaffected' (121752) panicked at src/lib.rs:4256:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(50)
Writing test snapshot file for test "test_i42_min_fee_floor::test_fee_above_floor_is_unaffected" to "test_snapshots/test_i42_min_fee_floor/test_fee_above_floor_is_unaffected.1.json".

---- test_i42_min_fee_floor::test_no_absolute_floor_by_default stdout ----

thread 'test_i42_min_fee_floor::test_no_absolute_floor_by_default' (121756) panicked at src/lib.rs:4246:9:
assertion `left == right` failed
  left: Some(0)
 right: None
Writing test snapshot file for test "test_i42_min_fee_floor::test_no_absolute_floor_by_default" to "test_snapshots/test_i42_min_fee_floor/test_no_absolute_floor_by_default.1.json".

failures:
    test_i42_min_fee_floor::test_fee_above_floor_is_unaffected
    test_i42_min_fee_floor::test_no_absolute_floor_by_default

test result: FAILED. 232 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 23.53s

*** result: Failure(101)
