*** src/lib.rs:602:9: replace StableRouteRouter::get_pending_admin_eta -> Option<u64> with Some(1)

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::get_pending_admin_eta -> Option<u64> with Some(1)
@@ -594,17 +594,17 @@
         env.storage()
             .persistent()
             .set(&DataKey::Timelock, &delay_seconds);
     }
 
     /// Read the earliest timestamp at which the pending admin transfer may
     /// be accepted, or `None` when no transfer is queued.
     pub fn get_pending_admin_eta(env: Env) -> Option<u64> {
-        env.storage().persistent().get(&DataKey::PendingAdminEta)
+        Some(1) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Cancel a pending handover, clearing both the pending admin and its
     /// queued eta. No-op if none is pending.
     pub fn cancel_admin_transfer(env: Env) {
         Self::require_admin(&env);
         env.storage().instance().remove(&DataKey::PendingAdmin);
         env.storage().persistent().remove(&DataKey::PendingAdminEta);

---- test::test_cancel_admin_transfer_clears_pending_admin stdout ----

thread 'test::test_cancel_admin_transfer_clears_pending_admin' (49901) panicked at src/lib.rs:2143:9:
assertion `left == right` failed
  left: Some(1)
 right: None
Writing test snapshot file for test "test::test_cancel_admin_transfer_clears_pending_admin" to "test_snapshots/test/test_cancel_admin_transfer_clears_pending_admin.1.json".

---- test::test_timelock_allows_accept_after_delay stdout ----

thread 'test::test_timelock_allows_accept_after_delay' (50188) panicked at src/lib.rs:2183:9:
assertion `left == right` failed
  left: Some(1)
 right: None
Writing test snapshot file for test "test::test_timelock_allows_accept_after_delay" to "test_snapshots/test/test_timelock_allows_accept_after_delay.1.json".

---- test::test_timelock_blocks_early_accept stdout ----

thread 'test::test_timelock_blocks_early_accept' (50192) panicked at src/lib.rs:2167:9:
assertion `left == right` failed
  left: Some(1)
 right: Some(1100)
Writing test snapshot file for test "test::test_timelock_blocks_early_accept" to "test_snapshots/test/test_timelock_blocks_early_accept.1.json".
note: panic did not contain expected string
      panic message: "assertion `left == right` failed\n  left: Some(1)\n right: Some(1100)"
 expected substring: "Error(Contract, #14)"

failures:
    test::test_cancel_admin_transfer_clears_pending_admin
    test::test_timelock_allows_accept_after_delay
    test::test_timelock_blocks_early_accept
    test::test_timelock_cancel_clears_queue
    test_i153_version_uninitialized::test_read_only_operations_work_on_uninitialized_contract

test result: FAILED. 229 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 23.66s

*** result: Failure(101)
