*** src/lib.rs:1009:9: replace StableRouteRouter::set_min_fee_absolute with ()

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::set_min_fee_absolute with ()
@@ -1001,24 +1001,17 @@
         env.storage().persistent().get(&DataKey::MinFeeAbsolute)
     }
 
     /// Admin sets the absolute per-route fee floor (in source units).
     /// Rejects negative floors with `AmountMustBePositive` (#6). Emits
     /// a `minfee` event. The floor composes with the fee cap: a route is
     /// charged `max(min(amount * fee_bps / 10_000, max_fee_absolute), min_fee_absolute)`.
     pub fn set_min_fee_absolute(env: Env, min_fee: i128) {
-        Self::require_admin(&env);
-        if min_fee < 0 {
-            panic_with_error!(&env, RouterError::AmountMustBePositive);
-        }
-        env.storage()
-            .persistent()
-            .set(&DataKey::MinFeeAbsolute, &min_fee);
-        env.events().publish((symbol_short!("minfee"),), min_fee);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Read the reported liquidity for a pair (0 when absent).
     pub fn get_pair_liquidity(env: Env, source: Symbol, destination: Symbol) -> i128 {
         Self::read_pair_liquidity(&env, &source, &destination)
     }
 
     /// Read the configured liquidity oracle, if any.

---- test_i19_authorization::test_set_min_fee_absolute_requires_admin stdout ----
Writing test snapshot file for test "test_i19_authorization::test_set_min_fee_absolute_requires_admin" to "test_snapshots/test_i19_authorization/test_set_min_fee_absolute_requires_admin.1.json".
note: test did not panic as expected at src/lib.rs:4054:8

---- test_i42_min_fee_floor::test_fee_above_floor_is_unaffected stdout ----

thread 'test_i42_min_fee_floor::test_fee_above_floor_is_unaffected' (124589) panicked at src/lib.rs:4249:9:
assertion `left == right` failed
  left: None
 right: Some(50)
Writing test snapshot file for test "test_i42_min_fee_floor::test_fee_above_floor_is_unaffected" to "test_snapshots/test_i42_min_fee_floor/test_fee_above_floor_is_unaffected.1.json".

---- test_i42_min_fee_floor::test_fee_below_floor_is_raised stdout ----

thread 'test_i42_min_fee_floor::test_fee_below_floor_is_raised' (124590) panicked at src/lib.rs:4260:9:
assertion `left == right` failed
  left: 99
 right: 100
Writing test snapshot file for test "test_i42_min_fee_floor::test_fee_below_floor_is_raised" to "test_snapshots/test_i42_min_fee_floor/test_fee_below_floor_is_raised.1.json".

failures:
    test_i19_authorization::test_set_min_fee_absolute_requires_admin
    test_i42_min_fee_floor::test_fee_above_floor_is_unaffected
    test_i42_min_fee_floor::test_fee_below_floor_is_raised
    test_i42_min_fee_floor::test_floor_exceeds_cap_floor_takes_precedence
    test_i42_min_fee_floor::test_negative_floor_rejected
    test_i42_min_fee_floor::test_quote_and_compute_agree_under_floor
    test_i42_min_fee_floor::test_truncation_boundary_fee_bps_1

test result: FAILED. 227 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 23.72s

*** result: Failure(101)
