*** src/lib.rs:1010:20: replace < with == in StableRouteRouter::set_min_fee_absolute

*** mutation diff:
--- src/lib.rs
+++ replace < with == in StableRouteRouter::set_min_fee_absolute
@@ -1002,17 +1002,17 @@
     }
 
     /// Admin sets the absolute per-route fee floor (in source units).
     /// Rejects negative floors with `AmountMustBePositive` (#6). Emits
     /// a `minfee` event. The floor composes with the fee cap: a route is
     /// charged `max(min(amount * fee_bps / 10_000, max_fee_absolute), min_fee_absolute)`.
     pub fn set_min_fee_absolute(env: Env, min_fee: i128) {
         Self::require_admin(&env);
-        if min_fee < 0 {
+        if min_fee == /* ~ changed by cargo-mutants ~ */ 0 {
             panic_with_error!(&env, RouterError::AmountMustBePositive);
         }
         env.storage()
             .persistent()
             .set(&DataKey::MinFeeAbsolute, &min_fee);
         env.events().publish((symbol_short!("minfee"),), min_fee);
     }

---- test_i42_min_fee_floor::test_negative_floor_rejected stdout ----
Writing test snapshot file for test "test_i42_min_fee_floor::test_negative_floor_rejected" to "test_snapshots/test_i42_min_fee_floor/test_negative_floor_rejected.1.json".
note: test did not panic as expected at src/lib.rs:4293:8

failures:
    test_i42_min_fee_floor::test_negative_floor_rejected

test result: FAILED. 233 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 24.82s

*** result: Failure(101)
