*** src/lib.rs:1021:9: replace StableRouteRouter::get_pair_liquidity -> i128 with 0

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::get_pair_liquidity -> i128 with 0
@@ -1013,17 +1013,17 @@
         env.storage()
             .persistent()
             .set(&DataKey::MinFeeAbsolute, &min_fee);
         env.events().publish((symbol_short!("minfee"),), min_fee);
     }
 
     /// Read the reported liquidity for a pair (0 when absent).
     pub fn get_pair_liquidity(env: Env, source: Symbol, destination: Symbol) -> i128 {
-        Self::read_pair_liquidity(&env, &source, &destination)
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Read the configured liquidity oracle, if any.
     pub fn get_oracle(env: Env) -> Option<Address> {
         env.storage().persistent().get(&DataKey::Oracle)
     }
 
     /// Admin sets (or rotates) the scoped liquidity oracle.

---- test::test_admin_can_still_update_liquidity stdout ----

thread 'test::test_admin_can_still_update_liquidity' (126890) panicked at src/lib.rs:2723:9:
assertion `left == right` failed
  left: 0
 right: 10
Writing test snapshot file for test "test::test_admin_can_still_update_liquidity" to "test_snapshots/test/test_admin_can_still_update_liquidity.1.json".

---- test::test_admin_can_still_update_liquidity_after_removal stdout ----

thread 'test::test_admin_can_still_update_liquidity_after_removal' (126892) panicked at src/lib.rs:2850:9:
assertion `left == right` failed
  left: 0
 right: 42
Writing test snapshot file for test "test::test_admin_can_still_update_liquidity_after_removal" to "test_snapshots/test/test_admin_can_still_update_liquidity_after_removal.1.json".

---- test::test_oracle_can_be_reconfigured_after_removal stdout ----

thread 'test::test_oracle_can_be_reconfigured_after_removal' (126947) panicked at src/lib.rs:2923:9:
assertion `left == right` failed
  left: 0
 right: 7
Writing test snapshot file for test "test::test_oracle_can_be_reconfigured_after_removal" to "test_snapshots/test/test_oracle_can_be_reconfigured_after_removal.1.json".

failures:
    test::test_admin_can_still_update_liquidity
    test::test_admin_can_still_update_liquidity_after_removal
    test::test_oracle_can_be_reconfigured_after_removal
    test::test_oracle_can_update_before_removal_but_not_after
    test::test_oracle_can_update_liquidity
    test::test_pair_limits_liquidity_and_info_round_trip
    test_i15_bounds_liquidity::test_liquidity_at_bound_is_accepted
    test_i18_read_surface::test_i128_max_sentinel_means_unbounded
    test_i18_read_surface::test_pair_info_ext_after_routing
    test_i225_remove_oracle::test_admin_writes_liquidity_after_oracle_removal
    test_i225_remove_oracle::test_oracle_writes_liquidity_before_removal
    test_i230_paused_sweep::test_set_pair_liquidity_admin_succeeds_while_paused

test result: FAILED. 221 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 24.29s

*** result: Failure(101)
