*** src/lib.rs:1026:9: replace StableRouteRouter::get_oracle -> Option<Address> with None

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::get_oracle -> Option<Address> with None
@@ -1018,17 +1018,17 @@
 
     /// Read the reported liquidity for a pair (0 when absent).
     pub fn get_pair_liquidity(env: Env, source: Symbol, destination: Symbol) -> i128 {
         Self::read_pair_liquidity(&env, &source, &destination)
     }
 
     /// Read the configured liquidity oracle, if any.
     pub fn get_oracle(env: Env) -> Option<Address> {
-        env.storage().persistent().get(&DataKey::Oracle)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Admin sets (or rotates) the scoped liquidity oracle.
     ///
     /// Admin-gated. The oracle may update pair liquidity via
     /// [`Self::set_pair_liquidity`] and **nothing else** — it cannot set
     /// fees, pause, rotate admin, or upgrade. Emits `oracle_set`.
     /// Sets the oracle authorized to participate in liquidity updates.

---- test::test_oracle_can_be_reconfigured_after_removal stdout ----

thread 'test::test_oracle_can_be_reconfigured_after_removal' (129314) panicked at src/lib.rs:2915:9:
assertion `left == right` failed
  left: None
 right: Some(Contract(CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAITA4))
Writing test snapshot file for test "test::test_oracle_can_be_reconfigured_after_removal" to "test_snapshots/test/test_oracle_can_be_reconfigured_after_removal.1.json".

---- test::test_oracle_can_update_liquidity stdout ----

thread 'test::test_oracle_can_update_liquidity' (129318) panicked at src/lib.rs:2695:9:
assertion `left == right` failed
  left: None
 right: Some(Contract(CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHK3M))
Writing test snapshot file for test "test::test_oracle_can_update_liquidity" to "test_snapshots/test/test_oracle_can_update_liquidity.1.json".

---- test_i230_paused_sweep::test_set_oracle_succeeds_while_paused stdout ----

thread 'test_i230_paused_sweep::test_set_oracle_succeeds_while_paused' (129731) panicked at src/lib.rs:5248:9:
assertion `left == right` failed
  left: None
 right: Some(Contract(CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAITA4))
Writing test snapshot file for test "test_i230_paused_sweep::test_set_oracle_succeeds_while_paused" to "test_snapshots/test_i230_paused_sweep/test_set_oracle_succeeds_while_paused.1.json".

failures:
    test::test_oracle_can_be_reconfigured_after_removal
    test::test_oracle_can_update_liquidity
    test_i230_paused_sweep::test_set_oracle_succeeds_while_paused

test result: FAILED. 231 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 26.72s

*** result: Failure(101)
