*** src/lib.rs:1042:9: replace StableRouteRouter::set_oracle with ()

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::set_oracle with ()
@@ -1034,20 +1034,17 @@
     /// Sets the oracle authorized to participate in liquidity updates.
     ///
     /// Only the admin may call this function.
     ///
     /// The oracle cannot perform administrative operations.
     /// The oracle's responsibility is limited to liquidity publication through
     /// `set_pair_liquidity`.
     pub fn set_oracle(env: Env, oracle: Address) {
-        Self::require_admin(&env);
-        env.storage().persistent().set(&DataKey::Oracle, &oracle);
-        // Topic shortened to satisfy the 9-char `symbol_short!` limit.
-        env.events().publish((symbol_short!("orac_set"),), oracle);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Admin revokes the scoped liquidity oracle.
     ///
     /// Admin-gated (panics with [`RouterError::NotInitialized`] (#2) when
     /// no admin is set, like every other admin entrypoint). Removes
     /// `DataKey::Oracle` so [`Self::set_pair_liquidity`] once again
     /// accepts **only the admin**: its dual-auth check

---- test::test_oracle_can_be_reconfigured_after_removal stdout ----

thread 'test::test_oracle_can_be_reconfigured_after_removal' (129851) panicked at src/lib.rs:2912:9:
assertion `left == right` failed
  left: None
 right: Some(Contract(CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAITA4))
Writing test snapshot file for test "test::test_oracle_can_be_reconfigured_after_removal" to "test_snapshots/test/test_oracle_can_be_reconfigured_after_removal.1.json".

---- test::test_oracle_can_update_before_removal_but_not_after stdout ----

thread 'test::test_oracle_can_update_before_removal_but_not_after' (129852) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #16)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #16)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #16)], data:["contract call failed", set_pair_liquidity, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHK3M, USDC, EURC, 500]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #16)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA

---- test::test_oracle_can_update_liquidity stdout ----

thread 'test::test_oracle_can_update_liquidity' (129853) panicked at src/lib.rs:2692:9:
assertion `left == right` failed
  left: None
 right: Some(Contract(CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHK3M))
Writing test snapshot file for test "test::test_oracle_can_update_liquidity" to "test_snapshots/test/test_oracle_can_update_liquidity.1.json".

failures:
    test::test_oracle_can_be_reconfigured_after_removal
    test::test_oracle_can_update_before_removal_but_not_after
    test::test_oracle_can_update_liquidity
    test::test_remove_oracle_emits_orac_rm_event
    test_i153_version_uninitialized::test_set_oracle_panics_on_uninitialized_contract
    test_i19_authorization::test_set_oracle_requires_admin
    test_i225_remove_oracle::test_oracle_writes_liquidity_before_removal
    test_i230_paused_sweep::test_set_oracle_succeeds_while_paused
    test_i230_paused_sweep::test_set_pair_liquidity_oracle_succeeds_while_paused

test result: FAILED. 225 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.84s

*** result: Failure(101)
