*** src/lib.rs:1071:9: replace StableRouteRouter::remove_oracle with ()

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::remove_oracle with ()
@@ -1063,20 +1063,17 @@
     /// (`None` on a no-op) so indexers can audit revocations.
     /// Removes the configured oracle.
     ///
     /// Only the admin may call this function.
     ///
     /// After removal, liquidity updates cannot be performed until a new oracle
     /// is configured.
     pub fn remove_oracle(env: Env) {
-        Self::require_admin(&env);
-        let removed: Option<Address> = env.storage().persistent().get(&DataKey::Oracle);
-        env.storage().persistent().remove(&DataKey::Oracle);
-        env.events().publish((symbol_short!("orac_rm"),), removed);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Set the reported liquidity for a pair (source units).
     ///
     /// Dual-authorized: `caller` must be **either** the admin **or** the
     /// configured oracle, and must `require_auth()`. This implements
     /// least privilege — the frequently rotated oracle key can keep the
     /// liquidity feed fresh without holding governance power. When no

---- test::test_oracle_can_update_before_removal_but_not_after stdout ----

thread 'test::test_oracle_can_update_before_removal_but_not_after' (130194) panicked at src/lib.rs:2793:9:
assertion `left == right` failed
  left: Some(Contract(CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHK3M))
 right: None
Writing test snapshot file for test "test::test_oracle_can_update_before_removal_but_not_after" to "test_snapshots/test/test_oracle_can_update_before_removal_but_not_after.1.json".

---- test::test_remove_oracle_emits_orac_rm_event stdout ----

thread 'test::test_remove_oracle_emits_orac_rm_event' (130290) panicked at src/lib.rs:2881:9:
assertion `left == right` failed: remove_oracle emits one orac_rm event
  left: 0
 right: 1
Writing test snapshot file for test "test::test_remove_oracle_emits_orac_rm_event" to "test_snapshots/test/test_remove_oracle_emits_orac_rm_event.1.json".

---- test::test_remove_oracle_is_idempotent stdout ----

thread 'test::test_remove_oracle_is_idempotent' (130298) panicked at src/lib.rs:2868:9:
assertion `left == right` failed
  left: Some(Contract(CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHK3M))
 right: None
Writing test snapshot file for test "test::test_remove_oracle_is_idempotent" to "test_snapshots/test/test_remove_oracle_is_idempotent.1.json".

failures:
    test::test_oracle_can_update_before_removal_but_not_after
    test::test_remove_oracle_emits_orac_rm_event
    test::test_remove_oracle_is_idempotent
    test::test_remove_oracle_noop_emits_event_with_none
    test::test_remove_oracle_panics_when_uninitialized
    test::test_remove_oracle_requires_admin_auth
    test::test_removed_oracle_rejected_with_not_authorized
    test_i225_remove_oracle::test_remove_oracle_noop_emits_orac_rm_with_none
    test_i225_remove_oracle::test_revoked_oracle_cannot_write_liquidity
    test_i230_paused_sweep::test_remove_oracle_succeeds_while_paused

test result: FAILED. 224 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 26.90s

*** result: Failure(101)
