*** src/lib.rs:1113:52: replace != with == in StableRouteRouter::set_pair_liquidity

*** mutation diff:
--- src/lib.rs
+++ replace != with == in StableRouteRouter::set_pair_liquidity
@@ -1105,17 +1105,17 @@
     ) {
         caller.require_auth();
         let admin: Address = env
             .storage()
             .instance()
             .get(&DataKey::Admin)
             .unwrap_or_else(|| panic_with_error!(&env, RouterError::NotInitialized));
         let oracle: Option<Address> = env.storage().persistent().get(&DataKey::Oracle);
-        if caller != admin && Some(caller.clone()) != oracle {
+        if caller != admin && Some(caller.clone()) == /* ~ changed by cargo-mutants ~ */ oracle {
             panic_with_error!(&env, RouterError::NotAuthorized);
         }
         if liquidity < 0 {
             panic_with_error!(&env, RouterError::AmountMustBePositive);
         }
         Self::require_pair_registered(&env, &source, &destination);
         env.storage().persistent().set(
             &DataKey::PairLiquidity(source.clone(), destination.clone()),

---- test::test_oracle_can_be_reconfigured_after_removal stdout ----

thread 'test::test_oracle_can_be_reconfigured_after_removal' (132932) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #16)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #16)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #16)], data:["contract call failed", set_pair_liquidity, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAITA4, USDC, EURC, 7]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #16)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAF

---- test::test_oracle_can_update_before_removal_but_not_after stdout ----

thread 'test::test_oracle_can_update_before_removal_but_not_after' (132935) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #16)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #16)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #16)], data:["contract call failed", set_pair_liquidity, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHK3M, USDC, EURC, 500]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #16)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA

---- test::test_oracle_can_update_liquidity stdout ----

thread 'test::test_oracle_can_update_liquidity' (132940) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #16)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #16)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #16)], data:["contract call failed", set_pair_liquidity, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHK3M, USDC, EURC, 777]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #16)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Erro

failures:
    test::test_oracle_can_be_reconfigured_after_removal
    test::test_oracle_can_update_before_removal_but_not_after
    test::test_oracle_can_update_liquidity
    test::test_random_caller_cannot_update_liquidity
    test::test_removed_oracle_rejected_with_not_authorized
    test_i225_remove_oracle::test_oracle_writes_liquidity_before_removal
    test_i230_paused_sweep::test_set_pair_liquidity_oracle_succeeds_while_paused

test result: FAILED. 227 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.96s

*** result: Failure(101)
