*** src/lib.rs:1132:9: replace StableRouteRouter::get_pair_max_amount -> i128 with 0

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::get_pair_max_amount -> i128 with 0
@@ -1124,17 +1124,17 @@
         env.events().publish(
             (symbol_short!("liq_set"),),
             (source, destination, liquidity),
         );
     }
 
     /// Read the per-pair maximum (i128::MAX when absent).
     pub fn get_pair_max_amount(env: Env, source: Symbol, destination: Symbol) -> i128 {
-        Self::read_pair_max(&env, &source, &destination)
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Admin sets the per-pair maximum routable amount.
     ///
     /// Requires the pair to already be registered via
     /// [`Self::register_pair`]; rejects an unregistered pair with
     /// [`RouterError::PairNotRegistered`] (#5) so the maximum can never be
     /// configured for a corridor that was never (or no longer) enabled.

---- test::test_pair_limits_liquidity_and_info_round_trip stdout ----

thread 'test::test_pair_limits_liquidity_and_info_round_trip' (135803) panicked at src/lib.rs:2573:9:
assertion `left == right` failed
  left: 0
 right: 1000
Writing test snapshot file for test "test::test_pair_limits_liquidity_and_info_round_trip" to "test_snapshots/test/test_pair_limits_liquidity_and_info_round_trip.1.json".

---- test::test_purge_pair_metrics_does_not_touch_registration_or_config stdout ----

thread 'test::test_purge_pair_metrics_does_not_touch_registration_or_config' (135823) panicked at src/lib.rs:2525:9:
assertion `left == right` failed
  left: 0
 right: 1000
Writing test snapshot file for test "test::test_purge_pair_metrics_does_not_touch_registration_or_config" to "test_snapshots/test/test_purge_pair_metrics_does_not_touch_registration_or_config.1.json".

---- test_i153_version_uninitialized::test_read_only_operations_work_on_uninitialized_contract stdout ----

thread 'test_i153_version_uninitialized::test_read_only_operations_work_on_uninitialized_contract' (136238) panicked at src/lib.rs:4830:9:
assertion `left == right` failed
  left: 0
 right: 170141183460469231731687303715884105727
Writing test snapshot file for test "test_i153_version_uninitialized::test_read_only_operations_work_on_uninitialized_contract" to "test_snapshots/test_i153_version_uninitialized/test_read_only_operations_work_on_uninitialized_contract.1.json".

failures:
    test::test_pair_limits_liquidity_and_info_round_trip
    test::test_purge_pair_metrics_does_not_touch_registration_or_config
    test_i153_version_uninitialized::test_read_only_operations_work_on_uninitialized_contract
    test_i15_bounds_liquidity::test_max_amount_at_bound_is_accepted
    test_i15_bounds_liquidity::test_unset_bounds_behave_as_unbounded
    test_i18_read_surface::test_i128_max_sentinel_means_unbounded
    test_i18_read_surface::test_pair_info_ext_defaults_for_unconfigured_pair
    test_i230_paused_sweep::test_set_pair_max_amount_succeeds_while_paused

test result: FAILED. 226 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 26.76s

*** result: Failure(101)
