*** src/lib.rs:1164:9: replace StableRouteRouter::set_pair_min_amount with ()

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::set_pair_min_amount with ()
@@ -1156,24 +1156,17 @@
 
     /// Admin sets the per-pair minimum routable amount.
     ///
     /// Requires the pair to already be registered via
     /// [`Self::register_pair`]; rejects an unregistered pair with
     /// [`RouterError::PairNotRegistered`] (#5) so the minimum can never be
     /// configured for a corridor that was never (or no longer) enabled.
     pub fn set_pair_min_amount(env: Env, source: Symbol, destination: Symbol, min_amount: i128) {
-        Self::require_admin(&env);
-        if min_amount < 0 {
-            panic_with_error!(&env, RouterError::AmountMustBePositive);
-        }
-        Self::require_pair_registered(&env, &source, &destination);
-        env.storage()
-            .persistent()
-            .set(&DataKey::PairMinAmount(source, destination), &min_amount);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Clear all pair-scoped config that should not survive unregister + re-register.
     ///
     /// This intentionally excludes route counters, cumulative volume, and last-route timestamp;
     /// those operational-history slots are tracked separately from live pair configuration.
     fn clear_pair_config(env: &Env, source: Symbol, destination: Symbol) {
         let storage = env.storage().persistent();

---- test::test_compute_route_fee_rejects_below_minimum stdout ----
Writing test snapshot file for test "test::test_compute_route_fee_rejects_below_minimum" to "test_snapshots/test/test_compute_route_fee_rejects_below_minimum.1.json".
note: test did not panic as expected at src/lib.rs:2633:8

---- test::test_pair_limits_liquidity_and_info_round_trip stdout ----

thread 'test::test_pair_limits_liquidity_and_info_round_trip' (142087) panicked at src/lib.rs:2562:9:
assertion `left == right` failed
  left: 0
 right: 10
Writing test snapshot file for test "test::test_pair_limits_liquidity_and_info_round_trip" to "test_snapshots/test/test_pair_limits_liquidity_and_info_round_trip.1.json".

---- test::test_purge_pair_metrics_does_not_touch_registration_or_config stdout ----

thread 'test::test_purge_pair_metrics_does_not_touch_registration_or_config' (142159) panicked at src/lib.rs:2517:9:
assertion `left == right` failed
  left: 0
 right: 10
Writing test snapshot file for test "test::test_purge_pair_metrics_does_not_touch_registration_or_config" to "test_snapshots/test/test_purge_pair_metrics_does_not_touch_registration_or_config.1.json".

failures:
    test::test_compute_route_fee_rejects_below_minimum
    test::test_pair_limits_liquidity_and_info_round_trip
    test::test_purge_pair_metrics_does_not_touch_registration_or_config
    test::test_set_pair_min_amount_rejects_negative_value
    test_i153_version_uninitialized::test_set_pair_min_amount_panics_on_uninitialized_contract
    test_i15_bounds_liquidity::test_below_min_rejected
    test_i15_bounds_liquidity::test_min_amount_at_bound_is_accepted
    test_i18_read_surface::test_pair_info_ext_reflects_configuration
    test_i18_read_surface::test_pair_info_reflects_configuration
    test_i19_authorization::test_set_pair_min_amount_requires_admin
    test_i230_paused_sweep::test_set_pair_min_amount_succeeds_while_paused

test result: FAILED. 223 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 27.70s

*** result: Failure(101)
