*** src/lib.rs:1165:23: replace < with <= in StableRouteRouter::set_pair_min_amount

*** mutation diff:
--- src/lib.rs
+++ replace < with <= in StableRouteRouter::set_pair_min_amount
@@ -1157,17 +1157,17 @@
     /// Admin sets the per-pair minimum routable amount.
     ///
     /// Requires the pair to already be registered via
     /// [`Self::register_pair`]; rejects an unregistered pair with
     /// [`RouterError::PairNotRegistered`] (#5) so the minimum can never be
     /// configured for a corridor that was never (or no longer) enabled.
     pub fn set_pair_min_amount(env: Env, source: Symbol, destination: Symbol, min_amount: i128) {
         Self::require_admin(&env);
-        if min_amount < 0 {
+        if min_amount <= /* ~ changed by cargo-mutants ~ */ 0 {
             panic_with_error!(&env, RouterError::AmountMustBePositive);
         }
         Self::require_pair_registered(&env, &source, &destination);
         env.storage()
             .persistent()
             .set(&DataKey::PairMinAmount(source, destination), &min_amount);
     }

*** result: Success
