*** src/lib.rs:1236:9: replace StableRouteRouter::is_pair_registered -> bool with false

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::is_pair_registered -> bool with false
@@ -1228,20 +1228,17 @@
             destination.clone(),
         ));
         env.events()
             .publish((symbol_short!("pair_mrst"),), (source, destination));
     }
 
     /// Returns `true` iff `register_pair` has been called for this pair.
     pub fn is_pair_registered(env: Env, source: Symbol, destination: Symbol) -> bool {
-        env.storage()
-            .persistent()
-            .get(&DataKey::Pair(source, destination))
-            .unwrap_or(false)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Set the routing fee in basis points for a registered pair.
     ///
     /// Admin-gated. Rejects values above [`MAX_FEE_BPS`] with
     /// [`RouterError::FeeBpsTooHigh`]. Idempotent: setting the same
     /// fee twice is a re-assert and harmless.
     ///

---- test::test_purge_pair_metrics_does_not_touch_registration_or_config stdout ----

thread 'test::test_purge_pair_metrics_does_not_touch_registration_or_config' (148045) panicked at src/lib.rs:2519:9:
assertion failed: client.is_pair_registered(&src, &dest)
Writing test snapshot file for test "test::test_purge_pair_metrics_does_not_touch_registration_or_config" to "test_snapshots/test/test_purge_pair_metrics_does_not_touch_registration_or_config.1.json".

---- test::test_register_pair_is_idempotent stdout ----

thread 'test::test_register_pair_is_idempotent' (148076) panicked at src/lib.rs:1810:9:
assertion failed: client.is_pair_registered(&symbol_short!("USDC"), &symbol_short!("EURC"))
Writing test snapshot file for test "test::test_register_pair_is_idempotent" to "test_snapshots/test/test_register_pair_is_idempotent.1.json".

---- test::test_register_pair_round_trip stdout ----

thread 'test::test_register_pair_round_trip' (148079) panicked at src/lib.rs:1799:9:
assertion failed: client.is_pair_registered(&symbol_short!("USDC"), &symbol_short!("EURC"))
Writing test snapshot file for test "test::test_register_pair_round_trip" to "test_snapshots/test/test_register_pair_round_trip.1.json".

failures:
    test::test_purge_pair_metrics_does_not_touch_registration_or_config
    test::test_register_pair_is_idempotent
    test::test_register_pair_round_trip
    test::test_reregister_after_unregister_preserves_fee_and_clears_other_config
    test::test_unregister_then_reregister_preserves_metrics_by_default
    test_batch::test_register_pairs_happy_path
    test_batch::test_register_pairs_single_entry_succeeds
    test_i14_pause_gating::test_gated_entrypoint_succeeds_after_unpause
    test_i19_authorization::test_admin_can_register_with_auth
    test_i230_paused_sweep::test_all_gated_entrypoints_resume_after_unpause

test result: FAILED. 224 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.37s

*** result: Failure(101)
