*** src/lib.rs:1253:9: replace StableRouteRouter::set_pair_fee_bps with ()

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::set_pair_fee_bps with ()
@@ -1245,28 +1245,17 @@
     /// [`RouterError::FeeBpsTooHigh`]. Idempotent: setting the same
     /// fee twice is a re-assert and harmless.
     ///
     /// Requires the pair to already be registered via
     /// [`Self::register_pair`]; rejects an unregistered pair with
     /// [`RouterError::PairNotRegistered`] (#5) so the fee can never be
     /// configured for a corridor that was never (or no longer) enabled.
     pub fn set_pair_fee_bps(env: Env, source: Symbol, destination: Symbol, fee_bps: u32) {
-        Self::require_not_paused(&env);
-        Self::require_admin(&env);
-        if fee_bps > MAX_FEE_BPS {
-            panic_with_error!(&env, RouterError::FeeBpsTooHigh);
-        }
-        Self::require_pair_registered(&env, &source, &destination);
-        env.storage().persistent().set(
-            &DataKey::PairFeeBps(source.clone(), destination.clone()),
-            &fee_bps,
-        );
-        env.events()
-            .publish((symbol_short!("fee_set"),), (source, destination, fee_bps));
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Set the routing fee in basis points for multiple registered pairs
     /// in a single admin-gated call. Each entry is validated identically
     /// to [`Self::set_pair_fee_bps`] and gets its own `fee_set` event.
     ///
     /// **All-or-nothing:** if any entry fails validation the entire
     /// transaction is rolled back (Soroban transactions are atomic), so

---- test::prop_capped_fee_matches_pure_math stdout ----
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.1.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.2.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.3.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.4.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.5.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_

---- test::test_compute_route_fee_basic stdout ----

thread 'test::test_compute_route_fee_basic' (148189) panicked at src/lib.rs:1867:9:
assertion `left == right` failed
  left: 0
 right: 5000
Writing test snapshot file for test "test::test_compute_route_fee_basic" to "test_snapshots/test/test_compute_route_fee_basic.1.json".

---- test::test_compute_route_fee_clears_reentrancy_lock_after_success stdout ----

thread 'test::test_compute_route_fee_clears_reentrancy_lock_after_success' (148192) panicked at src/lib.rs:1994:9:
assertion `left == right` failed
  left: 0
 right: 5000
Writing test snapshot file for test "test::test_compute_route_fee_clears_reentrancy_lock_after_success" to "test_snapshots/test/test_compute_route_fee_clears_reentrancy_lock_after_success.1.json".

failures:
    test::prop_capped_fee_matches_pure_math
    test::test_compute_route_fee_basic
    test::test_compute_route_fee_clears_reentrancy_lock_after_success
    test::test_compute_route_fee_rejects_reentry_from_mock_callback
    test::test_compute_route_fee_releases_lock_for_consecutive_calls
    test::test_compute_route_fee_resumes_after_unpause
    test::test_pair_lifecycle_events_have_exact_payloads_and_counts
    test::test_pair_limits_liquidity_and_info_round_trip
    test::test_purge_pair_metrics_does_not_touch_registration_or_config
    test::test_quote_route_allowed_while_paused
    test::test_quote_route_and_compute_route_update_counters
    test::test_quote_route_does_not_mutate_counter_or_emit_route_event

test result: FAILED. 204 passed; 30 failed; 0 ignored; 0 measured; 0 filtered out; finished in 23.09s

*** result: Failure(101)
