*** src/lib.rs:1255:20: replace > with >= in StableRouteRouter::set_pair_fee_bps

*** mutation diff:
--- src/lib.rs
+++ replace > with >= in StableRouteRouter::set_pair_fee_bps
@@ -1247,17 +1247,17 @@
     ///
     /// Requires the pair to already be registered via
     /// [`Self::register_pair`]; rejects an unregistered pair with
     /// [`RouterError::PairNotRegistered`] (#5) so the fee can never be
     /// configured for a corridor that was never (or no longer) enabled.
     pub fn set_pair_fee_bps(env: Env, source: Symbol, destination: Symbol, fee_bps: u32) {
         Self::require_not_paused(&env);
         Self::require_admin(&env);
-        if fee_bps > MAX_FEE_BPS {
+        if fee_bps >= /* ~ changed by cargo-mutants ~ */ MAX_FEE_BPS {
             panic_with_error!(&env, RouterError::FeeBpsTooHigh);
         }
         Self::require_pair_registered(&env, &source, &destination);
         env.storage().persistent().set(
             &DataKey::PairFeeBps(source.clone(), destination.clone()),
             &fee_bps,
         );
         env.events()

---- test::prop_fee_within_amount stdout ----
Writing test snapshot file for test "test::prop_fee_within_amount" to "test_snapshots/test/prop_fee_within_amount.1.json".
Writing test snapshot file for test "test::prop_fee_within_amount" to "test_snapshots/test/prop_fee_within_amount.2.json".
Writing test snapshot file for test "test::prop_fee_within_amount" to "test_snapshots/test/prop_fee_within_amount.3.json".
Writing test snapshot file for test "test::prop_fee_within_amount" to "test_snapshots/test/prop_fee_within_amount.4.json".
Writing test snapshot file for test "test::prop_fee_within_amount" to "test_snapshots/test/prop_fee_within_amount.5.json".
Writing test snapshot file for test "test::prop_fee_within_amount" to "test_snapshots/test/prop_fee_within_amount.6.json".
Writing test snapshot file for test "test::prop_fee_within_amount" to "test_snapshots/test/prop_fee_within_amount.7.

---- test_i16_fee_arithmetic::test_quote_and_compute_agree_across_fee_tiers stdout ----

thread 'test_i16_fee_arithmetic::test_quote_and_compute_agree_across_fee_tiers' (151585) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #4)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #4)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #4)], data:["contract call failed", set_pair_fee_bps, [USDC, EURC, 1000]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #4)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Err

---- test_i16_fee_arithmetic::test_quote_route_net_equals_amount_minus_fee_at_max_fee_bps stdout ----

thread 'test_i16_fee_arithmetic::test_quote_route_net_equals_amount_minus_fee_at_max_fee_bps' (151602) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #4)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #4)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #4)], data:["contract call failed", set_pair_fee_bps, [USDC, EURC, 1000]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #4)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA

failures:
    test::prop_fee_within_amount
    test_i16_fee_arithmetic::test_quote_and_compute_agree_across_fee_tiers
    test_i16_fee_arithmetic::test_quote_route_net_equals_amount_minus_fee_at_max_fee_bps

test result: FAILED. 231 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 28.63s

*** result: Failure(101)
