*** src/lib.rs:1278:9: replace StableRouteRouter::set_pair_fees_bps with ()

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::set_pair_fees_bps with ()
@@ -1270,36 +1270,17 @@
     ///
     /// **All-or-nothing:** if any entry fails validation the entire
     /// transaction is rolled back (Soroban transactions are atomic), so
     /// callers must ensure every entry is well-formed before invoking
     /// this. Requires at least one entry; an empty batch panics with
     /// [`RouterError::EmptyBatch`]. Capped at [`MAX_BATCH_SIZE`] entries;
     /// exceeding it panics with [`RouterError::BatchTooLarge`].
     pub fn set_pair_fees_bps(env: Env, entries: Vec<(Symbol, Symbol, u32)>) {
-        Self::require_not_paused(&env);
-        Self::require_admin(&env);
-        if entries.is_empty() {
-            panic_with_error!(&env, RouterError::EmptyBatch);
-        }
-        if entries.len() > MAX_BATCH_SIZE {
-            panic_with_error!(&env, RouterError::BatchTooLarge);
-        }
-        for (source, destination, fee_bps) in entries.iter() {
-            if fee_bps > MAX_FEE_BPS {
-                panic_with_error!(&env, RouterError::FeeBpsTooHigh);
-            }
-            Self::require_pair_registered(&env, &source, &destination);
-            env.storage().persistent().set(
-                &DataKey::PairFeeBps(source.clone(), destination.clone()),
-                &fee_bps,
-            );
-            env.events()
-                .publish((symbol_short!("fee_set"),), (source, destination, fee_bps));
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the configured fee in basis points for a pair, or 0 if
     /// no fee has been set (a registered pair with no fee is free).
     pub fn get_pair_fee_bps(env: Env, source: Symbol, destination: Symbol) -> u32 {
         Self::read_pair_fee_bps(&env, &source, &destination)
     }

---- test_batch::test_set_pair_fees_bps_atomic_rollback_on_high_fee stdout ----
Writing test snapshot file for test "test_batch::test_set_pair_fees_bps_atomic_rollback_on_high_fee" to "test_snapshots/test_batch/test_set_pair_fees_bps_atomic_rollback_on_high_fee.1.json".
note: test did not panic as expected at src/lib.rs:4441:8

---- test_batch::test_set_pair_fees_bps_happy_path stdout ----

thread 'test_batch::test_set_pair_fees_bps_happy_path' (151398) panicked at src/lib.rs:4406:9:
assertion `left == right` failed
  left: 0
 right: 25
Writing test snapshot file for test "test_batch::test_set_pair_fees_bps_happy_path" to "test_snapshots/test_batch/test_set_pair_fees_bps_happy_path.1.json".

---- test_batch::test_set_pair_fees_bps_panics_when_uninitialized stdout ----
Writing test snapshot file for test "test_batch::test_set_pair_fees_bps_panics_when_uninitialized" to "test_snapshots/test_batch/test_set_pair_fees_bps_panics_when_uninitialized.1.json".
note: test did not panic as expected at src/lib.rs:4498:8

failures:
    test_batch::test_set_pair_fees_bps_atomic_rollback_on_high_fee
    test_batch::test_set_pair_fees_bps_happy_path
    test_batch::test_set_pair_fees_bps_panics_when_uninitialized
    test_batch::test_set_pair_fees_bps_rejects_empty_batch
    test_batch::test_set_pair_fees_bps_rejects_too_large_batch
    test_batch::test_set_pair_fees_bps_rejects_unregistered_pair
    test_batch::test_set_pair_fees_bps_rejects_when_paused
    test_batch::test_set_pair_fees_bps_single_entry_succeeds
    test_i153_version_uninitialized::test_set_pair_fees_bps_panics_on_uninitialized_contract
    test_i19_authorization::test_set_pair_fees_bps_requires_admin
    test_i230_paused_sweep::test_all_gated_entrypoints_resume_after_unpause
    test_i230_paused_sweep::test_set_pair_fees_bps_rejected_while_paused

test result: FAILED. 222 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 26.53s

*** result: Failure(101)
