*** src/lib.rs:1283:26: replace > with == in StableRouteRouter::set_pair_fees_bps

*** mutation diff:
--- src/lib.rs
+++ replace > with == in StableRouteRouter::set_pair_fees_bps
@@ -1275,17 +1275,17 @@
     /// [`RouterError::EmptyBatch`]. Capped at [`MAX_BATCH_SIZE`] entries;
     /// exceeding it panics with [`RouterError::BatchTooLarge`].
     pub fn set_pair_fees_bps(env: Env, entries: Vec<(Symbol, Symbol, u32)>) {
         Self::require_not_paused(&env);
         Self::require_admin(&env);
         if entries.is_empty() {
             panic_with_error!(&env, RouterError::EmptyBatch);
         }
-        if entries.len() > MAX_BATCH_SIZE {
+        if entries.len() == /* ~ changed by cargo-mutants ~ */ MAX_BATCH_SIZE {
             panic_with_error!(&env, RouterError::BatchTooLarge);
         }
         for (source, destination, fee_bps) in entries.iter() {
             if fee_bps > MAX_FEE_BPS {
                 panic_with_error!(&env, RouterError::FeeBpsTooHigh);
             }
             Self::require_pair_registered(&env, &source, &destination);
             env.storage().persistent().set(

---- test_batch::test_set_pair_fees_bps_rejects_too_large_batch stdout ----

thread 'test_batch::test_set_pair_fees_bps_rejects_too_large_batch' (151921) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #5)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #5)], data:"escalating error to panic"
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #5)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #5)], data:"escalating error to panic"
   4: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA

failures:
    test_batch::test_set_pair_fees_bps_rejects_too_large_batch

test result: FAILED. 233 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.39s

*** result: Failure(101)
