*** src/lib.rs:1287:24: replace > with == in StableRouteRouter::set_pair_fees_bps

*** mutation diff:
--- src/lib.rs
+++ replace > with == in StableRouteRouter::set_pair_fees_bps
@@ -1279,17 +1279,17 @@
         Self::require_admin(&env);
         if entries.is_empty() {
             panic_with_error!(&env, RouterError::EmptyBatch);
         }
         if entries.len() > MAX_BATCH_SIZE {
             panic_with_error!(&env, RouterError::BatchTooLarge);
         }
         for (source, destination, fee_bps) in entries.iter() {
-            if fee_bps > MAX_FEE_BPS {
+            if fee_bps == /* ~ changed by cargo-mutants ~ */ MAX_FEE_BPS {
                 panic_with_error!(&env, RouterError::FeeBpsTooHigh);
             }
             Self::require_pair_registered(&env, &source, &destination);
             env.storage().persistent().set(
                 &DataKey::PairFeeBps(source.clone(), destination.clone()),
                 &fee_bps,
             );
             env.events()

---- test_batch::test_set_pair_fees_bps_atomic_rollback_on_high_fee stdout ----
Writing test snapshot file for test "test_batch::test_set_pair_fees_bps_atomic_rollback_on_high_fee" to "test_snapshots/test_batch/test_set_pair_fees_bps_atomic_rollback_on_high_fee.1.json".
note: test did not panic as expected at src/lib.rs:4460:8

failures:
    test_batch::test_set_pair_fees_bps_atomic_rollback_on_high_fee

test result: FAILED. 233 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 27.44s

*** result: Failure(101)
