*** src/lib.rs:1287:24: replace > with >= in StableRouteRouter::set_pair_fees_bps

*** mutation diff:
--- src/lib.rs
+++ replace > with >= in StableRouteRouter::set_pair_fees_bps
@@ -1279,17 +1279,17 @@
         Self::require_admin(&env);
         if entries.is_empty() {
             panic_with_error!(&env, RouterError::EmptyBatch);
         }
         if entries.len() > MAX_BATCH_SIZE {
             panic_with_error!(&env, RouterError::BatchTooLarge);
         }
         for (source, destination, fee_bps) in entries.iter() {
-            if fee_bps > MAX_FEE_BPS {
+            if fee_bps >= /* ~ changed by cargo-mutants ~ */ MAX_FEE_BPS {
                 panic_with_error!(&env, RouterError::FeeBpsTooHigh);
             }
             Self::require_pair_registered(&env, &source, &destination);
             env.storage().persistent().set(
                 &DataKey::PairFeeBps(source.clone(), destination.clone()),
                 &fee_bps,
             );
             env.events()

*** result: Success
