*** src/lib.rs:1303:9: replace StableRouteRouter::get_pair_fee_bps -> u32 with 1

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::get_pair_fee_bps -> u32 with 1
@@ -1295,17 +1295,17 @@
             env.events()
                 .publish((symbol_short!("fee_set"),), (source, destination, fee_bps));
         }
     }
 
     /// Returns the configured fee in basis points for a pair, or 0 if
     /// no fee has been set (a registered pair with no fee is free).
     pub fn get_pair_fee_bps(env: Env, source: Symbol, destination: Symbol) -> u32 {
-        Self::read_pair_fee_bps(&env, &source, &destination)
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Compute the fee in source units for routing `amount` through the
     /// `(source, destination)` pair.
     ///
     /// Rejects unregistered pairs with [`RouterError::PairNotRegistered`]
     /// and non-positive amounts with [`RouterError::AmountMustBePositive`]
     /// so off-chain callers always get a clear typed error instead of a

---- test::test_get_pair_fee_bps_defaults_to_zero stdout ----

thread 'test::test_get_pair_fee_bps_defaults_to_zero' (157391) panicked at src/lib.rs:1835:9:
assertion `left == right` failed
  left: 1
 right: 0
Writing test snapshot file for test "test::test_get_pair_fee_bps_defaults_to_zero" to "test_snapshots/test/test_get_pair_fee_bps_defaults_to_zero.1.json".

---- test::test_purge_pair_metrics_does_not_touch_registration_or_config stdout ----

thread 'test::test_purge_pair_metrics_does_not_touch_registration_or_config' (157459) panicked at src/lib.rs:2523:9:
assertion `left == right` failed
  left: 1
 right: 50
Writing test snapshot file for test "test::test_purge_pair_metrics_does_not_touch_registration_or_config" to "test_snapshots/test/test_purge_pair_metrics_does_not_touch_registration_or_config.1.json".

---- test::test_reregister_after_unregister_preserves_fee_and_clears_other_config stdout ----

thread 'test::test_reregister_after_unregister_preserves_fee_and_clears_other_config' (157511) panicked at src/lib.rs:2421:9:
assertion `left == right` failed
  left: 1
 right: 42
Writing test snapshot file for test "test::test_reregister_after_unregister_preserves_fee_and_clears_other_config" to "test_snapshots/test/test_reregister_after_unregister_preserves_fee_and_clears_other_config.1.json".

failures:
    test::test_get_pair_fee_bps_defaults_to_zero
    test::test_purge_pair_metrics_does_not_touch_registration_or_config
    test::test_reregister_after_unregister_preserves_fee_and_clears_other_config
    test::test_set_pair_fee_bps_round_trip
    test_batch::test_set_pair_fees_bps_happy_path
    test_batch::test_set_pair_fees_bps_single_entry_succeeds
    test_i153_version_uninitialized::test_read_only_operations_work_on_uninitialized_contract
    test_i18_read_surface::test_i128_max_sentinel_means_unbounded
    test_i18_read_surface::test_pair_info_ext_defaults_for_unconfigured_pair
    test_i230_paused_sweep::test_all_gated_entrypoints_resume_after_unpause

test result: FAILED. 224 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.89s

*** result: Failure(101)
