*** src/lib.rs:1353:12: delete ! in StableRouteRouter::compute_route_fee

*** mutation diff:
--- src/lib.rs
+++ delete ! in StableRouteRouter::compute_route_fee
@@ -1345,17 +1345,17 @@
 
         if Self::paused(&env) {
             Self::route_abort(&env, RouterError::ContractPaused);
         }
         if amount <= 0 {
             Self::route_abort(&env, RouterError::AmountMustBePositive);
         }
 
-        if !env
+        if  /* ~ changed by cargo-mutants ~ */env
             .storage()
             .persistent()
             .get::<_, bool>(&DataKey::Pair(source.clone(), destination.clone()))
             .unwrap_or(false)
         {
             Self::route_abort(&env, RouterError::PairNotRegistered);
         }
         let min_amount = Self::read_pair_min(&env, &source, &destination);

---- test::prop_fee_never_exceeds_amount stdout ----

thread 'test::prop_fee_never_exceeds_amount' (159237) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #5)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #5)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #5)], data:["contract call failed", compute_route_fee, [USDC, EURC, 33248907534022594640983223563184902638]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #5)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #5)], data:"escalating

---- test::prop_capped_fee_matches_pure_math stdout ----

thread 'test::prop_capped_fee_matches_pure_math' (159236) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #5)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #5)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #5)], data:["contract call failed", compute_route_fee, [USDC, EURC, 195419514886280770458253]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #5)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #5)], data:"escalating error

---- test::prop_overflow_fallback_is_zero stdout ----

thread 'test::prop_overflow_fallback_is_zero' (159604) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #5)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #5)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #5)], data:["contract call failed", compute_route_fee, [USDC, EURC, 33385799809949041278073927643337601841]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #5)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #5)], data:"escalati

failures:
    test::prop_capped_fee_matches_pure_math
    test::prop_fee_never_exceeds_amount
    test::prop_fee_within_amount
    test::prop_overflow_fallback_is_zero
    test::prop_quote_matches_compute
    test::prop_zero_bps_yields_zero_fee
    test::prop_zero_fee_bps_is_free
    test::test_compute_route_fee_basic
    test::test_compute_route_fee_clears_reentrancy_lock_after_success
    test::test_compute_route_fee_counter_is_global_across_pairs
    test::test_compute_route_fee_emits_route_event_with_payload
    test::test_compute_route_fee_is_zero_when_fee_unset

test result: FAILED. 179 passed; 55 failed; 0 ignored; 0 measured; 0 filtered out; finished in 19.87s

*** result: Failure(101)
