*** src/lib.rs:1366:19: replace > with == in StableRouteRouter::compute_route_fee

*** mutation diff:
--- src/lib.rs
+++ replace > with == in StableRouteRouter::compute_route_fee
@@ -1358,17 +1358,17 @@
         {
             Self::route_abort(&env, RouterError::PairNotRegistered);
         }
         let min_amount = Self::read_pair_min(&env, &source, &destination);
         if amount < min_amount {
             Self::route_abort(&env, RouterError::AmountBelowMin);
         }
         let max_amount = Self::read_pair_max(&env, &source, &destination);
-        if amount > max_amount {
+        if amount == /* ~ changed by cargo-mutants ~ */ max_amount {
             Self::route_abort(&env, RouterError::AmountAboveMax);
         }
         let liquidity: i128 = env
             .storage()
             .persistent()
             .get(&DataKey::PairLiquidity(source.clone(), destination.clone()))
             .unwrap_or(i128::MAX);
         if amount > liquidity {

---- test::test_compute_route_fee_rejects_above_maximum stdout ----
Writing test snapshot file for test "test::test_compute_route_fee_rejects_above_maximum" to "test_snapshots/test/test_compute_route_fee_rejects_above_maximum.1.json".
note: test did not panic as expected at src/lib.rs:2650:8

---- test_i15_bounds_liquidity::test_above_max_rejected stdout ----
Writing test snapshot file for test "test_i15_bounds_liquidity::test_above_max_rejected" to "test_snapshots/test_i15_bounds_liquidity/test_above_max_rejected.1.json".
note: test did not panic as expected at src/lib.rs:3365:8

---- test_i15_bounds_liquidity::test_max_amount_at_bound_is_accepted stdout ----

thread 'test_i15_bounds_liquidity::test_max_amount_at_bound_is_accepted' (163591) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #11)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #11)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #11)], data:["contract call failed", compute_route_fee, [USDC, EURC, 1000]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #11)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contra

failures:
    test::test_compute_route_fee_rejects_above_maximum
    test_i15_bounds_liquidity::test_above_max_rejected
    test_i15_bounds_liquidity::test_max_amount_at_bound_is_accepted
    test_i16_fee_arithmetic::test_overflow_path_returns_zero

test result: FAILED. 230 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 24.80s

*** result: Failure(101)
