*** src/lib.rs:1464:24: replace / with % in StableRouteRouter::compute_route_fee

*** mutation diff:
--- src/lib.rs
+++ replace / with % in StableRouteRouter::compute_route_fee
@@ -1456,17 +1456,17 @@
             (source.clone(), destination.clone(), amount),
         );
         let fee_bps = Self::read_pair_fee_bps(&env, &source, &destination);
         // amount * fee_bps / 10_000, in i128 to avoid u32*i128 overflow on
         // amounts near i128::MAX. fee_bps is capped at MAX_FEE_BPS so the
         // multiplication is bounded.
         let fee = amount
             .checked_mul(fee_bps as i128)
-            .map(|n| n / BPS_DENOMINATOR)
+            .map(|n| n % /* ~ changed by cargo-mutants ~ */ BPS_DENOMINATOR)
             .unwrap_or(0);
         let fee = Self::apply_fee_cap(&env, fee);
         let fee = Self::apply_fee_floor(&env, fee);
         Self::exit_nonreentrant(&env);
         fee
     }
 
     /// Compute a deterministic, direction-sensitive route identifier for a

---- test::prop_capped_fee_matches_pure_math stdout ----
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.1.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.2.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.3.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.4.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.5.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_

---- test::prop_quote_matches_compute stdout ----
Writing test snapshot file for test "test::prop_quote_matches_compute" to "test_snapshots/test/prop_quote_matches_compute.1.json".
Writing test snapshot file for test "test::prop_quote_matches_compute" to "test_snapshots/test/prop_quote_matches_compute.2.json".
Writing test snapshot file for test "test::prop_quote_matches_compute" to "test_snapshots/test/prop_quote_matches_compute.3.json".
Writing test snapshot file for test "test::prop_quote_matches_compute" to "test_snapshots/test/prop_quote_matches_compute.4.json".
Writing test snapshot file for test "test::prop_quote_matches_compute" to "test_snapshots/test/prop_quote_matches_compute.5.json".
Writing test snapshot file for test "test::prop_quote_matches_compute" to "test_snapshots/test/prop_quote_matches_compute.6.json".
Writing test snapshot file for test "test::prop_quote_matches_co

---- test::test_compute_route_fee_basic stdout ----

thread 'test::test_compute_route_fee_basic' (173952) panicked at src/lib.rs:1878:9:
assertion `left == right` failed
  left: 0
 right: 5000
Writing test snapshot file for test "test::test_compute_route_fee_basic" to "test_snapshots/test/test_compute_route_fee_basic.1.json".

failures:
    test::prop_capped_fee_matches_pure_math
    test::prop_quote_matches_compute
    test::test_compute_route_fee_basic
    test::test_compute_route_fee_clears_reentrancy_lock_after_success
    test::test_compute_route_fee_rejects_reentry_from_mock_callback
    test::test_compute_route_fee_releases_lock_for_consecutive_calls
    test::test_compute_route_fee_resumes_after_unpause
    test::test_quote_route_and_compute_route_update_counters
    test_i16_fee_arithmetic::test_quote_and_compute_agree_across_fee_tiers
    test_i16_fee_arithmetic::test_quote_matches_compute_fee
    test_i16_fee_arithmetic::test_truncating_division_rounds_toward_zero
    test_i18_read_surface::test_quote_route_is_non_mutating_and_matches_compute

test result: FAILED. 212 passed; 22 failed; 0 ignored; 0 measured; 0 filtered out; finished in 26.53s

*** result: Failure(101)
