*** src/lib.rs:335:9: replace StableRouteRouter::require_pair_registered with ()

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::require_pair_registered with ()
@@ -327,24 +327,17 @@
     /// Every per-pair config setter (`set_pair_fee_bps`,
     /// `set_pair_min_amount`, `set_pair_max_amount`, `set_pair_liquidity`)
     /// calls this after its own admin/sign validation so a config write can
     /// never create an orphan storage slot for a corridor an operator never
     /// registered. Reuses the same [`RouterError::PairNotRegistered`] (#5)
     /// that `compute_route_fee` and `quote_route` already raise, keeping
     /// one error code for "this pair does not exist" across the contract.
     fn require_pair_registered(env: &Env, source: &Symbol, destination: &Symbol) {
-        if !env
-            .storage()
-            .persistent()
-            .get::<_, bool>(&DataKey::Pair(source.clone(), destination.clone()))
-            .unwrap_or(false)
-        {
-            panic_with_error!(env, RouterError::PairNotRegistered);
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Acquire the reentrancy lock; panics [`RouterError::ReentrantCall`]
     /// if already held. Paired with [`Self::exit_nonreentrant`] on every
     /// return path so that a re-entrant invocation (for example via a
     /// future malicious token callback) is rejected instead of operating
     /// on partially-applied effects.
     fn enter_nonreentrant(env: &Env) {

---- test_batch::test_set_pair_fees_bps_rejects_unregistered_pair stdout ----
Writing test snapshot file for test "test_batch::test_set_pair_fees_bps_rejects_unregistered_pair" to "test_snapshots/test_batch/test_set_pair_fees_bps_rejects_unregistered_pair.1.json".
note: test did not panic as expected at src/lib.rs:4470:8

failures:
    test_batch::test_set_pair_fees_bps_rejects_unregistered_pair

test result: FAILED. 233 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 26.26s

*** result: Failure(101)
