*** src/lib.rs:368:9: replace StableRouteRouter::exit_nonreentrant with ()

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::exit_nonreentrant with ()
@@ -360,19 +360,17 @@
             .persistent()
             .set(&DataKey::ReentrancyLock, &true);
     }
 
     /// Release the reentrancy lock. Must be called before every return
     /// from a guarded entrypoint, including the success path, so that
     /// back-to-back calls work.
     fn exit_nonreentrant(env: &Env) {
-        env.storage()
-            .persistent()
-            .set(&DataKey::ReentrancyLock, &false);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Release the reentrancy lock and panic with `err`. Consolidates the
     /// exit-then-panic pattern used on every guard-failure path of
     /// [`Self::compute_route_fee`] so the lock is never leaked on a
     /// rejection.
     fn route_abort(env: &Env, err: RouterError) -> ! {
         Self::exit_nonreentrant(env);

---- test::test_compute_route_fee_clears_reentrancy_lock_after_success stdout ----

thread 'test::test_compute_route_fee_clears_reentrancy_lock_after_success' (31806) panicked at src/lib.rs:2011:9:
assertion failed: !lock_after_first
Writing test snapshot file for test "test::test_compute_route_fee_clears_reentrancy_lock_after_success" to "test_snapshots/test/test_compute_route_fee_clears_reentrancy_lock_after_success.1.json".

---- test::test_compute_route_fee_counter_is_global_across_pairs stdout ----

thread 'test::test_compute_route_fee_counter_is_global_across_pairs' (31807) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #15)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #15)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #15)], data:["contract call failed", compute_route_fee, [XLM, USDC, 1000]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #15)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #15)],

---- test::test_compute_route_fee_releases_lock_for_consecutive_calls stdout ----

thread 'test::test_compute_route_fee_releases_lock_for_consecutive_calls' (31817) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #15)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #15)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #15)], data:["contract call failed", compute_route_fee, [USDC, EURC, 1000000]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #15)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Co

failures:
    test::test_compute_route_fee_clears_reentrancy_lock_after_success
    test::test_compute_route_fee_counter_is_global_across_pairs
    test::test_compute_route_fee_releases_lock_for_consecutive_calls
    test_i16_fee_arithmetic::test_quote_and_compute_agree_across_fee_tiers
    test_i16_fee_arithmetic::test_route_counter_increments_and_never_panics
    test_i18_read_surface::test_pair_info_ext_after_routing
    test_i18_read_surface::test_pair_route_count_and_volume_stay_isolated_per_pair
    test_i18_read_surface::test_pair_volume_saturates_near_i128_max_without_panicking
    test_i42_min_fee_floor::test_truncation_boundary_fee_bps_1

test result: FAILED. 225 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 21.88s

*** result: Failure(101)
