*** src/lib.rs:385:9: replace StableRouteRouter::paused -> bool with true

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::paused -> bool with true
@@ -377,20 +377,17 @@
     fn route_abort(env: &Env, err: RouterError) -> ! {
         Self::exit_nonreentrant(env);
         panic_with_error!(env, err)
     }
 
     /// Read the paused flag from the instance-storage hot global.
     /// Single source of truth for the `Paused` sentinel (absent → `false`).
     fn paused(env: &Env) -> bool {
-        env.storage()
-            .instance()
-            .get(&DataKey::Paused)
-            .unwrap_or(false)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Panic with [`RouterError::ContractPaused`] when the router is paused.
     /// Shared by every state-changing, pause-gated entrypoint.
     fn require_not_paused(env: &Env) {
         if Self::paused(env) {
             panic_with_error!(env, RouterError::ContractPaused);
         }

---- test::prop_fee_never_exceeds_amount stdout ----

thread 'test::prop_fee_never_exceeds_amount' (33616) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #9)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #9)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #9)], data:["contract call failed", register_pair, [USDC, EURC]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #9)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #9)], data:"escalating error to panic"
   4: [Failed Diagnostic Eve

---- test::prop_capped_fee_matches_pure_math stdout ----

thread 'test::prop_capped_fee_matches_pure_math' (33615) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #9)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #9)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #9)], data:["contract call failed", register_pair, [USDC, EURC]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #9)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #9)], data:"escalating error to panic"
   4: [Failed Diagno

---- test::prop_fee_within_amount stdout ----

thread 'test::prop_fee_within_amount' (33651) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #9)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #9)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #9)], data:["contract call failed", register_pair, [USDC, EURC]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #9)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #9)], data:"escalating error to panic"
   4: [Failed Diagnostic Event (not emitte

failures:
    test::prop_capped_fee_matches_pure_math
    test::prop_fee_never_exceeds_amount
    test::prop_fee_within_amount
    test::prop_overflow_fallback_is_zero
    test::prop_quote_matches_compute
    test::prop_zero_bps_yields_zero_fee
    test::prop_zero_fee_bps_is_free
    test::test_admin_can_still_update_liquidity
    test::test_admin_can_still_update_liquidity_after_removal
    test::test_compute_route_fee_basic
    test::test_compute_route_fee_clears_reentrancy_lock_after_success
    test::test_compute_route_fee_counter_is_global_across_pairs

test result: FAILED. 101 passed; 133 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.87s

*** result: Failure(101)
