*** src/lib.rs:385:9: replace StableRouteRouter::paused -> bool with false

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::paused -> bool with false
@@ -377,20 +377,17 @@
     fn route_abort(env: &Env, err: RouterError) -> ! {
         Self::exit_nonreentrant(env);
         panic_with_error!(env, err)
     }
 
     /// Read the paused flag from the instance-storage hot global.
     /// Single source of truth for the `Paused` sentinel (absent → `false`).
     fn paused(env: &Env) -> bool {
-        env.storage()
-            .instance()
-            .get(&DataKey::Paused)
-            .unwrap_or(false)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Panic with [`RouterError::ContractPaused`] when the router is paused.
     /// Shared by every state-changing, pause-gated entrypoint.
     fn require_not_paused(env: &Env) {
         if Self::paused(env) {
             panic_with_error!(env, RouterError::ContractPaused);
         }

---- test::test_compute_route_fee_rejects_when_paused stdout ----
Writing test snapshot file for test "test::test_compute_route_fee_rejects_when_paused" to "test_snapshots/test/test_compute_route_fee_rejects_when_paused.1.json".
note: test did not panic as expected at src/lib.rs:2073:8

---- test::test_pause_and_unpause_round_trip stdout ----

thread 'test::test_pause_and_unpause_round_trip' (36025) panicked at src/lib.rs:2054:9:
assertion failed: client.is_paused()
Writing test snapshot file for test "test::test_pause_and_unpause_round_trip" to "test_snapshots/test/test_pause_and_unpause_round_trip.1.json".

---- test::test_register_pair_rejects_when_paused stdout ----
Writing test snapshot file for test "test::test_register_pair_rejects_when_paused" to "test_snapshots/test/test_register_pair_rejects_when_paused.1.json".
note: test did not panic as expected at src/lib.rs:2061:8

failures:
    test::test_compute_route_fee_rejects_when_paused
    test::test_pause_and_unpause_round_trip
    test::test_register_pair_rejects_when_paused
    test_batch::test_register_pairs_rejects_when_paused
    test_batch::test_set_pair_fees_bps_rejects_when_paused
    test_i14_pause_gating::test_double_pause_and_double_unpause_idempotent
    test_i14_pause_gating::test_is_paused_defaults_false_and_toggles
    test_i14_pause_gating::test_register_pair_rejected_while_paused
    test_i14_pause_gating::test_set_pair_fee_bps_rejected_while_paused
    test_i153_version_uninitialized::test_admin_operations_succeed_after_initialization
    test_i230_paused_sweep::test_all_gated_entrypoints_resume_after_unpause
    test_i230_paused_sweep::test_compute_route_fee_rejected_while_paused

test result: FAILED. 216 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 21.88s

*** result: Failure(101)
