*** src/lib.rs:394:9: replace StableRouteRouter::require_not_paused with ()

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::require_not_paused with ()
@@ -386,19 +386,17 @@
             .instance()
             .get(&DataKey::Paused)
             .unwrap_or(false)
     }
 
     /// Panic with [`RouterError::ContractPaused`] when the router is paused.
     /// Shared by every state-changing, pause-gated entrypoint.
     fn require_not_paused(env: &Env) {
-        if Self::paused(env) {
-            panic_with_error!(env, RouterError::ContractPaused);
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Finalise an admin handover: install `new_admin`, clear the pending
     /// slots, renew the instance TTL, and emit the `executed` event. Shared
     /// tail of [`Self::accept_admin_transfer`] and
     /// [`Self::force_admin_transfer`].
     fn finalize_admin_transfer(env: &Env, new_admin: Address) {
         env.storage().instance().set(&DataKey::Admin, &new_admin);

---- test::test_register_pair_rejects_when_paused stdout ----
Writing test snapshot file for test "test::test_register_pair_rejects_when_paused" to "test_snapshots/test/test_register_pair_rejects_when_paused.1.json".
note: test did not panic as expected at src/lib.rs:2062:8

---- test_batch::test_register_pairs_rejects_when_paused stdout ----
Writing test snapshot file for test "test_batch::test_register_pairs_rejects_when_paused" to "test_snapshots/test_batch/test_register_pairs_rejects_when_paused.1.json".
note: test did not panic as expected at src/lib.rs:4379:8

---- test_batch::test_set_pair_fees_bps_rejects_when_paused stdout ----
Writing test snapshot file for test "test_batch::test_set_pair_fees_bps_rejects_when_paused" to "test_snapshots/test_batch/test_set_pair_fees_bps_rejects_when_paused.1.json".
note: test did not panic as expected at src/lib.rs:4486:8

failures:
    test::test_register_pair_rejects_when_paused
    test_batch::test_register_pairs_rejects_when_paused
    test_batch::test_set_pair_fees_bps_rejects_when_paused
    test_i14_pause_gating::test_register_pair_rejected_while_paused
    test_i14_pause_gating::test_set_pair_fee_bps_rejected_while_paused
    test_i230_paused_sweep::test_register_pair_rejected_while_paused
    test_i230_paused_sweep::test_register_pairs_rejected_while_paused
    test_i230_paused_sweep::test_set_pair_fee_bps_rejected_while_paused
    test_i230_paused_sweep::test_set_pair_fees_bps_rejected_while_paused

test result: FAILED. 225 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 20.91s

*** result: Failure(101)
