*** src/lib.rs:418:9: replace StableRouteRouter::read_pair_fee_bps -> u32 with 0

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::read_pair_fee_bps -> u32 with 0
@@ -410,20 +410,17 @@
     }
 
     /// Read the per-pair fee in basis points from persistent storage.
     ///
     /// Returns `0` (free) when the slot is absent — the documented
     /// default for an unconfigured, registered pair. This is the single
     /// source of truth for the [`DataKey::PairFeeBps`] sentinel value.
     fn read_pair_fee_bps(env: &Env, source: &Symbol, destination: &Symbol) -> u32 {
-        env.storage()
-            .persistent()
-            .get(&DataKey::PairFeeBps(source.clone(), destination.clone()))
-            .unwrap_or(0)
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Read the per-pair minimum routable amount from persistent storage.
     ///
     /// Returns `0` (no floor) when the slot is absent — the documented
     /// default. This is the single source of truth for the
     /// [`DataKey::PairMinAmount`] sentinel value.
     fn read_pair_min(env: &Env, source: &Symbol, destination: &Symbol) -> i128 {

---- test::prop_capped_fee_matches_pure_math stdout ----
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.1.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.2.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.3.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.4.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.5.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_

---- test::test_compute_route_fee_basic stdout ----

thread 'test::test_compute_route_fee_basic' (42050) panicked at src/lib.rs:1875:9:
assertion `left == right` failed
  left: 0
 right: 5000
Writing test snapshot file for test "test::test_compute_route_fee_basic" to "test_snapshots/test/test_compute_route_fee_basic.1.json".

---- test::test_compute_route_fee_clears_reentrancy_lock_after_success stdout ----

thread 'test::test_compute_route_fee_clears_reentrancy_lock_after_success' (42051) panicked at src/lib.rs:2002:9:
assertion `left == right` failed
  left: 0
 right: 5000
Writing test snapshot file for test "test::test_compute_route_fee_clears_reentrancy_lock_after_success" to "test_snapshots/test/test_compute_route_fee_clears_reentrancy_lock_after_success.1.json".

failures:
    test::prop_capped_fee_matches_pure_math
    test::test_compute_route_fee_basic
    test::test_compute_route_fee_clears_reentrancy_lock_after_success
    test::test_compute_route_fee_rejects_reentry_from_mock_callback
    test::test_compute_route_fee_releases_lock_for_consecutive_calls
    test::test_compute_route_fee_resumes_after_unpause
    test::test_pair_limits_liquidity_and_info_round_trip
    test::test_purge_pair_metrics_does_not_touch_registration_or_config
    test::test_quote_route_allowed_while_paused
    test::test_quote_route_and_compute_route_update_counters
    test::test_quote_route_does_not_mutate_counter_or_emit_route_event
    test::test_reregister_after_unregister_preserves_fee_and_clears_other_config

test result: FAILED. 208 passed; 26 failed; 0 ignored; 0 measured; 0 filtered out; finished in 22.08s

*** result: Timeout
