*** src/lib.rs:442:9: replace StableRouteRouter::read_pair_max -> i128 with 0

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::read_pair_max -> i128 with 0
@@ -434,20 +434,17 @@
     }
 
     /// Read the per-pair maximum routable amount from persistent storage.
     ///
     /// Returns `i128::MAX` (no ceiling — unbounded) when the slot is
     /// absent. This is the single source of truth for the
     /// [`DataKey::PairMaxAmount`] sentinel value.
     fn read_pair_max(env: &Env, source: &Symbol, destination: &Symbol) -> i128 {
-        env.storage()
-            .persistent()
-            .get(&DataKey::PairMaxAmount(source.clone(), destination.clone()))
-            .unwrap_or(i128::MAX)
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Read the per-pair reported liquidity from persistent storage.
     ///
     /// Returns `0` (no liquidity configured) when the slot is absent —
     /// the documented default for getters and aggregate reads. Note that
     /// [`Self::compute_route_fee`] intentionally uses `i128::MAX` as its
     /// own unbounded sentinel (a context-dependent default, documented

---- test::prop_fee_never_exceeds_amount stdout ----

thread 'test::prop_fee_never_exceeds_amount' (49251) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #11)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #11)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #11)], data:["contract call failed", compute_route_fee, [USDC, EURC, 49941935024048608493353547641024389776]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #11)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #11)], data:"escala

---- test::prop_capped_fee_matches_pure_math stdout ----

thread 'test::prop_capped_fee_matches_pure_math' (49250) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #11)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #11)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #11)], data:["contract call failed", compute_route_fee, [USDC, EURC, 293532312449514413516803]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #11)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #11)], data:"escalating e

---- test::prop_fee_within_amount stdout ----

thread 'test::prop_fee_within_amount' (49713) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #11)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #11)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #11)], data:["contract call failed", compute_route_fee, [USDC, EURC, 293532312449514413516803]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #11)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #11)], data:"escalating error to panic"
   4: [

failures:
    test::prop_capped_fee_matches_pure_math
    test::prop_fee_never_exceeds_amount
    test::prop_fee_within_amount
    test::prop_overflow_fallback_is_zero
    test::prop_quote_matches_compute
    test::prop_zero_bps_yields_zero_fee
    test::prop_zero_fee_bps_is_free
    test::test_compute_route_fee_basic
    test::test_compute_route_fee_clears_reentrancy_lock_after_success
    test::test_compute_route_fee_counter_is_global_across_pairs
    test::test_compute_route_fee_emits_route_event_with_payload
    test::test_compute_route_fee_is_zero_when_fee_unset

test result: FAILED. 176 passed; 58 failed; 0 ignored; 0 measured; 0 filtered out; finished in 19.41s

*** result: Failure(101)
