*** src/lib.rs:458:9: replace StableRouteRouter::read_pair_liquidity -> i128 with 0

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::read_pair_liquidity -> i128 with 0
@@ -450,20 +450,17 @@
     /// Returns `0` (no liquidity configured) when the slot is absent —
     /// the documented default for getters and aggregate reads. Note that
     /// [`Self::compute_route_fee`] intentionally uses `i128::MAX` as its
     /// own unbounded sentinel (a context-dependent default, documented
     /// in the [`DataKey::PairLiquidity`] variant and `storage.md`).
     /// Callers needing the unbounded semantic should read the slot
     /// directly with `unwrap_or(i128::MAX)`.
     fn read_pair_liquidity(env: &Env, source: &Symbol, destination: &Symbol) -> i128 {
-        env.storage()
-            .persistent()
-            .get(&DataKey::PairLiquidity(source.clone(), destination.clone()))
-            .unwrap_or(0)
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Read the per-pair route cooldown from persistent storage.
     ///
     /// Returns `0` (rate limit disabled) when the slot is absent — the
     /// documented default for an unconfigured pair. This is the single
     /// source of truth for the [`DataKey::PairCooldown`] sentinel value.
     fn read_pair_cooldown(env: &Env, source: &Symbol, destination: &Symbol) -> u64 {

---- test::test_admin_can_still_update_liquidity stdout ----

thread 'test::test_admin_can_still_update_liquidity' (53892) panicked at src/lib.rs:2720:9:
assertion `left == right` failed
  left: 0
 right: 10
Writing test snapshot file for test "test::test_admin_can_still_update_liquidity" to "test_snapshots/test/test_admin_can_still_update_liquidity.1.json".

---- test::test_admin_can_still_update_liquidity_after_removal stdout ----

thread 'test::test_admin_can_still_update_liquidity_after_removal' (53893) panicked at src/lib.rs:2847:9:
assertion `left == right` failed
  left: 0
 right: 42
Writing test snapshot file for test "test::test_admin_can_still_update_liquidity_after_removal" to "test_snapshots/test/test_admin_can_still_update_liquidity_after_removal.1.json".

---- test::test_oracle_can_be_reconfigured_after_removal stdout ----

thread 'test::test_oracle_can_be_reconfigured_after_removal' (53953) panicked at src/lib.rs:2920:9:
assertion `left == right` failed
  left: 0
 right: 7
Writing test snapshot file for test "test::test_oracle_can_be_reconfigured_after_removal" to "test_snapshots/test/test_oracle_can_be_reconfigured_after_removal.1.json".

failures:
    test::test_admin_can_still_update_liquidity
    test::test_admin_can_still_update_liquidity_after_removal
    test::test_oracle_can_be_reconfigured_after_removal
    test::test_oracle_can_update_before_removal_but_not_after
    test::test_oracle_can_update_liquidity
    test::test_pair_limits_liquidity_and_info_round_trip
    test_i15_bounds_liquidity::test_liquidity_at_bound_is_accepted
    test_i18_read_surface::test_i128_max_sentinel_means_unbounded
    test_i18_read_surface::test_is_pair_active_requires_registration_and_liquidity
    test_i18_read_surface::test_pair_info_ext_after_routing
    test_i18_read_surface::test_pair_info_ext_reflects_configuration
    test_i18_read_surface::test_pair_info_reflects_configuration

test result: FAILED. 218 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.23s

*** result: Failure(101)
