*** src/lib.rs:470:9: replace StableRouteRouter::read_pair_cooldown -> u64 with 0

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::read_pair_cooldown -> u64 with 0
@@ -462,20 +462,17 @@
     }
 
     /// Read the per-pair route cooldown from persistent storage.
     ///
     /// Returns `0` (rate limit disabled) when the slot is absent — the
     /// documented default for an unconfigured pair. This is the single
     /// source of truth for the [`DataKey::PairCooldown`] sentinel value.
     fn read_pair_cooldown(env: &Env, source: &Symbol, destination: &Symbol) -> u64 {
-        env.storage()
-            .persistent()
-            .get(&DataKey::PairCooldown(source.clone(), destination.clone()))
-            .unwrap_or(0)
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the router contract version.
     pub fn version(_env: Env) -> Symbol {
         symbol_short!("ROUTER_V2")
     }
 
     /// Read the persisted schema version, or 1 if absent (the implicit

---- test_i18_read_surface::test_pair_info_ext_reflects_configuration stdout ----

thread 'test_i18_read_surface::test_pair_info_ext_reflects_configuration' (55011) panicked at src/lib.rs:3821:9:
assertion `left == right` failed
  left: 0
 right: 120
Writing test snapshot file for test "test_i18_read_surface::test_pair_info_ext_reflects_configuration" to "test_snapshots/test_i18_read_surface/test_pair_info_ext_reflects_configuration.1.json".

---- test_i230_paused_sweep::test_set_pair_cooldown_succeeds_while_paused stdout ----

thread 'test_i230_paused_sweep::test_set_pair_cooldown_succeeds_while_paused' (55172) panicked at src/lib.rs:5210:9:
assertion `left == right` failed
  left: 0
 right: 60
Writing test snapshot file for test "test_i230_paused_sweep::test_set_pair_cooldown_succeeds_while_paused" to "test_snapshots/test_i230_paused_sweep/test_set_pair_cooldown_succeeds_while_paused.1.json".

failures:
    test_i18_read_surface::test_pair_info_ext_reflects_configuration
    test_i230_paused_sweep::test_set_pair_cooldown_succeeds_while_paused

test result: FAILED. 232 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 22.95s

*** result: Failure(101)
