*** src/lib.rs:484:9: replace StableRouteRouter::get_schema_version -> u32 with 0

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::get_schema_version -> u32 with 0
@@ -476,20 +476,17 @@
     /// Returns the router contract version.
     pub fn version(_env: Env) -> Symbol {
         symbol_short!("ROUTER_V2")
     }
 
     /// Read the persisted schema version, or 1 if absent (the implicit
     /// pre-migration default).
     pub fn get_schema_version(env: Env) -> u32 {
-        env.storage()
-            .persistent()
-            .get(&DataKey::SchemaVersion)
-            .unwrap_or(1)
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Expose the protocol-wide limits that every caller must respect before
     /// submitting a transaction.
     ///
     /// Returns a [`RouterLimits`] snapshot mirroring the compile-time
     /// constants [`MAX_FEE_BPS`], [`BPS_DENOMINATOR`], [`MAX_BATCH_SIZE`], and
     /// [`MAX_COOLDOWN_SECS`]. This is the on-chain discovery surface: an

---- test::test_schema_version_migration stdout ----

thread 'test::test_schema_version_migration' (57181) panicked at src/lib.rs:2034:9:
assertion `left == right` failed
  left: 0
 right: 1
Writing test snapshot file for test "test::test_schema_version_migration" to "test_snapshots/test/test_schema_version_migration.1.json".

---- test::test_version_is_independent_of_schema_version stdout ----

thread 'test::test_version_is_independent_of_schema_version' (57199) panicked at src/lib.rs:3211:9:
assertion `left == right` failed
  left: 0
 right: 1
Writing test snapshot file for test "test::test_version_is_independent_of_schema_version" to "test_snapshots/test/test_version_is_independent_of_schema_version.1.json".

---- test_i153_version_uninitialized::test_read_only_operations_work_on_uninitialized_contract stdout ----

thread 'test_i153_version_uninitialized::test_read_only_operations_work_on_uninitialized_contract' (57261) panicked at src/lib.rs:4809:9:
assertion `left == right` failed
  left: 0
 right: 1
Writing test snapshot file for test "test_i153_version_uninitialized::test_read_only_operations_work_on_uninitialized_contract" to "test_snapshots/test_i153_version_uninitialized/test_read_only_operations_work_on_uninitialized_contract.1.json".

failures:
    test::test_schema_version_migration
    test::test_version_is_independent_of_schema_version
    test_i153_version_uninitialized::test_read_only_operations_work_on_uninitialized_contract
    test_i153_version_uninitialized::test_schema_version_defaults_to_one_when_uninitialized
    test_i153_version_uninitialized::test_version_and_schema_version_are_separate_concepts
    test_i153_version_uninitialized::test_version_constant_independent_of_schema_migration
    test_i17_migration::test_migrate_advances_to_two
    test_i17_migration::test_schema_version_defaults_to_one
    test_i230_paused_sweep::test_migrate_v1_to_v2_succeeds_while_paused

test result: FAILED. 225 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 24.38s

*** result: Failure(101)
