*** src/lib.rs:521:20: replace != with == in StableRouteRouter::migrate_v1_to_v2

*** mutation diff:
--- src/lib.rs
+++ replace != with == in StableRouteRouter::migrate_v1_to_v2
@@ -513,17 +513,17 @@
     /// only stamps the new SchemaVersion.
     pub fn migrate_v1_to_v2(env: Env) {
         Self::require_admin(&env);
         let current: u32 = env
             .storage()
             .persistent()
             .get(&DataKey::SchemaVersion)
             .unwrap_or(1);
-        if current != 1 {
+        if current == /* ~ changed by cargo-mutants ~ */ 1 {
             panic_with_error!(&env, RouterError::MigrationVersionMismatch);
         }
         env.storage()
             .persistent()
             .set(&DataKey::SchemaVersion, &2u32);
     }
 
     /// Deploy-time constructor — sets the operational admin **atomically**

---- test::test_schema_version_migration stdout ----

thread 'test::test_schema_version_migration' (60176) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #13)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #13)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #13)], data:["contract call failed", migrate_v1_to_v2, []]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #13)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #13)], data:"escalating error to panic"
   4: [Failed Diagnostic Event

---- test::test_version_is_independent_of_schema_version stdout ----

thread 'test::test_version_is_independent_of_schema_version' (60194) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #13)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #13)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #13)], data:["contract call failed", migrate_v1_to_v2, []]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #13)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #13)], data:"escalating error to panic

---- test_i153_version_uninitialized::test_version_constant_independent_of_schema_migration stdout ----

thread 'test_i153_version_uninitialized::test_version_constant_independent_of_schema_migration' (60259) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #13)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #13)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #13)], data:["contract call failed", migrate_v1_to_v2, []]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #13)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4,

failures:
    test::test_schema_version_migration
    test::test_version_is_independent_of_schema_version
    test_i153_version_uninitialized::test_version_constant_independent_of_schema_migration
    test_i17_migration::test_migrate_advances_to_two
    test_i230_paused_sweep::test_migrate_v1_to_v2_succeeds_while_paused

test result: FAILED. 229 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.51s

*** result: Failure(101)
