*** src/lib.rs:574:9: replace StableRouteRouter::pause with ()

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::pause with ()
@@ -566,20 +566,17 @@
         env.storage().instance().set(&DataKey::Paused, &false);
         Self::bump_instance_ttl(&env);
         env.events().publish((symbol_short!("paused"),), false);
     }
 
     /// Admin pauses the router. All state-changing entrypoints will
     /// then panic with ContractPaused.
     pub fn pause(env: Env) {
-        Self::require_admin(&env);
-        env.storage().instance().set(&DataKey::Paused, &true);
-        Self::bump_instance_ttl(&env);
-        env.events().publish((symbol_short!("paused"),), true);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Read the configured governance timelock delay, in seconds
     /// (0 when unset — handover is instant).
     pub fn get_timelock(env: Env) -> u64 {
         env.storage()
             .persistent()
             .get(&DataKey::Timelock)

---- test::test_compute_route_fee_rejects_when_paused stdout ----
Writing test snapshot file for test "test::test_compute_route_fee_rejects_when_paused" to "test_snapshots/test/test_compute_route_fee_rejects_when_paused.1.json".
note: test did not panic as expected at src/lib.rs:2073:8

---- test::test_oracle_cannot_call_admin_entrypoint stdout ----
Writing test snapshot file for test "test::test_oracle_cannot_call_admin_entrypoint" to "test_snapshots/test/test_oracle_cannot_call_admin_entrypoint.1.json".
note: test did not panic as expected at src/lib.rs:2746:8

---- test::test_pause_and_unpause_round_trip stdout ----

thread 'test::test_pause_and_unpause_round_trip' (63451) panicked at src/lib.rs:2054:9:
assertion failed: client.is_paused()
Writing test snapshot file for test "test::test_pause_and_unpause_round_trip" to "test_snapshots/test/test_pause_and_unpause_round_trip.1.json".

failures:
    test::test_compute_route_fee_rejects_when_paused
    test::test_oracle_cannot_call_admin_entrypoint
    test::test_pause_and_unpause_round_trip
    test::test_register_pair_rejects_when_paused
    test::test_require_admin_rejects_unauthorized_caller
    test_batch::test_register_pairs_rejects_when_paused
    test_batch::test_set_pair_fees_bps_rejects_when_paused
    test_i14_pause_gating::test_double_pause_and_double_unpause_idempotent
    test_i14_pause_gating::test_is_paused_defaults_false_and_toggles
    test_i14_pause_gating::test_pause_emits_event
    test_i14_pause_gating::test_register_pair_rejected_while_paused
    test_i14_pause_gating::test_set_pair_fee_bps_rejected_while_paused

test result: FAILED. 211 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.09s

*** result: Failure(101)
