*** src/lib.rs:583:9: replace StableRouteRouter::get_timelock -> u64 with 1

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::get_timelock -> u64 with 1
@@ -575,20 +575,17 @@
         env.storage().instance().set(&DataKey::Paused, &true);
         Self::bump_instance_ttl(&env);
         env.events().publish((symbol_short!("paused"),), true);
     }
 
     /// Read the configured governance timelock delay, in seconds
     /// (0 when unset — handover is instant).
     pub fn get_timelock(env: Env) -> u64 {
-        env.storage()
-            .persistent()
-            .get(&DataKey::Timelock)
-            .unwrap_or(0)
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Admin sets the governance timelock delay (seconds). Applies to the
     /// **next** `propose_admin_transfer`; already-queued actions keep the
     /// eta they were stamped with. Pass 0 to disable (instant handover).
     pub fn set_timelock(env: Env, delay_seconds: u64) {
         Self::require_admin(&env);
         env.storage()

---- test::test_timelock_defaults_to_zero stdout ----

thread 'test::test_timelock_defaults_to_zero' (65133) panicked at src/lib.rs:2150:9:
assertion `left == right` failed
  left: 1
 right: 0
Writing test snapshot file for test "test::test_timelock_defaults_to_zero" to "test_snapshots/test/test_timelock_defaults_to_zero.1.json".

---- test_i153_version_uninitialized::test_read_only_operations_work_on_uninitialized_contract stdout ----

thread 'test_i153_version_uninitialized::test_read_only_operations_work_on_uninitialized_contract' (65201) panicked at src/lib.rs:4813:9:
assertion `left == right` failed
  left: 1
 right: 0
Writing test snapshot file for test "test_i153_version_uninitialized::test_read_only_operations_work_on_uninitialized_contract" to "test_snapshots/test_i153_version_uninitialized/test_read_only_operations_work_on_uninitialized_contract.1.json".

---- test_i230_paused_sweep::test_set_timelock_succeeds_while_paused stdout ----

thread 'test_i230_paused_sweep::test_set_timelock_succeeds_while_paused' (65369) panicked at src/lib.rs:5039:9:
assertion `left == right` failed
  left: 1
 right: 300
Writing test snapshot file for test "test_i230_paused_sweep::test_set_timelock_succeeds_while_paused" to "test_snapshots/test_i230_paused_sweep/test_set_timelock_succeeds_while_paused.1.json".

failures:
    test::test_timelock_defaults_to_zero
    test_i153_version_uninitialized::test_read_only_operations_work_on_uninitialized_contract
    test_i230_paused_sweep::test_set_timelock_succeeds_while_paused

test result: FAILED. 231 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 27.11s

*** result: Failure(101)
