*** src/lib.rs:729:9: replace StableRouteRouter::register_pair with ()

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::register_pair with ()
@@ -721,26 +721,17 @@
     ///
     /// **Registration-first invariant:** `set_pair_fee_bps`,
     /// `set_pair_min_amount`, `set_pair_max_amount`, and
     /// `set_pair_liquidity` all require the pair to already be registered
     /// here, and panic with [`RouterError::PairNotRegistered`] (#5)
     /// otherwise. Always call `register_pair` before configuring a
     /// corridor's fee, bounds, or liquidity.
     pub fn register_pair(env: Env, source: Symbol, destination: Symbol) {
-        Self::require_not_paused(&env);
-        Self::require_admin(&env);
-        if source == destination {
-            panic_with_error!(&env, RouterError::SourceEqualsDestination);
-        }
-        env.storage()
-            .persistent()
-            .set(&DataKey::Pair(source.clone(), destination.clone()), &true);
-        env.events()
-            .publish((symbol_short!("pair_reg"),), (source, destination));
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Register multiple `(source, destination)` pairs in a single
     /// admin-gated call. Each entry is validated identically to
     /// [`Self::register_pair`] and gets its own `pair_reg` event.
     ///
     /// **All-or-nothing:** if any entry fails validation the entire
     /// transaction is rolled back (Soroban transactions are atomic), so

---- test::prop_fee_never_exceeds_amount stdout ----

thread 'test::prop_fee_never_exceeds_amount' (78525) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #5)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #5)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #5)], data:["contract call failed", set_pair_fee_bps, [USDC, EURC, 834]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #5)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #5)], data:"escalating error to panic"
   4: [Failed Diagno

---- test::prop_capped_fee_matches_pure_math stdout ----

thread 'test::prop_capped_fee_matches_pure_math' (78524) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #5)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #5)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #5)], data:["contract call failed", set_pair_fee_bps, [USDC, EURC, 325]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #5)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #5)], data:"escalating error to panic"
   4: [Faile

---- test::prop_overflow_fallback_is_zero stdout ----

thread 'test::prop_overflow_fallback_is_zero' (78821) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #5)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #5)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #5)], data:["contract call failed", set_pair_fee_bps, [USDC, EURC, 326]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #5)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #5)], data:"escalating error to panic"
   4: [Failed Diag

failures:
    test::prop_capped_fee_matches_pure_math
    test::prop_fee_never_exceeds_amount
    test::prop_fee_within_amount
    test::prop_overflow_fallback_is_zero
    test::prop_quote_matches_compute
    test::prop_zero_bps_yields_zero_fee
    test::prop_zero_fee_bps_is_free
    test::test_admin_can_still_update_liquidity
    test::test_admin_can_still_update_liquidity_after_removal
    test::test_compute_route_fee_basic
    test::test_compute_route_fee_clears_reentrancy_lock_after_success
    test::test_compute_route_fee_counter_is_global_across_pairs

test result: FAILED. 120 passed; 114 failed; 0 ignored; 0 measured; 0 filtered out; finished in 12.27s

*** result: Failure(101)
