*** src/lib.rs:731:19: replace == with != in StableRouteRouter::register_pair

*** mutation diff:
--- src/lib.rs
+++ replace == with != in StableRouteRouter::register_pair
@@ -723,17 +723,17 @@
     /// `set_pair_min_amount`, `set_pair_max_amount`, and
     /// `set_pair_liquidity` all require the pair to already be registered
     /// here, and panic with [`RouterError::PairNotRegistered`] (#5)
     /// otherwise. Always call `register_pair` before configuring a
     /// corridor's fee, bounds, or liquidity.
     pub fn register_pair(env: Env, source: Symbol, destination: Symbol) {
         Self::require_not_paused(&env);
         Self::require_admin(&env);
-        if source == destination {
+        if source != /* ~ changed by cargo-mutants ~ */ destination {
             panic_with_error!(&env, RouterError::SourceEqualsDestination);
         }
         env.storage()
             .persistent()
             .set(&DataKey::Pair(source.clone(), destination.clone()), &true);
         env.events()
             .publish((symbol_short!("pair_reg"),), (source, destination));
     }

---- test::prop_capped_fee_matches_pure_math stdout ----

thread 'test::prop_capped_fee_matches_pure_math' (78145) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #3)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #3)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #3)], data:["contract call failed", register_pair, [USDC, EURC]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #3)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #3)], data:"escalating error to panic"
   4: [Failed Diagno

---- test::prop_fee_never_exceeds_amount stdout ----

thread 'test::prop_fee_never_exceeds_amount' (78147) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #3)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #3)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #3)], data:["contract call failed", register_pair, [USDC, EURC]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #3)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #3)], data:"escalating error to panic"
   4: [Failed Diagnostic Eve

---- test::prop_overflow_fallback_is_zero stdout ----

thread 'test::prop_overflow_fallback_is_zero' (78303) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #3)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #3)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #3)], data:["contract call failed", register_pair, [USDC, EURC]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #3)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #3)], data:"escalating error to panic"
   4: [Failed Diagnostic E

failures:
    test::prop_capped_fee_matches_pure_math
    test::prop_fee_never_exceeds_amount
    test::prop_fee_within_amount
    test::prop_overflow_fallback_is_zero
    test::prop_quote_matches_compute
    test::prop_zero_bps_yields_zero_fee
    test::prop_zero_fee_bps_is_free
    test::test_admin_can_still_update_liquidity
    test::test_admin_can_still_update_liquidity_after_removal
    test::test_compute_route_fee_basic
    test::test_compute_route_fee_clears_reentrancy_lock_after_success
    test::test_compute_route_fee_counter_is_global_across_pairs

test result: FAILED. 117 passed; 117 failed; 0 ignored; 0 measured; 0 filtered out; finished in 10.01s

*** result: Failure(101)
