*** src/lib.rs:753:9: replace StableRouteRouter::register_pairs with ()

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::register_pairs with ()
@@ -745,34 +745,17 @@
     /// **All-or-nothing:** if any entry fails validation the entire
     /// transaction is rolled back (Soroban transactions are atomic), so
     /// callers must ensure every pair is valid before invoking this. The
     /// batch must contain at least one entry; an empty batch panics with
     /// [`RouterError::EmptyBatch`]. The batch is also capped at
     /// [`MAX_BATCH_SIZE`] entries to bound gas; exceeding it panics with
     /// [`RouterError::BatchTooLarge`].
     pub fn register_pairs(env: Env, pairs: Vec<(Symbol, Symbol)>) {
-        Self::require_not_paused(&env);
-        Self::require_admin(&env);
-        if pairs.is_empty() {
-            panic_with_error!(&env, RouterError::EmptyBatch);
-        }
-        if pairs.len() > MAX_BATCH_SIZE {
-            panic_with_error!(&env, RouterError::BatchTooLarge);
-        }
-        for (source, destination) in pairs.iter() {
-            if source == destination {
-                panic_with_error!(&env, RouterError::SourceEqualsDestination);
-            }
-            env.storage()
-                .persistent()
-                .set(&DataKey::Pair(source.clone(), destination.clone()), &true);
-            env.events()
-                .publish((symbol_short!("pair_reg"),), (source, destination));
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns true iff the pair is registered AND has non-zero
     /// reported liquidity. Useful as a quick is-routable check.
     pub fn is_pair_active(env: Env, source: Symbol, destination: Symbol) -> bool {
         let s = env.storage().persistent();
         if !s
             .get::<_, bool>(&DataKey::Pair(source.clone(), destination.clone()))

---- test_batch::test_register_pairs_atomic_rollback_on_identity stdout ----
Writing test snapshot file for test "test_batch::test_register_pairs_atomic_rollback_on_identity" to "test_snapshots/test_batch/test_register_pairs_atomic_rollback_on_identity.1.json".
note: test did not panic as expected at src/lib.rs:4351:8

---- test_batch::test_register_pairs_happy_path stdout ----

thread 'test_batch::test_register_pairs_happy_path' (80726) panicked at src/lib.rs:4328:9:
assertion failed: client.is_pair_registered(&symbol_short!("USDC"), &symbol_short!("EURC"))
Writing test snapshot file for test "test_batch::test_register_pairs_happy_path" to "test_snapshots/test_batch/test_register_pairs_happy_path.1.json".

---- test_batch::test_register_pairs_panics_when_uninitialized stdout ----
Writing test snapshot file for test "test_batch::test_register_pairs_panics_when_uninitialized" to "test_snapshots/test_batch/test_register_pairs_panics_when_uninitialized.1.json".
note: test did not panic as expected at src/lib.rs:4388:8

failures:
    test_batch::test_register_pairs_atomic_rollback_on_identity
    test_batch::test_register_pairs_happy_path
    test_batch::test_register_pairs_panics_when_uninitialized
    test_batch::test_register_pairs_rejects_empty_batch
    test_batch::test_register_pairs_rejects_too_large_batch
    test_batch::test_register_pairs_rejects_when_paused
    test_batch::test_register_pairs_single_entry_succeeds
    test_batch::test_set_pair_fees_bps_atomic_rollback_on_high_fee
    test_batch::test_set_pair_fees_bps_happy_path
    test_batch::test_set_pair_fees_bps_single_entry_succeeds
    test_i153_version_uninitialized::test_register_pairs_panics_on_uninitialized_contract
    test_i19_authorization::test_register_pairs_requires_admin

test result: FAILED. 220 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 26.16s

*** result: Failure(101)
