*** src/lib.rs:762:23: replace == with != in StableRouteRouter::register_pairs

*** mutation diff:
--- src/lib.rs
+++ replace == with != in StableRouteRouter::register_pairs
@@ -754,17 +754,17 @@
         Self::require_admin(&env);
         if pairs.is_empty() {
             panic_with_error!(&env, RouterError::EmptyBatch);
         }
         if pairs.len() > MAX_BATCH_SIZE {
             panic_with_error!(&env, RouterError::BatchTooLarge);
         }
         for (source, destination) in pairs.iter() {
-            if source == destination {
+            if source != /* ~ changed by cargo-mutants ~ */ destination {
                 panic_with_error!(&env, RouterError::SourceEqualsDestination);
             }
             env.storage()
                 .persistent()
                 .set(&DataKey::Pair(source.clone(), destination.clone()), &true);
             env.events()
                 .publish((symbol_short!("pair_reg"),), (source, destination));
         }

---- test_batch::test_register_pairs_happy_path stdout ----

thread 'test_batch::test_register_pairs_happy_path' (83410) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #3)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #3)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #3)], data:["contract call failed", register_pairs, [[[USDC, EURC], [XLM, USDC], [ETH, BTC]]]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #3)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #3)], data:"escalating

---- test_batch::test_register_pairs_single_entry_succeeds stdout ----

thread 'test_batch::test_register_pairs_single_entry_succeeds' (83423) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #3)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #3)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #3)], data:["contract call failed", register_pairs, [[[USDC, EURC]]]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #3)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #3)], data:"escalating err

---- test_batch::test_set_pair_fees_bps_atomic_rollback_on_high_fee stdout ----

thread 'test_batch::test_set_pair_fees_bps_atomic_rollback_on_high_fee' (83428) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #3)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #3)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #3)], data:["contract call failed", register_pairs, [[[USDC, EURC], [XLM, USDC]]]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #3)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contr

failures:
    test_batch::test_register_pairs_happy_path
    test_batch::test_register_pairs_single_entry_succeeds
    test_batch::test_set_pair_fees_bps_atomic_rollback_on_high_fee
    test_batch::test_set_pair_fees_bps_happy_path
    test_batch::test_set_pair_fees_bps_rejects_when_paused
    test_batch::test_set_pair_fees_bps_single_entry_succeeds
    test_i230_paused_sweep::test_all_gated_entrypoints_resume_after_unpause

test result: FAILED. 227 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.26s

*** result: Failure(101)
