*** src/lib.rs:872:9: replace StableRouteRouter::get_pair_last_route_at -> Option<u64> with Some(0)

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::get_pair_last_route_at -> Option<u64> with Some(0)
@@ -864,19 +864,17 @@
         let fee = Self::apply_fee_cap(&env, fee);
         let fee = Self::apply_fee_floor(&env, fee);
         (fee, amount - fee)
     }
 
     /// Read the most recent ledger timestamp at which `compute_route_fee`
     /// touched this pair. None when never routed.
     pub fn get_pair_last_route_at(env: Env, source: Symbol, destination: Symbol) -> Option<u64> {
-        env.storage()
-            .persistent()
-            .get(&DataKey::PairLastRouteAt(source, destination))
+        Some(0) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Admin sets the per-pair route cooldown in seconds.
     ///
     /// While set to a non-zero value, `compute_route_fee` rejects a call
     /// for the pair until at least `cooldown_secs` seconds have elapsed
     /// since the pair's last successful route (`PairLastRouteAt`).
     /// Setting `0` (the default) disables the rate limit for the pair.

---- test::test_compute_route_fee_stamps_pair_last_route_at stdout ----

thread 'test::test_compute_route_fee_stamps_pair_last_route_at' (98437) panicked at src/lib.rs:3062:9:
assertion `left == right` failed
  left: Some(0)
 right: None
Writing test snapshot file for test "test::test_compute_route_fee_stamps_pair_last_route_at" to "test_snapshots/test/test_compute_route_fee_stamps_pair_last_route_at.1.json".

---- test::test_purge_pair_metrics_resets_counters_and_emits_event stdout ----

thread 'test::test_purge_pair_metrics_resets_counters_and_emits_event' (98491) panicked at src/lib.rs:2484:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(999)
Writing test snapshot file for test "test::test_purge_pair_metrics_resets_counters_and_emits_event" to "test_snapshots/test/test_purge_pair_metrics_resets_counters_and_emits_event.1.json".

---- test::test_unregister_then_reregister_preserves_metrics_by_default stdout ----

thread 'test::test_unregister_then_reregister_preserves_metrics_by_default' (98586) panicked at src/lib.rs:2447:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(777)
Writing test snapshot file for test "test::test_unregister_then_reregister_preserves_metrics_by_default" to "test_snapshots/test/test_unregister_then_reregister_preserves_metrics_by_default.1.json".

failures:
    test::test_compute_route_fee_stamps_pair_last_route_at
    test::test_purge_pair_metrics_resets_counters_and_emits_event
    test::test_unregister_then_reregister_preserves_metrics_by_default
    test_i18_read_surface::test_last_route_at_none_before_some_after
    test_i18_read_surface::test_quote_route_is_non_mutating_and_matches_compute
    test_i230_paused_sweep::test_no_route_side_effects_while_paused

test result: FAILED. 228 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.63s

*** result: Failure(101)
