*** src/lib.rs:887:9: replace StableRouteRouter::set_pair_cooldown with ()

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::set_pair_cooldown with ()
@@ -879,29 +879,17 @@
     /// While set to a non-zero value, `compute_route_fee` rejects a call
     /// for the pair until at least `cooldown_secs` seconds have elapsed
     /// since the pair's last successful route (`PairLastRouteAt`).
     /// Setting `0` (the default) disables the rate limit for the pair.
     /// Rejects values above [`MAX_COOLDOWN_SECS`] with
     /// [`RouterError::CooldownTooLarge`] so an absurdly large value
     /// (e.g. `u64::MAX`) cannot permanently brick the corridor.
     pub fn set_pair_cooldown(env: Env, source: Symbol, destination: Symbol, cooldown_secs: u64) {
-        Self::require_admin(&env);
-        if cooldown_secs > MAX_COOLDOWN_SECS {
-            panic_with_error!(&env, RouterError::CooldownTooLarge);
-        }
-        Self::require_pair_registered(&env, &source, &destination);
-        env.storage().persistent().set(
-            &DataKey::PairCooldown(source.clone(), destination.clone()),
-            &cooldown_secs,
-        );
-        env.events().publish(
-            (symbol_short!("cd_set"),),
-            (source, destination, cooldown_secs),
-        );
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Read the per-pair route cooldown in seconds (0 when absent,
     /// meaning the rate limit is disabled for the pair).
     pub fn get_pair_cooldown(env: Env, source: Symbol, destination: Symbol) -> u64 {
         Self::read_pair_cooldown(&env, &source, &destination)
     }

---- test_i153_version_uninitialized::test_set_pair_cooldown_panics_on_uninitialized_contract stdout ----
Writing test snapshot file for test "test_i153_version_uninitialized::test_set_pair_cooldown_panics_on_uninitialized_contract" to "test_snapshots/test_i153_version_uninitialized/test_set_pair_cooldown_panics_on_uninitialized_contract.1.json".
note: test did not panic as expected at src/lib.rs:4745:8

---- test_i18_read_surface::test_pair_info_ext_reflects_configuration stdout ----

thread 'test_i18_read_surface::test_pair_info_ext_reflects_configuration' (101065) panicked at src/lib.rs:3812:9:
assertion `left == right` failed
  left: 0
 right: 120
Writing test snapshot file for test "test_i18_read_surface::test_pair_info_ext_reflects_configuration" to "test_snapshots/test_i18_read_surface/test_pair_info_ext_reflects_configuration.1.json".

---- test_i19_authorization::test_set_pair_cooldown_requires_admin stdout ----
Writing test snapshot file for test "test_i19_authorization::test_set_pair_cooldown_requires_admin" to "test_snapshots/test_i19_authorization/test_set_pair_cooldown_requires_admin.1.json".
note: test did not panic as expected at src/lib.rs:4057:8

failures:
    test_i153_version_uninitialized::test_set_pair_cooldown_panics_on_uninitialized_contract
    test_i18_read_surface::test_pair_info_ext_reflects_configuration
    test_i19_authorization::test_set_pair_cooldown_requires_admin
    test_i230_paused_sweep::test_set_pair_cooldown_succeeds_while_paused

test result: FAILED. 230 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 26.26s

*** result: Failure(101)
