*** src/lib.rs:939:9: replace StableRouteRouter::set_fee_recipient with ()

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::set_fee_recipient with ()
@@ -931,20 +931,17 @@
             .persistent()
             .get(&DataKey::PairVolume(source, destination))
             .unwrap_or(0)
     }
 
     /// Admin sets the address that receives protocol fees at
     /// settlement time. The router itself never custodies funds.
     pub fn set_fee_recipient(env: Env, recipient: Address) {
-        Self::require_admin(&env);
-        env.storage()
-            .persistent()
-            .set(&DataKey::FeeRecipient, &recipient);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Read the configured fee recipient, if any.
     pub fn get_fee_recipient(env: Env) -> Option<Address> {
         env.storage().persistent().get(&DataKey::FeeRecipient)
     }
 
     /// Clamp `fee` to the configured absolute ceiling when one is set.

---- test::test_fee_recipient_round_trip stdout ----

thread 'test::test_fee_recipient_round_trip' (109737) panicked at src/lib.rs:2298:9:
assertion `left == right` failed
  left: None
 right: Some(Contract(CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHK3M))
Writing test snapshot file for test "test::test_fee_recipient_round_trip" to "test_snapshots/test/test_fee_recipient_round_trip.1.json".

---- test_i153_version_uninitialized::test_set_fee_recipient_panics_on_uninitialized_contract stdout ----
Writing test snapshot file for test "test_i153_version_uninitialized::test_set_fee_recipient_panics_on_uninitialized_contract" to "test_snapshots/test_i153_version_uninitialized/test_set_fee_recipient_panics_on_uninitialized_contract.1.json".
note: test did not panic as expected at src/lib.rs:4735:8

---- test_i19_authorization::test_set_fee_recipient_requires_admin stdout ----
Writing test snapshot file for test "test_i19_authorization::test_set_fee_recipient_requires_admin" to "test_snapshots/test_i19_authorization/test_set_fee_recipient_requires_admin.1.json".
note: test did not panic as expected at src/lib.rs:4010:8

failures:
    test::test_fee_recipient_round_trip
    test_i153_version_uninitialized::test_set_fee_recipient_panics_on_uninitialized_contract
    test_i19_authorization::test_set_fee_recipient_requires_admin
    test_i230_paused_sweep::test_set_fee_recipient_succeeds_while_paused

test result: FAILED. 230 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 24.47s

*** result: Failure(101)
