*** src/lib.rs:954:9: replace StableRouteRouter::apply_fee_cap -> i128 with 1

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::apply_fee_cap -> i128 with 1
@@ -946,24 +946,17 @@
     pub fn get_fee_recipient(env: Env) -> Option<Address> {
         env.storage().persistent().get(&DataKey::FeeRecipient)
     }
 
     /// Clamp `fee` to the configured absolute ceiling when one is set.
     /// Both the relative `MAX_FEE_BPS` bound and this absolute bound apply;
     /// the tighter of the two wins. No-op when no absolute cap is configured.
     fn apply_fee_cap(env: &Env, fee: i128) -> i128 {
-        match env
-            .storage()
-            .persistent()
-            .get::<_, i128>(&DataKey::MaxFeeAbsolute)
-        {
-            Some(cap) => fee.min(cap),
-            None => fee,
-        }
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Read the absolute per-route fee ceiling, or `None` when unset.
     pub fn get_max_fee_absolute(env: Env) -> Option<i128> {
         env.storage().persistent().get(&DataKey::MaxFeeAbsolute)
     }
 
     /// Admin sets the absolute per-route fee ceiling (in source units).

---- test::prop_capped_fee_matches_pure_math stdout ----
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.1.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.2.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.3.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.4.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.5.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_

---- test::prop_overflow_fallback_is_zero stdout ----
Writing test snapshot file for test "test::prop_overflow_fallback_is_zero" to "test_snapshots/test/prop_overflow_fallback_is_zero.1.json".
Writing test snapshot file for test "test::prop_overflow_fallback_is_zero" to "test_snapshots/test/prop_overflow_fallback_is_zero.2.json".
Writing test snapshot file for test "test::prop_overflow_fallback_is_zero" to "test_snapshots/test/prop_overflow_fallback_is_zero.3.json".
Writing test snapshot file for test "test::prop_overflow_fallback_is_zero" to "test_snapshots/test/prop_overflow_fallback_is_zero.4.json".
Writing test snapshot file for test "test::prop_overflow_fallback_is_zero" to "test_snapshots/test/prop_overflow_fallback_is_zero.5.json".
Writing test snapshot file for test "test::prop_overflow_fallback_is_zero" to "test_snapshots/test/prop_overflow_fallback_is_zero.6.json".
Writing test

---- test::prop_zero_fee_bps_is_free stdout ----
Writing test snapshot file for test "test::prop_zero_fee_bps_is_free" to "test_snapshots/test/prop_zero_fee_bps_is_free.1.json".
Writing test snapshot file for test "test::prop_zero_fee_bps_is_free" to "test_snapshots/test/prop_zero_fee_bps_is_free.2.json".
Writing test snapshot file for test "test::prop_zero_fee_bps_is_free" to "test_snapshots/test/prop_zero_fee_bps_is_free.3.json".
Writing test snapshot file for test "test::prop_zero_fee_bps_is_free" to "test_snapshots/test/prop_zero_fee_bps_is_free.4.json".
Writing test snapshot file for test "test::prop_zero_fee_bps_is_free" to "test_snapshots/test/prop_zero_fee_bps_is_free.5.json".
Writing test snapshot file for test "test::prop_zero_fee_bps_is_free" to "test_snapshots/test/prop_zero_fee_bps_is_free.6.json".
Writing test snapshot file for test "test::prop_zero_fee_bps_is_free" to "tes

failures:
    test::prop_capped_fee_matches_pure_math
    test::prop_overflow_fallback_is_zero
    test::prop_zero_bps_yields_zero_fee
    test::prop_zero_fee_bps_is_free
    test::test_compute_route_fee_basic
    test::test_compute_route_fee_clears_reentrancy_lock_after_success
    test::test_compute_route_fee_is_zero_when_fee_unset
    test::test_compute_route_fee_rejects_reentry_from_mock_callback
    test::test_compute_route_fee_releases_lock_for_consecutive_calls
    test::test_compute_route_fee_resumes_after_unpause
    test::test_quote_route_allowed_while_paused
    test::test_quote_route_and_compute_route_update_counters

test result: FAILED. 205 passed; 29 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.42s

*** result: Failure(101)
