*** src/lib.rs:989:9: replace StableRouteRouter::apply_fee_floor -> i128 with 0

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::apply_fee_floor -> i128 with 0
@@ -981,24 +981,17 @@
             .set(&DataKey::MaxFeeAbsolute, &max_fee);
         env.events().publish((symbol_short!("maxfee"),), max_fee);
     }
 
     /// Clamp `fee` to the configured absolute floor when one is set.
     /// Applies after the fee cap; if the floor exceeds the cap, the floor
     /// takes precedence. No-op when no absolute floor is configured.
     fn apply_fee_floor(env: &Env, fee: i128) -> i128 {
-        match env
-            .storage()
-            .persistent()
-            .get::<_, i128>(&DataKey::MinFeeAbsolute)
-        {
-            Some(floor) => fee.max(floor),
-            None => fee,
-        }
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Read the absolute per-route fee floor, or `None` when unset.
     pub fn get_min_fee_absolute(env: Env) -> Option<i128> {
         env.storage().persistent().get(&DataKey::MinFeeAbsolute)
     }
 
     /// Admin sets the absolute per-route fee floor (in source units).

---- test::prop_capped_fee_matches_pure_math stdout ----
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.1.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.2.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.3.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.4.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.5.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_

---- test::test_compute_route_fee_basic stdout ----

thread 'test::test_compute_route_fee_basic' (118629) panicked at src/lib.rs:1871:9:
assertion `left == right` failed
  left: 0
 right: 5000
Writing test snapshot file for test "test::test_compute_route_fee_basic" to "test_snapshots/test/test_compute_route_fee_basic.1.json".

---- test::test_compute_route_fee_clears_reentrancy_lock_after_success stdout ----

thread 'test::test_compute_route_fee_clears_reentrancy_lock_after_success' (118632) panicked at src/lib.rs:1998:9:
assertion `left == right` failed
  left: 0
 right: 5000
Writing test snapshot file for test "test::test_compute_route_fee_clears_reentrancy_lock_after_success" to "test_snapshots/test/test_compute_route_fee_clears_reentrancy_lock_after_success.1.json".

failures:
    test::prop_capped_fee_matches_pure_math
    test::test_compute_route_fee_basic
    test::test_compute_route_fee_clears_reentrancy_lock_after_success
    test::test_compute_route_fee_rejects_reentry_from_mock_callback
    test::test_compute_route_fee_releases_lock_for_consecutive_calls
    test::test_compute_route_fee_resumes_after_unpause
    test::test_quote_route_allowed_while_paused
    test::test_quote_route_and_compute_route_update_counters
    test::test_quote_route_does_not_mutate_counter_or_emit_route_event
    test_i16_fee_arithmetic::test_truncating_division_rounds_toward_zero
    test_i230_paused_sweep::test_all_gated_entrypoints_resume_after_unpause
    test_i230_paused_sweep::test_quote_route_available_while_paused

test result: FAILED. 212 passed; 22 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.69s

*** result: Failure(101)
