*** src/lib.rs:1010:20: replace < with > in StableRouteRouter::set_min_fee_absolute

*** mutation diff:
--- src/lib.rs
+++ replace < with > in StableRouteRouter::set_min_fee_absolute
@@ -1002,17 +1002,17 @@
     }
 
     /// Admin sets the absolute per-route fee floor (in source units).
     /// Rejects negative floors with `AmountMustBePositive` (#6). Emits
     /// a `minfee` event. The floor composes with the fee cap: a route is
     /// charged `max(min(amount * fee_bps / 10_000, max_fee_absolute), min_fee_absolute)`.
     pub fn set_min_fee_absolute(env: Env, min_fee: i128) {
         Self::require_admin(&env);
-        if min_fee < 0 {
+        if min_fee > /* ~ changed by cargo-mutants ~ */ 0 {
             panic_with_error!(&env, RouterError::AmountMustBePositive);
         }
         env.storage()
             .persistent()
             .set(&DataKey::MinFeeAbsolute, &min_fee);
         env.events().publish((symbol_short!("minfee"),), min_fee);
     }

---- test_i42_min_fee_floor::test_fee_above_floor_is_unaffected stdout ----

thread 'test_i42_min_fee_floor::test_fee_above_floor_is_unaffected' (109084) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #6)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #6)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #6)], data:["contract call failed", set_min_fee_absolute, [50]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #6)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #6)], data:"escalatin

---- test_i42_min_fee_floor::test_fee_below_floor_is_raised stdout ----

thread 'test_i42_min_fee_floor::test_fee_below_floor_is_raised' (109087) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #6)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #6)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #6)], data:["contract call failed", set_min_fee_absolute, [100]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #6)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #6)], data:"escalating error

---- test_i42_min_fee_floor::test_floor_exceeds_cap_floor_takes_precedence stdout ----

thread 'test_i42_min_fee_floor::test_floor_exceeds_cap_floor_takes_precedence' (109088) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #6)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #6)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #6)], data:["contract call failed", set_min_fee_absolute, [75]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #6)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract,

failures:
    test_i42_min_fee_floor::test_fee_above_floor_is_unaffected
    test_i42_min_fee_floor::test_fee_below_floor_is_raised
    test_i42_min_fee_floor::test_floor_exceeds_cap_floor_takes_precedence
    test_i42_min_fee_floor::test_negative_floor_rejected
    test_i42_min_fee_floor::test_quote_and_compute_agree_under_floor
    test_i42_min_fee_floor::test_truncation_boundary_fee_bps_1

test result: FAILED. 228 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.19s

*** result: Failure(101)
