*** src/lib.rs:1106:9: replace StableRouteRouter::set_pair_liquidity with ()

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::set_pair_liquidity with ()
@@ -1098,38 +1098,17 @@
     /// The dual-authorization model limits the impact of a compromised oracle.
     pub fn set_pair_liquidity(
         env: Env,
         caller: Address,
         source: Symbol,
         destination: Symbol,
         liquidity: i128,
     ) {
-        caller.require_auth();
-        let admin: Address = env
-            .storage()
-            .instance()
-            .get(&DataKey::Admin)
-            .unwrap_or_else(|| panic_with_error!(&env, RouterError::NotInitialized));
-        let oracle: Option<Address> = env.storage().persistent().get(&DataKey::Oracle);
-        if caller != admin && Some(caller.clone()) != oracle {
-            panic_with_error!(&env, RouterError::NotAuthorized);
-        }
-        if liquidity < 0 {
-            panic_with_error!(&env, RouterError::AmountMustBePositive);
-        }
-        Self::require_pair_registered(&env, &source, &destination);
-        env.storage().persistent().set(
-            &DataKey::PairLiquidity(source.clone(), destination.clone()),
-            &liquidity,
-        );
-        env.events().publish(
-            (symbol_short!("liq_set"),),
-            (source, destination, liquidity),
-        );
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Read the per-pair maximum (i128::MAX when absent).
     pub fn get_pair_max_amount(env: Env, source: Symbol, destination: Symbol) -> i128 {
         Self::read_pair_max(&env, &source, &destination)
     }
 
     /// Admin sets the per-pair maximum routable amount.

---- test::test_admin_can_still_update_liquidity stdout ----

thread 'test::test_admin_can_still_update_liquidity' (114408) panicked at src/lib.rs:2702:9:
assertion `left == right` failed
  left: 0
 right: 10
Writing test snapshot file for test "test::test_admin_can_still_update_liquidity" to "test_snapshots/test/test_admin_can_still_update_liquidity.1.json".

---- test::test_admin_can_still_update_liquidity_after_removal stdout ----

thread 'test::test_admin_can_still_update_liquidity_after_removal' (114410) panicked at src/lib.rs:2829:9:
assertion `left == right` failed
  left: 0
 right: 42
Writing test snapshot file for test "test::test_admin_can_still_update_liquidity_after_removal" to "test_snapshots/test/test_admin_can_still_update_liquidity_after_removal.1.json".

---- test::test_compute_route_fee_rejects_insufficient_liquidity stdout ----
Writing test snapshot file for test "test::test_compute_route_fee_rejects_insufficient_liquidity" to "test_snapshots/test/test_compute_route_fee_rejects_insufficient_liquidity.1.json".
note: test did not panic as expected at src/lib.rs:2639:8

failures:
    test::test_admin_can_still_update_liquidity
    test::test_admin_can_still_update_liquidity_after_removal
    test::test_compute_route_fee_rejects_insufficient_liquidity
    test::test_oracle_can_be_reconfigured_after_removal
    test::test_oracle_can_update_before_removal_but_not_after
    test::test_oracle_can_update_liquidity
    test::test_pair_lifecycle_events_have_exact_payloads_and_counts
    test::test_pair_limits_liquidity_and_info_round_trip
    test::test_random_caller_cannot_update_liquidity
    test::test_removed_oracle_rejected_with_not_authorized
    test::test_set_pair_liquidity_rejects_negative_value
    test_i153_version_uninitialized::test_set_pair_liquidity_panics_on_uninitialized_contract

test result: FAILED. 207 passed; 27 failed; 0 ignored; 0 measured; 0 filtered out; finished in 26.34s

*** result: Failure(101)
