*** src/lib.rs:1113:28: replace && with || in StableRouteRouter::set_pair_liquidity

*** mutation diff:
--- src/lib.rs
+++ replace && with || in StableRouteRouter::set_pair_liquidity
@@ -1105,17 +1105,17 @@
     ) {
         caller.require_auth();
         let admin: Address = env
             .storage()
             .instance()
             .get(&DataKey::Admin)
             .unwrap_or_else(|| panic_with_error!(&env, RouterError::NotInitialized));
         let oracle: Option<Address> = env.storage().persistent().get(&DataKey::Oracle);
-        if caller != admin && Some(caller.clone()) != oracle {
+        if caller != admin || /* ~ changed by cargo-mutants ~ */ Some(caller.clone()) != oracle {
             panic_with_error!(&env, RouterError::NotAuthorized);
         }
         if liquidity < 0 {
             panic_with_error!(&env, RouterError::AmountMustBePositive);
         }
         Self::require_pair_registered(&env, &source, &destination);
         env.storage().persistent().set(
             &DataKey::PairLiquidity(source.clone(), destination.clone()),

---- test::test_admin_can_still_update_liquidity stdout ----

thread 'test::test_admin_can_still_update_liquidity' (114391) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #16)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #16)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #16)], data:["contract call failed", set_pair_liquidity, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, USDC, EURC, 10]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #16)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[er

---- test::test_admin_can_still_update_liquidity_after_removal stdout ----

thread 'test::test_admin_can_still_update_liquidity_after_removal' (114392) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #16)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #16)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #16)], data:["contract call failed", set_pair_liquidity, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, USDC, EURC, 42]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #16)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA

---- test::test_compute_route_fee_rejects_insufficient_liquidity stdout ----

thread 'test::test_compute_route_fee_rejects_insufficient_liquidity' (114409) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #16)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #16)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #16)], data:["contract call failed", set_pair_liquidity, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, USDC, EURC, 10]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #16)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA

failures:
    test::test_admin_can_still_update_liquidity
    test::test_admin_can_still_update_liquidity_after_removal
    test::test_compute_route_fee_rejects_insufficient_liquidity
    test::test_oracle_can_be_reconfigured_after_removal
    test::test_oracle_can_update_before_removal_but_not_after
    test::test_oracle_can_update_liquidity
    test::test_pair_lifecycle_events_have_exact_payloads_and_counts
    test::test_pair_limits_liquidity_and_info_round_trip
    test::test_set_pair_liquidity_rejects_negative_value
    test_i15_bounds_liquidity::test_above_liquidity_rejected
    test_i15_bounds_liquidity::test_liquidity_at_bound_is_accepted
    test_i15_bounds_liquidity::test_set_pair_liquidity_rejects_negative

test result: FAILED. 176 passed; 58 failed; 0 ignored; 0 measured; 0 filtered out; finished in 26.36s

*** result: Failure(101)
