*** src/lib.rs:1116:22: replace < with == in StableRouteRouter::set_pair_liquidity

*** mutation diff:
--- src/lib.rs
+++ replace < with == in StableRouteRouter::set_pair_liquidity
@@ -1108,17 +1108,17 @@
             .storage()
             .instance()
             .get(&DataKey::Admin)
             .unwrap_or_else(|| panic_with_error!(&env, RouterError::NotInitialized));
         let oracle: Option<Address> = env.storage().persistent().get(&DataKey::Oracle);
         if caller != admin && Some(caller.clone()) != oracle {
             panic_with_error!(&env, RouterError::NotAuthorized);
         }
-        if liquidity < 0 {
+        if liquidity == /* ~ changed by cargo-mutants ~ */ 0 {
             panic_with_error!(&env, RouterError::AmountMustBePositive);
         }
         Self::require_pair_registered(&env, &source, &destination);
         env.storage().persistent().set(
             &DataKey::PairLiquidity(source.clone(), destination.clone()),
             &liquidity,
         );
         env.events().publish(

---- test::test_set_pair_liquidity_rejects_negative_value stdout ----

thread 'test::test_set_pair_liquidity_rejects_negative_value' (117339) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #5)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #5)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #5)], data:["contract call failed", set_pair_liquidity, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, USDC, EURC, -1]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #5)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFC

---- test_i15_bounds_liquidity::test_set_pair_liquidity_rejects_negative stdout ----
Writing test snapshot file for test "test_i15_bounds_liquidity::test_set_pair_liquidity_rejects_negative" to "test_snapshots/test_i15_bounds_liquidity/test_set_pair_liquidity_rejects_negative.1.json".
note: test did not panic as expected at src/lib.rs:3404:8

failures:
    test::test_set_pair_liquidity_rejects_negative_value
    test_i15_bounds_liquidity::test_set_pair_liquidity_rejects_negative

test result: FAILED. 232 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 26.43s

*** result: Failure(101)
