*** src/lib.rs:1142:9: replace StableRouteRouter::set_pair_max_amount with ()

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::set_pair_max_amount with ()
@@ -1134,24 +1134,17 @@
 
     /// Admin sets the per-pair maximum routable amount.
     ///
     /// Requires the pair to already be registered via
     /// [`Self::register_pair`]; rejects an unregistered pair with
     /// [`RouterError::PairNotRegistered`] (#5) so the maximum can never be
     /// configured for a corridor that was never (or no longer) enabled.
     pub fn set_pair_max_amount(env: Env, source: Symbol, destination: Symbol, max_amount: i128) {
-        Self::require_admin(&env);
-        if max_amount <= 0 {
-            panic_with_error!(&env, RouterError::AmountMustBePositive);
-        }
-        Self::require_pair_registered(&env, &source, &destination);
-        env.storage()
-            .persistent()
-            .set(&DataKey::PairMaxAmount(source, destination), &max_amount);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Read the per-pair minimum (0 when absent).
     pub fn get_pair_min_amount(env: Env, source: Symbol, destination: Symbol) -> i128 {
         Self::read_pair_min(&env, &source, &destination)
     }
 
     /// Admin sets the per-pair minimum routable amount.

---- test::test_compute_route_fee_rejects_above_maximum stdout ----
Writing test snapshot file for test "test::test_compute_route_fee_rejects_above_maximum" to "test_snapshots/test/test_compute_route_fee_rejects_above_maximum.1.json".
note: test did not panic as expected at src/lib.rs:2643:8

---- test::test_pair_limits_liquidity_and_info_round_trip stdout ----

thread 'test::test_pair_limits_liquidity_and_info_round_trip' (121436) panicked at src/lib.rs:2566:9:
assertion `left == right` failed
  left: 170141183460469231731687303715884105727
 right: 1000
Writing test snapshot file for test "test::test_pair_limits_liquidity_and_info_round_trip" to "test_snapshots/test/test_pair_limits_liquidity_and_info_round_trip.1.json".

---- test::test_purge_pair_metrics_does_not_touch_registration_or_config stdout ----

thread 'test::test_purge_pair_metrics_does_not_touch_registration_or_config' (121451) panicked at src/lib.rs:2518:9:
assertion `left == right` failed
  left: 170141183460469231731687303715884105727
 right: 1000
Writing test snapshot file for test "test::test_purge_pair_metrics_does_not_touch_registration_or_config" to "test_snapshots/test/test_purge_pair_metrics_does_not_touch_registration_or_config.1.json".

failures:
    test::test_compute_route_fee_rejects_above_maximum
    test::test_pair_limits_liquidity_and_info_round_trip
    test::test_purge_pair_metrics_does_not_touch_registration_or_config
    test::test_set_pair_max_amount_rejects_zero
    test_i153_version_uninitialized::test_set_pair_max_amount_panics_on_uninitialized_contract
    test_i15_bounds_liquidity::test_above_max_rejected
    test_i15_bounds_liquidity::test_max_amount_at_bound_is_accepted
    test_i18_read_surface::test_pair_info_ext_reflects_configuration
    test_i18_read_surface::test_pair_info_reflects_configuration
    test_i19_authorization::test_set_pair_max_amount_requires_admin
    test_i230_paused_sweep::test_set_pair_max_amount_succeeds_while_paused

test result: FAILED. 223 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 28.55s

*** result: Failure(101)
