*** src/lib.rs:1143:23: replace <= with > in StableRouteRouter::set_pair_max_amount

*** mutation diff:
--- src/lib.rs
+++ replace <= with > in StableRouteRouter::set_pair_max_amount
@@ -1135,17 +1135,17 @@
     /// Admin sets the per-pair maximum routable amount.
     ///
     /// Requires the pair to already be registered via
     /// [`Self::register_pair`]; rejects an unregistered pair with
     /// [`RouterError::PairNotRegistered`] (#5) so the maximum can never be
     /// configured for a corridor that was never (or no longer) enabled.
     pub fn set_pair_max_amount(env: Env, source: Symbol, destination: Symbol, max_amount: i128) {
         Self::require_admin(&env);
-        if max_amount <= 0 {
+        if max_amount > /* ~ changed by cargo-mutants ~ */ 0 {
             panic_with_error!(&env, RouterError::AmountMustBePositive);
         }
         Self::require_pair_registered(&env, &source, &destination);
         env.storage()
             .persistent()
             .set(&DataKey::PairMaxAmount(source, destination), &max_amount);
     }

---- test::test_compute_route_fee_rejects_above_maximum stdout ----

thread 'test::test_compute_route_fee_rejects_above_maximum' (121110) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #6)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #6)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #6)], data:["contract call failed", set_pair_max_amount, [USDC, EURC, 10]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #6)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #6)], data:"escalating err

---- test::test_pair_limits_liquidity_and_info_round_trip stdout ----

thread 'test::test_pair_limits_liquidity_and_info_round_trip' (121180) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #6)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #6)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #6)], data:["contract call failed", set_pair_max_amount, [USDC, EURC, 1000]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #6)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #6)], data:"escalati

---- test::test_purge_pair_metrics_does_not_touch_registration_or_config stdout ----

thread 'test::test_purge_pair_metrics_does_not_touch_registration_or_config' (121184) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #6)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #6)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #6)], data:["contract call failed", set_pair_max_amount, [USDC, EURC, 1000]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #6)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(

failures:
    test::test_compute_route_fee_rejects_above_maximum
    test::test_pair_limits_liquidity_and_info_round_trip
    test::test_purge_pair_metrics_does_not_touch_registration_or_config
    test::test_set_pair_max_amount_rejects_zero
    test_i15_bounds_liquidity::test_above_max_rejected
    test_i15_bounds_liquidity::test_max_amount_at_bound_is_accepted
    test_i16_fee_arithmetic::test_overflow_path_returns_zero
    test_i16_fee_arithmetic::test_quote_and_compute_agree_across_fee_tiers
    test_i16_fee_arithmetic::test_quote_matches_compute_fee
    test_i16_fee_arithmetic::test_quote_route_net_equals_amount_minus_fee_at_max_fee_bps
    test_i16_fee_arithmetic::test_quote_route_net_equals_amount_minus_fee_at_zero_fee
    test_i16_fee_arithmetic::test_route_counter_increments_and_never_panics

test result: FAILED. 216 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 26.73s

*** result: Failure(101)
