*** src/lib.rs:1165:23: replace < with == in StableRouteRouter::set_pair_min_amount

*** mutation diff:
--- src/lib.rs
+++ replace < with == in StableRouteRouter::set_pair_min_amount
@@ -1157,17 +1157,17 @@
     /// Admin sets the per-pair minimum routable amount.
     ///
     /// Requires the pair to already be registered via
     /// [`Self::register_pair`]; rejects an unregistered pair with
     /// [`RouterError::PairNotRegistered`] (#5) so the minimum can never be
     /// configured for a corridor that was never (or no longer) enabled.
     pub fn set_pair_min_amount(env: Env, source: Symbol, destination: Symbol, min_amount: i128) {
         Self::require_admin(&env);
-        if min_amount < 0 {
+        if min_amount == /* ~ changed by cargo-mutants ~ */ 0 {
             panic_with_error!(&env, RouterError::AmountMustBePositive);
         }
         Self::require_pair_registered(&env, &source, &destination);
         env.storage()
             .persistent()
             .set(&DataKey::PairMinAmount(source, destination), &min_amount);
     }

---- test::test_set_pair_min_amount_rejects_negative_value stdout ----

thread 'test::test_set_pair_min_amount_rejects_negative_value' (125881) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #5)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #5)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #5)], data:["contract call failed", set_pair_min_amount, [USDC, EURC, -1]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #5)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #5)], data:"escalati

failures:
    test::test_set_pair_min_amount_rejects_negative_value

test result: FAILED. 233 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 28.27s

*** result: Failure(101)
