*** src/lib.rs:1193:9: replace StableRouteRouter::unregister_pair with ()

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::unregister_pair with ()
@@ -1185,27 +1185,17 @@
 
     /// Unregister a previously-registered pair. Admin-gated and idempotent.
     ///
     /// Clears the pair's min amount, max amount, and liquidity config slots so
     /// re-registering the same corridor starts from documented defaults instead of reviving
     /// stale config. The fee is preserved so a previously configured rate survives
     /// unregister + re-register cycles.
     pub fn unregister_pair(env: Env, source: Symbol, destination: Symbol) {
-        Self::require_admin(&env);
-        env.storage()
-            .persistent()
-            .remove(&DataKey::Pair(source.clone(), destination.clone()));
-        Self::clear_pair_config(&env, source.clone(), destination.clone());
-        env.events().publish(
-            (symbol_short!("unreg"),),
-            (source.clone(), destination.clone()),
-        );
-        env.events()
-            .publish((symbol_short!("cfg_clr"),), (source, destination));
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Explicitly reset a pair's operational-history metrics: `PairRouteCount`,
     /// `PairVolume`, and `PairLastRouteAt`. Admin-gated.
     ///
     /// By default, `unregister_pair` deliberately preserves these metrics so a
     /// pair's lifetime history survives a transient unregister/register cycle.
     /// This entrypoint is the explicit, opt-in way to discard that history —

---- test::test_pair_lifecycle_events_have_exact_payloads_and_counts stdout ----

thread 'test::test_pair_lifecycle_events_have_exact_payloads_and_counts' (128734) panicked at src/lib.rs:2354:9:
assertion `left == right` failed: unregister_pair emits one unreg event
  left: 0
 right: 1
Writing test snapshot file for test "test::test_pair_lifecycle_events_have_exact_payloads_and_counts" to "test_snapshots/test/test_pair_lifecycle_events_have_exact_payloads_and_counts.1.json".

---- test::test_reregister_after_unregister_preserves_fee_and_clears_other_config stdout ----

thread 'test::test_reregister_after_unregister_preserves_fee_and_clears_other_config' (128785) panicked at src/lib.rs:2403:9:
assertion `left == right` failed: single unregister should emit one unreg event
  left: 0
 right: 1
Writing test snapshot file for test "test::test_reregister_after_unregister_preserves_fee_and_clears_other_config" to "test_snapshots/test/test_reregister_after_unregister_preserves_fee_and_clears_other_config.1.json".

---- test::test_unregister_never_registered_pair_is_clean_noop_with_event stdout ----

thread 'test::test_unregister_never_registered_pair_is_clean_noop_with_event' (128819) panicked at src/lib.rs:2376:9:
assertion `left == right` failed: no-op unregister still documents one lifecycle event
  left: 0
 right: 1
Writing test snapshot file for test "test::test_unregister_never_registered_pair_is_clean_noop_with_event" to "test_snapshots/test/test_unregister_never_registered_pair_is_clean_noop_with_event.1.json".

failures:
    test::test_pair_lifecycle_events_have_exact_payloads_and_counts
    test::test_reregister_after_unregister_preserves_fee_and_clears_other_config
    test::test_unregister_never_registered_pair_is_clean_noop_with_event
    test::test_unregister_pair_removes_registration
    test_i153_version_uninitialized::test_unregister_pair_panics_on_uninitialized_contract
    test_i19_authorization::test_unregister_pair_requires_admin
    test_i230_paused_sweep::test_unregister_pair_succeeds_while_paused

test result: FAILED. 227 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 28.36s

*** result: Failure(101)
