*** src/lib.rs:1219:9: replace StableRouteRouter::purge_pair_metrics with ()

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::purge_pair_metrics with ()
@@ -1211,29 +1211,17 @@
     /// This entrypoint is the explicit, opt-in way to discard that history —
     /// call it (before or after `unregister_pair` + `register_pair`) when a
     /// re-listed corridor should start a fresh operational life instead of
     /// inheriting stale route counts and volume from its previous listing.
     ///
     /// Does not touch pair registration (`Pair`) or config (fee/bounds/
     /// liquidity, see `clear_pair_config`) — only the three metrics slots.
     pub fn purge_pair_metrics(env: Env, source: Symbol, destination: Symbol) {
-        Self::require_admin(&env);
-        let storage = env.storage().persistent();
-        storage.remove(&DataKey::PairRouteCount(
-            source.clone(),
-            destination.clone(),
-        ));
-        storage.remove(&DataKey::PairVolume(source.clone(), destination.clone()));
-        storage.remove(&DataKey::PairLastRouteAt(
-            source.clone(),
-            destination.clone(),
-        ));
-        env.events()
-            .publish((symbol_short!("pair_mrst"),), (source, destination));
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` iff `register_pair` has been called for this pair.
     pub fn is_pair_registered(env: Env, source: Symbol, destination: Symbol) -> bool {
         env.storage()
             .persistent()
             .get(&DataKey::Pair(source, destination))
             .unwrap_or(false)

---- test::test_purge_pair_metrics_rejects_non_admin stdout ----
Writing test snapshot file for test "test::test_purge_pair_metrics_rejects_non_admin" to "test_snapshots/test/test_purge_pair_metrics_rejects_non_admin.1.json".
note: test did not panic as expected at src/lib.rs:2520:8

---- test::test_purge_pair_metrics_resets_counters_and_emits_event stdout ----

thread 'test::test_purge_pair_metrics_resets_counters_and_emits_event' (129004) panicked at src/lib.rs:2482:9:
assertion `left == right` failed: purge_pair_metrics emits exactly one pair_mrst event
  left: 0
 right: 1
Writing test snapshot file for test "test::test_purge_pair_metrics_resets_counters_and_emits_event" to "test_snapshots/test/test_purge_pair_metrics_resets_counters_and_emits_event.1.json".

failures:
    test::test_purge_pair_metrics_rejects_non_admin
    test::test_purge_pair_metrics_resets_counters_and_emits_event

test result: FAILED. 232 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 27.39s

*** result: Failure(101)
