*** src/lib.rs:1236:9: replace StableRouteRouter::is_pair_registered -> bool with true

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::is_pair_registered -> bool with true
@@ -1228,20 +1228,17 @@
             destination.clone(),
         ));
         env.events()
             .publish((symbol_short!("pair_mrst"),), (source, destination));
     }
 
     /// Returns `true` iff `register_pair` has been called for this pair.
     pub fn is_pair_registered(env: Env, source: Symbol, destination: Symbol) -> bool {
-        env.storage()
-            .persistent()
-            .get(&DataKey::Pair(source, destination))
-            .unwrap_or(false)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Set the routing fee in basis points for a registered pair.
     ///
     /// Admin-gated. Rejects values above [`MAX_FEE_BPS`] with
     /// [`RouterError::FeeBpsTooHigh`]. Idempotent: setting the same
     /// fee twice is a re-assert and harmless.
     ///

---- test::test_is_pair_registered_defaults_to_false stdout ----

thread 'test::test_is_pair_registered_defaults_to_false' (129703) panicked at src/lib.rs:1825:9:
assertion failed: !client.is_pair_registered(&symbol_short!("USDC"), &symbol_short!("XLM"))
Writing test snapshot file for test "test::test_is_pair_registered_defaults_to_false" to "test_snapshots/test/test_is_pair_registered_defaults_to_false.1.json".

---- test::test_register_pair_round_trip stdout ----

thread 'test::test_register_pair_round_trip' (129751) panicked at src/lib.rs:1801:9:
assertion failed: !client.is_pair_registered(&symbol_short!("EURC"), &symbol_short!("USDC"))
Writing test snapshot file for test "test::test_register_pair_round_trip" to "test_snapshots/test/test_register_pair_round_trip.1.json".

---- test::test_reregister_after_unregister_preserves_fee_and_clears_other_config stdout ----

thread 'test::test_reregister_after_unregister_preserves_fee_and_clears_other_config' (129768) panicked at src/lib.rs:2416:9:
assertion failed: !client.is_pair_registered(&src, &dest)
Writing test snapshot file for test "test::test_reregister_after_unregister_preserves_fee_and_clears_other_config" to "test_snapshots/test/test_reregister_after_unregister_preserves_fee_and_clears_other_config.1.json".

failures:
    test::test_is_pair_registered_defaults_to_false
    test::test_register_pair_round_trip
    test::test_reregister_after_unregister_preserves_fee_and_clears_other_config
    test::test_unregister_never_registered_pair_is_clean_noop_with_event
    test::test_unregister_pair_removes_registration
    test_i153_version_uninitialized::test_read_only_operations_work_on_uninitialized_contract
    test_i18_read_surface::test_pair_info_ext_defaults_for_unconfigured_pair
    test_i230_paused_sweep::test_unregister_pair_succeeds_while_paused

test result: FAILED. 226 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 27.85s

*** result: Failure(101)
