*** src/lib.rs:1287:24: replace > with < in StableRouteRouter::set_pair_fees_bps

*** mutation diff:
--- src/lib.rs
+++ replace > with < in StableRouteRouter::set_pair_fees_bps
@@ -1279,17 +1279,17 @@
         Self::require_admin(&env);
         if entries.is_empty() {
             panic_with_error!(&env, RouterError::EmptyBatch);
         }
         if entries.len() > MAX_BATCH_SIZE {
             panic_with_error!(&env, RouterError::BatchTooLarge);
         }
         for (source, destination, fee_bps) in entries.iter() {
-            if fee_bps > MAX_FEE_BPS {
+            if fee_bps < /* ~ changed by cargo-mutants ~ */ MAX_FEE_BPS {
                 panic_with_error!(&env, RouterError::FeeBpsTooHigh);
             }
             Self::require_pair_registered(&env, &source, &destination);
             env.storage().persistent().set(
                 &DataKey::PairFeeBps(source.clone(), destination.clone()),
                 &fee_bps,
             );
             env.events()

---- test_batch::test_set_pair_fees_bps_happy_path stdout ----

thread 'test_batch::test_set_pair_fees_bps_happy_path' (137822) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #4)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #4)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #4)], data:["contract call failed", set_pair_fees_bps, [[[USDC, EURC, 25], [XLM, USDC, 50]]]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #4)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #4)], data:"escal

---- test_batch::test_set_pair_fees_bps_rejects_unregistered_pair stdout ----

thread 'test_batch::test_set_pair_fees_bps_rejects_unregistered_pair' (137828) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #4)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #4)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #4)], data:["contract call failed", set_pair_fees_bps, [[[USDC, EURC, 25]]]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #4)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #4)]

---- test_batch::test_set_pair_fees_bps_single_entry_succeeds stdout ----

thread 'test_batch::test_set_pair_fees_bps_single_entry_succeeds' (137830) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #4)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #4)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #4)], data:["contract call failed", set_pair_fees_bps, [[[USDC, EURC, 25]]]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #4)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #4)], data:"

failures:
    test_batch::test_set_pair_fees_bps_happy_path
    test_batch::test_set_pair_fees_bps_rejects_unregistered_pair
    test_batch::test_set_pair_fees_bps_single_entry_succeeds
    test_i230_paused_sweep::test_all_gated_entrypoints_resume_after_unpause

test result: FAILED. 230 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 27.01s

*** result: Failure(101)
