*** src/lib.rs:1362:19: replace < with == in StableRouteRouter::compute_route_fee

*** mutation diff:
--- src/lib.rs
+++ replace < with == in StableRouteRouter::compute_route_fee
@@ -1354,17 +1354,17 @@
             .storage()
             .persistent()
             .get::<_, bool>(&DataKey::Pair(source.clone(), destination.clone()))
             .unwrap_or(false)
         {
             Self::route_abort(&env, RouterError::PairNotRegistered);
         }
         let min_amount = Self::read_pair_min(&env, &source, &destination);
-        if amount < min_amount {
+        if amount == /* ~ changed by cargo-mutants ~ */ min_amount {
             Self::route_abort(&env, RouterError::AmountBelowMin);
         }
         let max_amount = Self::read_pair_max(&env, &source, &destination);
         if amount > max_amount {
             Self::route_abort(&env, RouterError::AmountAboveMax);
         }
         let liquidity: i128 = env
             .storage()

---- test::test_compute_route_fee_rejects_below_minimum stdout ----
Writing test snapshot file for test "test::test_compute_route_fee_rejects_below_minimum" to "test_snapshots/test/test_compute_route_fee_rejects_below_minimum.1.json".
note: test did not panic as expected at src/lib.rs:2640:8

---- test_i15_bounds_liquidity::test_below_min_rejected stdout ----
Writing test snapshot file for test "test_i15_bounds_liquidity::test_below_min_rejected" to "test_snapshots/test_i15_bounds_liquidity/test_below_min_rejected.1.json".
note: test did not panic as expected at src/lib.rs:3347:8

---- test_i15_bounds_liquidity::test_min_amount_at_bound_is_accepted stdout ----

thread 'test_i15_bounds_liquidity::test_min_amount_at_bound_is_accepted' (144285) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #10)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #10)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #10)], data:["contract call failed", compute_route_fee, [USDC, EURC, 100]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #10)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contrac

failures:
    test::test_compute_route_fee_rejects_below_minimum
    test_i15_bounds_liquidity::test_below_min_rejected
    test_i15_bounds_liquidity::test_min_amount_at_bound_is_accepted

test result: FAILED. 231 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 24.89s

*** result: Failure(101)
