*** src/lib.rs:1362:19: replace < with > in StableRouteRouter::compute_route_fee

*** mutation diff:
--- src/lib.rs
+++ replace < with > in StableRouteRouter::compute_route_fee
@@ -1354,17 +1354,17 @@
             .storage()
             .persistent()
             .get::<_, bool>(&DataKey::Pair(source.clone(), destination.clone()))
             .unwrap_or(false)
         {
             Self::route_abort(&env, RouterError::PairNotRegistered);
         }
         let min_amount = Self::read_pair_min(&env, &source, &destination);
-        if amount < min_amount {
+        if amount > /* ~ changed by cargo-mutants ~ */ min_amount {
             Self::route_abort(&env, RouterError::AmountBelowMin);
         }
         let max_amount = Self::read_pair_max(&env, &source, &destination);
         if amount > max_amount {
             Self::route_abort(&env, RouterError::AmountAboveMax);
         }
         let liquidity: i128 = env
             .storage()

---- test::prop_fee_never_exceeds_amount stdout ----

thread 'test::prop_fee_never_exceeds_amount' (142780) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #10)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #10)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #10)], data:["contract call failed", compute_route_fee, [USDC, EURC, 17528899603879800256550829119443641378]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #10)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #10)], data:"escal

---- test::prop_capped_fee_matches_pure_math stdout ----

thread 'test::prop_capped_fee_matches_pure_math' (142779) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #10)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #10)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #10)], data:["contract call failed", compute_route_fee, [USDC, EURC, 103025612302458692267063]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #10)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #10)], data:"escalating

---- test::prop_fee_within_amount stdout ----

thread 'test::prop_fee_within_amount' (142913) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #10)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #10)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #10)], data:["contract call failed", compute_route_fee, [USDC, EURC, 103025612302458692267063]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #10)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #10)], data:"escalating error to panic"
   4:

failures:
    test::prop_capped_fee_matches_pure_math
    test::prop_fee_never_exceeds_amount
    test::prop_fee_within_amount
    test::prop_overflow_fallback_is_zero
    test::prop_quote_matches_compute
    test::prop_zero_bps_yields_zero_fee
    test::prop_zero_fee_bps_is_free
    test::test_compute_route_fee_basic
    test::test_compute_route_fee_clears_reentrancy_lock_after_success
    test::test_compute_route_fee_counter_is_global_across_pairs
    test::test_compute_route_fee_emits_route_event_with_payload
    test::test_compute_route_fee_is_zero_when_fee_unset

test result: FAILED. 181 passed; 53 failed; 0 ignored; 0 measured; 0 filtered out; finished in 19.52s

*** result: Failure(101)
