*** src/lib.rs:1362:19: replace < with <= in StableRouteRouter::compute_route_fee

*** mutation diff:
--- src/lib.rs
+++ replace < with <= in StableRouteRouter::compute_route_fee
@@ -1354,17 +1354,17 @@
             .storage()
             .persistent()
             .get::<_, bool>(&DataKey::Pair(source.clone(), destination.clone()))
             .unwrap_or(false)
         {
             Self::route_abort(&env, RouterError::PairNotRegistered);
         }
         let min_amount = Self::read_pair_min(&env, &source, &destination);
-        if amount < min_amount {
+        if amount <= /* ~ changed by cargo-mutants ~ */ min_amount {
             Self::route_abort(&env, RouterError::AmountBelowMin);
         }
         let max_amount = Self::read_pair_max(&env, &source, &destination);
         if amount > max_amount {
             Self::route_abort(&env, RouterError::AmountAboveMax);
         }
         let liquidity: i128 = env
             .storage()

---- test_i15_bounds_liquidity::test_min_amount_at_bound_is_accepted stdout ----

thread 'test_i15_bounds_liquidity::test_min_amount_at_bound_is_accepted' (145850) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #10)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #10)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #10)], data:["contract call failed", compute_route_fee, [USDC, EURC, 100]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #10)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contrac

failures:
    test_i15_bounds_liquidity::test_min_amount_at_bound_is_accepted

test result: FAILED. 233 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.58s

*** result: Failure(101)
