*** src/lib.rs:1374:19: replace > with == in StableRouteRouter::compute_route_fee

*** mutation diff:
--- src/lib.rs
+++ replace > with == in StableRouteRouter::compute_route_fee
@@ -1366,17 +1366,17 @@
         if amount > max_amount {
             Self::route_abort(&env, RouterError::AmountAboveMax);
         }
         let liquidity: i128 = env
             .storage()
             .persistent()
             .get(&DataKey::PairLiquidity(source.clone(), destination.clone()))
             .unwrap_or(i128::MAX);
-        if amount > liquidity {
+        if amount == /* ~ changed by cargo-mutants ~ */ liquidity {
             Self::route_abort(&env, RouterError::InsufficientLiquidity);
         }
 
         // Per-pair rate limit. A non-zero cooldown forces a minimum gap
         // between successive routes for the pair. The first route (no
         // recorded timestamp) is always allowed; cooldown == 0 disables
         // the check entirely, preserving the prior behaviour. Compare via
         // addition (last + cooldown) rather than subtraction to avoid any

---- test::test_compute_route_fee_rejects_insufficient_liquidity stdout ----
Writing test snapshot file for test "test::test_compute_route_fee_rejects_insufficient_liquidity" to "test_snapshots/test/test_compute_route_fee_rejects_insufficient_liquidity.1.json".
note: test did not panic as expected at src/lib.rs:2660:8

---- test_i15_bounds_liquidity::test_above_liquidity_rejected stdout ----
Writing test snapshot file for test "test_i15_bounds_liquidity::test_above_liquidity_rejected" to "test_snapshots/test_i15_bounds_liquidity/test_above_liquidity_rejected.1.json".
note: test did not panic as expected at src/lib.rs:3384:8

---- test_i15_bounds_liquidity::test_liquidity_at_bound_is_accepted stdout ----

thread 'test_i15_bounds_liquidity::test_liquidity_at_bound_is_accepted' (148906) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #12)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #12)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #12)], data:["contract call failed", compute_route_fee, [USDC, EURC, 500]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #12)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract,

failures:
    test::test_compute_route_fee_rejects_insufficient_liquidity
    test_i15_bounds_liquidity::test_above_liquidity_rejected
    test_i15_bounds_liquidity::test_liquidity_at_bound_is_accepted
    test_i16_fee_arithmetic::test_overflow_path_returns_zero
    test_i18_read_surface::test_finite_liquidity_rejects_route_above_cap

test result: FAILED. 229 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 27.81s

*** result: Failure(101)
