*** src/lib.rs:1374:19: replace > with >= in StableRouteRouter::compute_route_fee

*** mutation diff:
--- src/lib.rs
+++ replace > with >= in StableRouteRouter::compute_route_fee
@@ -1366,17 +1366,17 @@
         if amount > max_amount {
             Self::route_abort(&env, RouterError::AmountAboveMax);
         }
         let liquidity: i128 = env
             .storage()
             .persistent()
             .get(&DataKey::PairLiquidity(source.clone(), destination.clone()))
             .unwrap_or(i128::MAX);
-        if amount > liquidity {
+        if amount >= /* ~ changed by cargo-mutants ~ */ liquidity {
             Self::route_abort(&env, RouterError::InsufficientLiquidity);
         }
 
         // Per-pair rate limit. A non-zero cooldown forces a minimum gap
         // between successive routes for the pair. The first route (no
         // recorded timestamp) is always allowed; cooldown == 0 disables
         // the check entirely, preserving the prior behaviour. Compare via
         // addition (last + cooldown) rather than subtraction to avoid any

---- test_i15_bounds_liquidity::test_liquidity_at_bound_is_accepted stdout ----

thread 'test_i15_bounds_liquidity::test_liquidity_at_bound_is_accepted' (149656) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #12)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #12)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #12)], data:["contract call failed", compute_route_fee, [USDC, EURC, 500]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #12)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract,

---- test_i16_fee_arithmetic::test_overflow_path_returns_zero stdout ----

thread 'test_i16_fee_arithmetic::test_overflow_path_returns_zero' (149675) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #12)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #12)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #12)], data:["contract call failed", compute_route_fee, [USDC, EURC, 170141183460469231731687303715884105727]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #12)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics

failures:
    test_i15_bounds_liquidity::test_liquidity_at_bound_is_accepted
    test_i16_fee_arithmetic::test_overflow_path_returns_zero

test result: FAILED. 232 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 26.30s

*** result: Failure(101)
