*** src/lib.rs:1410:22: replace != with == in StableRouteRouter::compute_route_fee

*** mutation diff:
--- src/lib.rs
+++ replace != with == in StableRouteRouter::compute_route_fee
@@ -1402,17 +1402,17 @@
                 }
             }
         }
 
         // EFFECTS: after all route guards above have passed, debit
         // liquidity, write counters/timestamps, and emit events.
         // When no oracle has set a liquidity value the pair is treated as
         // unbounded — no decrement and no liq_used event are emitted.
-        if liquidity != i128::MAX {
+        if liquidity == /* ~ changed by cargo-mutants ~ */ i128::MAX {
             let remaining = liquidity.saturating_sub(amount);
             env.storage().persistent().set(
                 &DataKey::PairLiquidity(source.clone(), destination.clone()),
                 &remaining,
             );
             env.events().publish(
                 (symbol_short!("liq_used"),),
                 (source.clone(), destination.clone(), remaining),

---- test_i18_read_surface::test_pair_info_ext_after_routing stdout ----

thread 'test_i18_read_surface::test_pair_info_ext_after_routing' (155268) panicked at src/lib.rs:3853:9:
assertion `left == right` failed
  left: 1000
 right: 500
Writing test snapshot file for test "test_i18_read_surface::test_pair_info_ext_after_routing" to "test_snapshots/test_i18_read_surface/test_pair_info_ext_after_routing.1.json".

---- test_i18_read_surface::test_pair_volume_saturates_near_i128_max_without_panicking stdout ----

thread 'test_i18_read_surface::test_pair_volume_saturates_near_i128_max_without_panicking' (155366) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #12)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #12)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #12)], data:["contract call failed", compute_route_fee, [USDC, EURC, 1000]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #12)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA

failures:
    test_i18_read_surface::test_pair_info_ext_after_routing
    test_i18_read_surface::test_pair_volume_saturates_near_i128_max_without_panicking

test result: FAILED. 232 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 27.24s

*** result: Failure(101)
