*** src/lib.rs:1508:9: replace StableRouteRouter::upgrade with ()

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::upgrade with ()
@@ -1500,20 +1500,17 @@
     /// ## Trade-off: not paused-gated
     ///
     /// An emergency pause should arguably still allow the admin to deploy a
     /// fix. We therefore skip the `ContractPaused` check — a paused router
     /// can be upgraded, which is consistent with fixing the bug that caused
     /// the pause. The admin can already unpause, so there is no escalation
     /// path through this exception.
     pub fn upgrade(env: Env, new_wasm_hash: BytesN<32>) {
-        Self::require_admin(&env);
-        env.events()
-            .publish((symbol_short!("upgraded"),), &new_wasm_hash);
-        env.deployer().update_current_contract_wasm(new_wasm_hash);
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Test-only mock that re-enters the router from a nested contract call.
 ///
 /// The mock stays minimal on purpose: it exists only to simulate a malicious
 /// callback path and trigger the router's reentrancy guard in a realistic
 /// nested-call shape.

---- test_i153_version_uninitialized::test_upgrade_panics_on_uninitialized_contract stdout ----
Writing test snapshot file for test "test_i153_version_uninitialized::test_upgrade_panics_on_uninitialized_contract" to "test_snapshots/test_i153_version_uninitialized/test_upgrade_panics_on_uninitialized_contract.1.json".
note: test did not panic as expected at src/lib.rs:4791:8

---- test_i19_authorization::test_upgrade_requires_admin stdout ----
Writing test snapshot file for test "test_i19_authorization::test_upgrade_requires_admin" to "test_snapshots/test_i19_authorization/test_upgrade_requires_admin.1.json".
note: test did not panic as expected at src/lib.rs:4106:8

failures:
    test_i153_version_uninitialized::test_upgrade_panics_on_uninitialized_contract
    test_i19_authorization::test_upgrade_requires_admin

test result: FAILED. 232 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 12.76s

*** result: Failure(101)
