*** src/lib.rs:351:9: replace StableRouteRouter::enter_nonreentrant with ()

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::enter_nonreentrant with ()
@@ -343,27 +343,17 @@
     }
 
     /// Acquire the reentrancy lock; panics [`RouterError::ReentrantCall`]
     /// if already held. Paired with [`Self::exit_nonreentrant`] on every
     /// return path so that a re-entrant invocation (for example via a
     /// future malicious token callback) is rejected instead of operating
     /// on partially-applied effects.
     fn enter_nonreentrant(env: &Env) {
-        if env
-            .storage()
-            .persistent()
-            .get(&DataKey::ReentrancyLock)
-            .unwrap_or(false)
-        {
-            panic_with_error!(env, RouterError::ReentrantCall);
-        }
-        env.storage()
-            .persistent()
-            .set(&DataKey::ReentrancyLock, &true);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Release the reentrancy lock. Must be called before every return
     /// from a guarded entrypoint, including the success path, so that
     /// back-to-back calls work.
     fn exit_nonreentrant(env: &Env) {
         env.storage()
             .persistent()

---- test::test_compute_route_fee_rejects_reentry_from_mock_callback stdout ----

thread 'test::test_compute_route_fee_rejects_reentry_from_mock_callback' (11195) panicked at src/lib.rs:1951:28:
nested router call should panic: ()
Writing test snapshot file for test "test::test_compute_route_fee_rejects_reentry_from_mock_callback" to "test_snapshots/test/test_compute_route_fee_rejects_reentry_from_mock_callback.1.json".

failures:
    test::test_compute_route_fee_rejects_reentry_from_mock_callback

test result: FAILED. 233 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 22.16s

*** result: Failure(101)
