*** src/lib.rs:418:9: replace StableRouteRouter::read_pair_fee_bps -> u32 with 1

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::read_pair_fee_bps -> u32 with 1
@@ -410,20 +410,17 @@
     }
 
     /// Read the per-pair fee in basis points from persistent storage.
     ///
     /// Returns `0` (free) when the slot is absent — the documented
     /// default for an unconfigured, registered pair. This is the single
     /// source of truth for the [`DataKey::PairFeeBps`] sentinel value.
     fn read_pair_fee_bps(env: &Env, source: &Symbol, destination: &Symbol) -> u32 {
-        env.storage()
-            .persistent()
-            .get(&DataKey::PairFeeBps(source.clone(), destination.clone()))
-            .unwrap_or(0)
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Read the per-pair minimum routable amount from persistent storage.
     ///
     /// Returns `0` (no floor) when the slot is absent — the documented
     /// default. This is the single source of truth for the
     /// [`DataKey::PairMinAmount`] sentinel value.
     fn read_pair_min(env: &Env, source: &Symbol, destination: &Symbol) -> i128 {

---- test::prop_overflow_fallback_is_zero stdout ----
Writing test snapshot file for test "test::prop_overflow_fallback_is_zero" to "test_snapshots/test/prop_overflow_fallback_is_zero.1.json".
Writing test snapshot file for test "test::prop_overflow_fallback_is_zero" to "test_snapshots/test/prop_overflow_fallback_is_zero.2.json".
Writing test snapshot file for test "test::prop_overflow_fallback_is_zero" to "test_snapshots/test/prop_overflow_fallback_is_zero.3.json".
Writing test snapshot file for test "test::prop_overflow_fallback_is_zero" to "test_snapshots/test/prop_overflow_fallback_is_zero.4.json".
Writing test snapshot file for test "test::prop_overflow_fallback_is_zero" to "test_snapshots/test/prop_overflow_fallback_is_zero.5.json".
Writing test snapshot file for test "test::prop_overflow_fallback_is_zero" to "test_snapshots/test/prop_overflow_fallback_is_zero.6.json".
Writing test

---- test::prop_zero_bps_yields_zero_fee stdout ----
Writing test snapshot file for test "test::prop_zero_bps_yields_zero_fee" to "test_snapshots/test/prop_zero_bps_yields_zero_fee.1.json".
Writing test snapshot file for test "test::prop_zero_bps_yields_zero_fee" to "test_snapshots/test/prop_zero_bps_yields_zero_fee.2.json".
Writing test snapshot file for test "test::prop_zero_bps_yields_zero_fee" to "test_snapshots/test/prop_zero_bps_yields_zero_fee.3.json".
Writing test snapshot file for test "test::prop_zero_bps_yields_zero_fee" to "test_snapshots/test/prop_zero_bps_yields_zero_fee.4.json".
Writing test snapshot file for test "test::prop_zero_bps_yields_zero_fee" to "test_snapshots/test/prop_zero_bps_yields_zero_fee.5.json".
Writing test snapshot file for test "test::prop_zero_bps_yields_zero_fee" to "test_snapshots/test/prop_zero_bps_yields_zero_fee.6.json".
Writing test snapshot fil

---- test::test_compute_route_fee_basic stdout ----

thread 'test::test_compute_route_fee_basic' (25136) panicked at src/lib.rs:1875:9:
assertion `left == right` failed
  left: 100
 right: 5000
Writing test snapshot file for test "test::test_compute_route_fee_basic" to "test_snapshots/test/test_compute_route_fee_basic.1.json".

failures:
    test::prop_overflow_fallback_is_zero
    test::prop_zero_bps_yields_zero_fee
    test::prop_zero_fee_bps_is_free
    test::test_compute_route_fee_basic
    test::test_compute_route_fee_clears_reentrancy_lock_after_success
    test::test_compute_route_fee_is_zero_when_fee_unset
    test::test_compute_route_fee_rejects_reentry_from_mock_callback
    test::test_compute_route_fee_releases_lock_for_consecutive_calls
    test::test_compute_route_fee_resumes_after_unpause
    test::test_get_pair_fee_bps_defaults_to_zero
    test::test_pair_limits_liquidity_and_info_round_trip
    test::test_purge_pair_metrics_does_not_touch_registration_or_config

test result: FAILED. 197 passed; 37 failed; 0 ignored; 0 measured; 0 filtered out; finished in 20.72s

*** result: Failure(101)
