*** src/lib.rs:430:9: replace StableRouteRouter::read_pair_min -> i128 with 0

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::read_pair_min -> i128 with 0
@@ -422,20 +422,17 @@
     }
 
     /// Read the per-pair minimum routable amount from persistent storage.
     ///
     /// Returns `0` (no floor) when the slot is absent — the documented
     /// default. This is the single source of truth for the
     /// [`DataKey::PairMinAmount`] sentinel value.
     fn read_pair_min(env: &Env, source: &Symbol, destination: &Symbol) -> i128 {
-        env.storage()
-            .persistent()
-            .get(&DataKey::PairMinAmount(source.clone(), destination.clone()))
-            .unwrap_or(0)
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Read the per-pair maximum routable amount from persistent storage.
     ///
     /// Returns `i128::MAX` (no ceiling — unbounded) when the slot is
     /// absent. This is the single source of truth for the
     /// [`DataKey::PairMaxAmount`] sentinel value.
     fn read_pair_max(env: &Env, source: &Symbol, destination: &Symbol) -> i128 {

---- test::test_compute_route_fee_rejects_below_minimum stdout ----
Writing test snapshot file for test "test::test_compute_route_fee_rejects_below_minimum" to "test_snapshots/test/test_compute_route_fee_rejects_below_minimum.1.json".
note: test did not panic as expected at src/lib.rs:2637:8

---- test::test_pair_limits_liquidity_and_info_round_trip stdout ----

thread 'test::test_pair_limits_liquidity_and_info_round_trip' (27072) panicked at src/lib.rs:2566:9:
assertion `left == right` failed
  left: 0
 right: 10
Writing test snapshot file for test "test::test_pair_limits_liquidity_and_info_round_trip" to "test_snapshots/test/test_pair_limits_liquidity_and_info_round_trip.1.json".

---- test::test_purge_pair_metrics_does_not_touch_registration_or_config stdout ----

thread 'test::test_purge_pair_metrics_does_not_touch_registration_or_config' (27077) panicked at src/lib.rs:2521:9:
assertion `left == right` failed
  left: 0
 right: 10
Writing test snapshot file for test "test::test_purge_pair_metrics_does_not_touch_registration_or_config" to "test_snapshots/test/test_purge_pair_metrics_does_not_touch_registration_or_config.1.json".

failures:
    test::test_compute_route_fee_rejects_below_minimum
    test::test_pair_limits_liquidity_and_info_round_trip
    test::test_purge_pair_metrics_does_not_touch_registration_or_config
    test_i15_bounds_liquidity::test_below_min_rejected
    test_i15_bounds_liquidity::test_min_amount_at_bound_is_accepted
    test_i18_read_surface::test_pair_info_ext_reflects_configuration
    test_i18_read_surface::test_pair_info_reflects_configuration
    test_i230_paused_sweep::test_set_pair_min_amount_succeeds_while_paused

test result: FAILED. 226 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 22.19s

*** result: Failure(101)
