*** src/lib.rs:470:9: replace StableRouteRouter::read_pair_cooldown -> u64 with 1

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::read_pair_cooldown -> u64 with 1
@@ -462,20 +462,17 @@
     }
 
     /// Read the per-pair route cooldown from persistent storage.
     ///
     /// Returns `0` (rate limit disabled) when the slot is absent — the
     /// documented default for an unconfigured pair. This is the single
     /// source of truth for the [`DataKey::PairCooldown`] sentinel value.
     fn read_pair_cooldown(env: &Env, source: &Symbol, destination: &Symbol) -> u64 {
-        env.storage()
-            .persistent()
-            .get(&DataKey::PairCooldown(source.clone(), destination.clone()))
-            .unwrap_or(0)
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the router contract version.
     pub fn version(_env: Env) -> Symbol {
         symbol_short!("ROUTER_V2")
     }
 
     /// Read the persisted schema version, or 1 if absent (the implicit

---- test::test_compute_route_fee_clears_reentrancy_lock_after_success stdout ----

thread 'test::test_compute_route_fee_clears_reentrancy_lock_after_success' (38448) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #17)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #17)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #17)], data:["contract call failed", compute_route_fee, [USDC, EURC, 1000000]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #17)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(

---- test::test_compute_route_fee_releases_lock_for_consecutive_calls stdout ----

thread 'test::test_compute_route_fee_releases_lock_for_consecutive_calls' (38517) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #17)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #17)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #17)], data:["contract call failed", compute_route_fee, [USDC, EURC, 1000000]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #17)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Co

---- test_i16_fee_arithmetic::test_quote_and_compute_agree_across_fee_tiers stdout ----

thread 'test_i16_fee_arithmetic::test_quote_and_compute_agree_across_fee_tiers' (38772) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #17)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #17)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #17)], data:["contract call failed", compute_route_fee, [USDC, EURC, 1000000]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #17)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[err

failures:
    test::test_compute_route_fee_clears_reentrancy_lock_after_success
    test::test_compute_route_fee_releases_lock_for_consecutive_calls
    test_i16_fee_arithmetic::test_quote_and_compute_agree_across_fee_tiers
    test_i16_fee_arithmetic::test_route_counter_increments_and_never_panics
    test_i18_read_surface::test_i128_max_sentinel_means_unbounded
    test_i18_read_surface::test_pair_info_ext_after_routing
    test_i18_read_surface::test_pair_info_ext_defaults_for_unconfigured_pair
    test_i18_read_surface::test_pair_info_ext_reflects_configuration
    test_i18_read_surface::test_pair_route_count_and_volume_stay_isolated_per_pair
    test_i18_read_surface::test_pair_volume_saturates_near_i128_max_without_panicking
    test_i230_paused_sweep::test_set_pair_cooldown_succeeds_while_paused
    test_i42_min_fee_floor::test_truncation_boundary_fee_bps_1

test result: FAILED. 222 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 24.56s

*** result: Failure(101)
