*** src/lib.rs:484:9: replace StableRouteRouter::get_schema_version -> u32 with 1

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::get_schema_version -> u32 with 1
@@ -476,20 +476,17 @@
     /// Returns the router contract version.
     pub fn version(_env: Env) -> Symbol {
         symbol_short!("ROUTER_V2")
     }
 
     /// Read the persisted schema version, or 1 if absent (the implicit
     /// pre-migration default).
     pub fn get_schema_version(env: Env) -> u32 {
-        env.storage()
-            .persistent()
-            .get(&DataKey::SchemaVersion)
-            .unwrap_or(1)
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Expose the protocol-wide limits that every caller must respect before
     /// submitting a transaction.
     ///
     /// Returns a [`RouterLimits`] snapshot mirroring the compile-time
     /// constants [`MAX_FEE_BPS`], [`BPS_DENOMINATOR`], [`MAX_BATCH_SIZE`], and
     /// [`MAX_COOLDOWN_SECS`]. This is the on-chain discovery surface: an

---- test::test_schema_version_migration stdout ----

thread 'test::test_schema_version_migration' (40898) panicked at src/lib.rs:2036:9:
assertion `left == right` failed
  left: 1
 right: 2
Writing test snapshot file for test "test::test_schema_version_migration" to "test_snapshots/test/test_schema_version_migration.1.json".

---- test::test_version_is_independent_of_schema_version stdout ----

thread 'test::test_version_is_independent_of_schema_version' (40941) panicked at src/lib.rs:3216:9:
assertion `left == right` failed
  left: 1
 right: 2
Writing test snapshot file for test "test::test_version_is_independent_of_schema_version" to "test_snapshots/test/test_version_is_independent_of_schema_version.1.json".

---- test_i153_version_uninitialized::test_version_constant_independent_of_schema_migration stdout ----

thread 'test_i153_version_uninitialized::test_version_constant_independent_of_schema_migration' (41015) panicked at src/lib.rs:4588:9:
assertion `left == right` failed
  left: 1
 right: 2
Writing test snapshot file for test "test_i153_version_uninitialized::test_version_constant_independent_of_schema_migration" to "test_snapshots/test_i153_version_uninitialized/test_version_constant_independent_of_schema_migration.1.json".

failures:
    test::test_schema_version_migration
    test::test_version_is_independent_of_schema_version
    test_i153_version_uninitialized::test_version_constant_independent_of_schema_migration
    test_i17_migration::test_migrate_advances_to_two
    test_i230_paused_sweep::test_migrate_v1_to_v2_succeeds_while_paused

test result: FAILED. 229 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 26.03s

*** result: Failure(101)
