*** src/lib.rs:515:9: replace StableRouteRouter::migrate_v1_to_v2 with ()

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::migrate_v1_to_v2 with ()
@@ -507,28 +507,17 @@
         }
     }
 
     /// Migrate the schema from v1 to v2. Admin-gated; panics with
     /// MigrationVersionMismatch on a non-v1 starting state. v2 readers
     /// default sensibly when their new slots are absent, so the body
     /// only stamps the new SchemaVersion.
     pub fn migrate_v1_to_v2(env: Env) {
-        Self::require_admin(&env);
-        let current: u32 = env
-            .storage()
-            .persistent()
-            .get(&DataKey::SchemaVersion)
-            .unwrap_or(1);
-        if current != 1 {
-            panic_with_error!(&env, RouterError::MigrationVersionMismatch);
-        }
-        env.storage()
-            .persistent()
-            .set(&DataKey::SchemaVersion, &2u32);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Deploy-time constructor — sets the operational admin **atomically**
     /// at contract instantiation.
     ///
     /// Running as the constructor closes the init front-running window:
     /// the admin slot is written in the same transaction that deploys the
     /// contract (`register(StableRouteRouter, (admin,))`), so there is no

---- test::test_schema_migration_rejects_second_run stdout ----
Writing test snapshot file for test "test::test_schema_migration_rejects_second_run" to "test_snapshots/test/test_schema_migration_rejects_second_run.1.json".
note: test did not panic as expected at src/lib.rs:2033:8

---- test::test_schema_version_migration stdout ----

thread 'test::test_schema_version_migration' (41691) panicked at src/lib.rs:2028:9:
assertion `left == right` failed
  left: 1
 right: 2
Writing test snapshot file for test "test::test_schema_version_migration" to "test_snapshots/test/test_schema_version_migration.1.json".

---- test::test_version_is_independent_of_schema_version stdout ----

thread 'test::test_version_is_independent_of_schema_version' (41785) panicked at src/lib.rs:3208:9:
assertion `left == right` failed
  left: 1
 right: 2
Writing test snapshot file for test "test::test_version_is_independent_of_schema_version" to "test_snapshots/test/test_version_is_independent_of_schema_version.1.json".

failures:
    test::test_schema_migration_rejects_second_run
    test::test_schema_version_migration
    test::test_version_is_independent_of_schema_version
    test_i153_version_uninitialized::test_migrate_v1_to_v2_panics_on_uninitialized_contract
    test_i153_version_uninitialized::test_version_constant_independent_of_schema_migration
    test_i17_migration::test_double_migrate_rejected
    test_i17_migration::test_migrate_advances_to_two
    test_i17_migration::test_migrate_requires_admin_auth
    test_i19_authorization::test_migrate_requires_admin
    test_i230_paused_sweep::test_migrate_v1_to_v2_succeeds_while_paused

test result: FAILED. 224 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.09s

*** result: Failure(101)
