*** src/lib.rs:539:9: replace StableRouteRouter::__constructor with ()

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::__constructor with ()
@@ -531,20 +531,17 @@
     ///
     /// Running as the constructor closes the init front-running window:
     /// the admin slot is written in the same transaction that deploys the
     /// contract (`register(StableRouteRouter, (admin,))`), so there is no
     /// observable deployed-but-uninitialized state for an attacker to race
     /// a separate `init` call into. Requires `admin.require_auth()` and
     /// emits the `init` event for indexers.
     pub fn __constructor(env: Env, admin: Address) {
-        admin.require_auth();
-        env.storage().instance().set(&DataKey::Admin, &admin);
-        Self::bump_instance_ttl(&env);
-        env.events().publish((symbol_short!("init"),), admin);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Legacy initializer, retained for ABI compatibility only.
     ///
     /// The admin is now set by [`Self::__constructor`] at deploy time, so
     /// the slot is always populated and this entrypoint can never claim
     /// it. It unconditionally panics with
     /// [`RouterError::AlreadyInitialized`], preserving the historical

---- test::prop_fee_never_exceeds_amount stdout ----

thread 'test::prop_fee_never_exceeds_amount' (40835) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #2)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #2)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #2)], data:["contract call failed", register_pair, [USDC, EURC]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #2)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #2)], data:"escalating error to panic"
   4: [Failed Diagnostic Eve

---- test::prop_capped_fee_matches_pure_math stdout ----

thread 'test::prop_capped_fee_matches_pure_math' (40834) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #2)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #2)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #2)], data:["contract call failed", register_pair, [USDC, EURC]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #2)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #2)], data:"escalating error to panic"
   4: [Failed Diagno

---- test::prop_fee_within_amount stdout ----

thread 'test::prop_fee_within_amount' (40936) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #2)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #2)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #2)], data:["contract call failed", register_pair, [USDC, EURC]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #2)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #2)], data:"escalating error to panic"
   4: [Failed Diagnostic Event (not emitte

failures:
    test::prop_capped_fee_matches_pure_math
    test::prop_fee_never_exceeds_amount
    test::prop_fee_within_amount
    test::prop_overflow_fallback_is_zero
    test::prop_quote_matches_compute
    test::prop_zero_bps_yields_zero_fee
    test::prop_zero_fee_bps_is_free
    test::test_accept_admin_transfer_rejects_wrong_pending_admin
    test::test_admin_can_still_update_liquidity
    test::test_admin_can_still_update_liquidity_after_removal
    test::test_admin_transfer_flow
    test::test_cancel_admin_transfer_clears_pending_admin

test result: FAILED. 67 passed; 167 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.01s

*** result: Failure(101)
