*** src/lib.rs:554:9: replace StableRouteRouter::init with ()

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::init with ()
@@ -546,18 +546,17 @@
     ///
     /// The admin is now set by [`Self::__constructor`] at deploy time, so
     /// the slot is always populated and this entrypoint can never claim
     /// it. It unconditionally panics with
     /// [`RouterError::AlreadyInitialized`], preserving the historical
     /// `#1` semantics for any client still calling `init` post-deploy and
     /// guaranteeing an attacker can never seize the admin role via `init`.
     pub fn init(env: Env, admin: Address) {
-        let _ = admin;
-        panic_with_error!(&env, RouterError::AlreadyInitialized);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns true iff the router is currently paused.
     pub fn is_paused(env: Env) -> bool {
         Self::paused(&env)
     }
 
     /// Resume after a pause. Admin-gated and idempotent.

---- test::test_init_rejects_double_init stdout ----
Writing test snapshot file for test "test::test_init_rejects_double_init" to "test_snapshots/test/test_init_rejects_double_init.1.json".
note: test did not panic as expected at src/lib.rs:1789:8

---- test::test_post_deploy_init_rejects_different_address stdout ----
Writing test snapshot file for test "test::test_post_deploy_init_rejects_different_address" to "test_snapshots/test/test_post_deploy_init_rejects_different_address.1.json".
note: test did not panic as expected at src/lib.rs:3195:8

---- test::test_post_deploy_init_rejects_original_admin stdout ----
Writing test snapshot file for test "test::test_post_deploy_init_rejects_original_admin" to "test_snapshots/test/test_post_deploy_init_rejects_original_admin.1.json".
note: test did not panic as expected at src/lib.rs:3184:8

failures:
    test::test_init_rejects_double_init
    test::test_post_deploy_init_rejects_different_address
    test::test_post_deploy_init_rejects_original_admin

test result: FAILED. 231 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 26.59s

*** result: Failure(101)
