*** src/lib.rs:560:9: replace StableRouteRouter::is_paused -> bool with false

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::is_paused -> bool with false
@@ -552,17 +552,17 @@
     /// guaranteeing an attacker can never seize the admin role via `init`.
     pub fn init(env: Env, admin: Address) {
         let _ = admin;
         panic_with_error!(&env, RouterError::AlreadyInitialized);
     }
 
     /// Returns true iff the router is currently paused.
     pub fn is_paused(env: Env) -> bool {
-        Self::paused(&env)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Resume after a pause. Admin-gated and idempotent.
     pub fn unpause(env: Env) {
         Self::require_admin(&env);
         env.storage().instance().set(&DataKey::Paused, &false);
         Self::bump_instance_ttl(&env);
         env.events().publish((symbol_short!("paused"),), false);

---- test::test_pause_and_unpause_round_trip stdout ----

thread 'test::test_pause_and_unpause_round_trip' (44457) panicked at src/lib.rs:2057:9:
assertion failed: client.is_paused()
Writing test snapshot file for test "test::test_pause_and_unpause_round_trip" to "test_snapshots/test/test_pause_and_unpause_round_trip.1.json".

---- test_i14_pause_gating::test_double_pause_and_double_unpause_idempotent stdout ----

thread 'test_i14_pause_gating::test_double_pause_and_double_unpause_idempotent' (44629) panicked at src/lib.rs:3308:9:
assertion failed: client.is_paused()
Writing test snapshot file for test "test_i14_pause_gating::test_double_pause_and_double_unpause_idempotent" to "test_snapshots/test_i14_pause_gating/test_double_pause_and_double_unpause_idempotent.1.json".

---- test_i14_pause_gating::test_is_paused_defaults_false_and_toggles stdout ----

thread 'test_i14_pause_gating::test_is_paused_defaults_false_and_toggles' (44634) panicked at src/lib.rs:3259:9:
assertion failed: client.is_paused()
Writing test snapshot file for test "test_i14_pause_gating::test_is_paused_defaults_false_and_toggles" to "test_snapshots/test_i14_pause_gating/test_is_paused_defaults_false_and_toggles.1.json".

failures:
    test::test_pause_and_unpause_round_trip
    test_i14_pause_gating::test_double_pause_and_double_unpause_idempotent
    test_i14_pause_gating::test_is_paused_defaults_false_and_toggles
    test_i153_version_uninitialized::test_admin_operations_succeed_after_initialization
    test_i230_paused_sweep::test_pause_idempotent_while_paused

test result: FAILED. 229 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.28s

*** result: Failure(101)
