*** src/lib.rs:565:9: replace StableRouteRouter::unpause with ()

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::unpause with ()
@@ -557,20 +557,17 @@
 
     /// Returns true iff the router is currently paused.
     pub fn is_paused(env: Env) -> bool {
         Self::paused(&env)
     }
 
     /// Resume after a pause. Admin-gated and idempotent.
     pub fn unpause(env: Env) {
-        Self::require_admin(&env);
-        env.storage().instance().set(&DataKey::Paused, &false);
-        Self::bump_instance_ttl(&env);
-        env.events().publish((symbol_short!("paused"),), false);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Admin pauses the router. All state-changing entrypoints will
     /// then panic with ContractPaused.
     pub fn pause(env: Env) {
         Self::require_admin(&env);
         env.storage().instance().set(&DataKey::Paused, &true);
         Self::bump_instance_ttl(&env);

---- test::test_compute_route_fee_resumes_after_unpause stdout ----

thread 'test::test_compute_route_fee_resumes_after_unpause' (44414) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #9)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #9)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #9)], data:["contract call failed", compute_route_fee, [USDC, EURC, 1000000]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #9)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #9)], data:"escalating e

---- test::test_pause_and_unpause_round_trip stdout ----

thread 'test::test_pause_and_unpause_round_trip' (44456) panicked at src/lib.rs:2056:9:
assertion failed: !client.is_paused()
Writing test snapshot file for test "test::test_pause_and_unpause_round_trip" to "test_snapshots/test/test_pause_and_unpause_round_trip.1.json".

---- test_i14_pause_gating::test_double_pause_and_double_unpause_idempotent stdout ----

thread 'test_i14_pause_gating::test_double_pause_and_double_unpause_idempotent' (44621) panicked at src/lib.rs:3308:9:
assertion failed: !client.is_paused()
Writing test snapshot file for test "test_i14_pause_gating::test_double_pause_and_double_unpause_idempotent" to "test_snapshots/test_i14_pause_gating/test_double_pause_and_double_unpause_idempotent.1.json".

failures:
    test::test_compute_route_fee_resumes_after_unpause
    test::test_pause_and_unpause_round_trip
    test_i14_pause_gating::test_double_pause_and_double_unpause_idempotent
    test_i14_pause_gating::test_gated_entrypoint_succeeds_after_unpause
    test_i14_pause_gating::test_is_paused_defaults_false_and_toggles
    test_i153_version_uninitialized::test_admin_operations_succeed_after_initialization
    test_i153_version_uninitialized::test_unpause_panics_on_uninitialized_contract
    test_i19_authorization::test_unpause_requires_admin
    test_i230_paused_sweep::test_all_gated_entrypoints_resume_after_unpause
    test_i230_paused_sweep::test_unpause_succeeds_while_paused

test result: FAILED. 224 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.48s

*** result: Failure(101)
