*** src/lib.rs:593:9: replace StableRouteRouter::set_timelock with ()

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::set_timelock with ()
@@ -585,20 +585,17 @@
             .get(&DataKey::Timelock)
             .unwrap_or(0)
     }
 
     /// Admin sets the governance timelock delay (seconds). Applies to the
     /// **next** `propose_admin_transfer`; already-queued actions keep the
     /// eta they were stamped with. Pass 0 to disable (instant handover).
     pub fn set_timelock(env: Env, delay_seconds: u64) {
-        Self::require_admin(&env);
-        env.storage()
-            .persistent()
-            .set(&DataKey::Timelock, &delay_seconds);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Read the earliest timestamp at which the pending admin transfer may
     /// be accepted, or `None` when no transfer is queued.
     pub fn get_pending_admin_eta(env: Env) -> Option<u64> {
         env.storage().persistent().get(&DataKey::PendingAdminEta)
     }

---- test::test_force_admin_transfer_blocks_early_force stdout ----
Writing test snapshot file for test "test::test_force_admin_transfer_blocks_early_force" to "test_snapshots/test/test_force_admin_transfer_blocks_early_force.1.json".
note: test did not panic as expected at src/lib.rs:2252:8

---- test::test_timelock_blocks_early_accept stdout ----

thread 'test::test_timelock_blocks_early_accept' (47353) panicked at src/lib.rs:2164:9:
assertion `left == right` failed
  left: Some(1000)
 right: Some(1100)
Writing test snapshot file for test "test::test_timelock_blocks_early_accept" to "test_snapshots/test/test_timelock_blocks_early_accept.1.json".
note: panic did not contain expected string
      panic message: "assertion `left == right` failed\n  left: Some(1000)\n right: Some(1100)"
 expected substring: "Error(Contract, #14)"

---- test_i153_version_uninitialized::test_set_timelock_panics_on_uninitialized_contract stdout ----
Writing test snapshot file for test "test_i153_version_uninitialized::test_set_timelock_panics_on_uninitialized_contract" to "test_snapshots/test_i153_version_uninitialized/test_set_timelock_panics_on_uninitialized_contract.1.json".
note: test did not panic as expected at src/lib.rs:4745:8

failures:
    test::test_force_admin_transfer_blocks_early_force
    test::test_timelock_blocks_early_accept
    test_i153_version_uninitialized::test_set_timelock_panics_on_uninitialized_contract
    test_i19_authorization::test_set_timelock_requires_admin
    test_i230_paused_sweep::test_set_timelock_succeeds_while_paused

test result: FAILED. 229 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 24.87s

*** result: Failure(101)
