*** src/lib.rs:758:24: replace > with == in StableRouteRouter::register_pairs

*** mutation diff:
--- src/lib.rs
+++ replace > with == in StableRouteRouter::register_pairs
@@ -750,17 +750,17 @@
     /// [`MAX_BATCH_SIZE`] entries to bound gas; exceeding it panics with
     /// [`RouterError::BatchTooLarge`].
     pub fn register_pairs(env: Env, pairs: Vec<(Symbol, Symbol)>) {
         Self::require_not_paused(&env);
         Self::require_admin(&env);
         if pairs.is_empty() {
             panic_with_error!(&env, RouterError::EmptyBatch);
         }
-        if pairs.len() > MAX_BATCH_SIZE {
+        if pairs.len() == /* ~ changed by cargo-mutants ~ */ MAX_BATCH_SIZE {
             panic_with_error!(&env, RouterError::BatchTooLarge);
         }
         for (source, destination) in pairs.iter() {
             if source == destination {
                 panic_with_error!(&env, RouterError::SourceEqualsDestination);
             }
             env.storage()
                 .persistent()

---- test_batch::test_register_pairs_rejects_too_large_batch stdout ----
Invocation exceeded the transaction resource limits, it's likely going to fail when executed in a real network. The following limits are exceeded:
total footprint ledger entries: 206 > 100
write ledger entries: 102 > 50 
See diagnostic events for invocation trace.

thread 'test_batch::test_register_pairs_rejects_too_large_batch' (63209) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host/invocation_metering.rs:518:13:
HostError: Error(Budget, ExceededLimit)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Budget, ExceededLimit)], data:"invocation resource limits are exceeded: total footprint ledger entries: 206 > 100, write ledger entries: 102 > 50"
   1: [Diagnostic Event] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA

failures:
    test_batch::test_register_pairs_rejects_too_large_batch

test result: FAILED. 233 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 26.25s

*** result: Failure(101)
