*** src/lib.rs:758:24: replace > with < in StableRouteRouter::register_pairs

*** mutation diff:
--- src/lib.rs
+++ replace > with < in StableRouteRouter::register_pairs
@@ -750,17 +750,17 @@
     /// [`MAX_BATCH_SIZE`] entries to bound gas; exceeding it panics with
     /// [`RouterError::BatchTooLarge`].
     pub fn register_pairs(env: Env, pairs: Vec<(Symbol, Symbol)>) {
         Self::require_not_paused(&env);
         Self::require_admin(&env);
         if pairs.is_empty() {
             panic_with_error!(&env, RouterError::EmptyBatch);
         }
-        if pairs.len() > MAX_BATCH_SIZE {
+        if pairs.len() < /* ~ changed by cargo-mutants ~ */ MAX_BATCH_SIZE {
             panic_with_error!(&env, RouterError::BatchTooLarge);
         }
         for (source, destination) in pairs.iter() {
             if source == destination {
                 panic_with_error!(&env, RouterError::SourceEqualsDestination);
             }
             env.storage()
                 .persistent()

---- test_batch::test_register_pairs_atomic_rollback_on_identity stdout ----

thread 'test_batch::test_register_pairs_atomic_rollback_on_identity' (63526) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #18)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #18)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #18)], data:["contract call failed", register_pairs, [[[USDC, EURC], [XLM, XLM], [ETH, BTC]]]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #18)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Er

---- test_batch::test_register_pairs_happy_path stdout ----

thread 'test_batch::test_register_pairs_happy_path' (63528) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #18)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #18)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #18)], data:["contract call failed", register_pairs, [[[USDC, EURC], [XLM, USDC], [ETH, BTC]]]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #18)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #18)], data:"escala

---- test_batch::test_register_pairs_single_entry_succeeds stdout ----

thread 'test_batch::test_register_pairs_single_entry_succeeds' (63548) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #18)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #18)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #18)], data:["contract call failed", register_pairs, [[[USDC, EURC]]]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #18)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #18)], data:"escalatin

failures:
    test_batch::test_register_pairs_atomic_rollback_on_identity
    test_batch::test_register_pairs_happy_path
    test_batch::test_register_pairs_rejects_too_large_batch
    test_batch::test_register_pairs_single_entry_succeeds
    test_batch::test_set_pair_fees_bps_atomic_rollback_on_high_fee
    test_batch::test_set_pair_fees_bps_happy_path
    test_batch::test_set_pair_fees_bps_rejects_when_paused
    test_batch::test_set_pair_fees_bps_single_entry_succeeds
    test_i230_paused_sweep::test_all_gated_entrypoints_resume_after_unpause

test result: FAILED. 225 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 26.34s

*** result: Failure(101)
