*** src/lib.rs:777:12: delete ! in StableRouteRouter::is_pair_active

*** mutation diff:
--- src/lib.rs
+++ delete ! in StableRouteRouter::is_pair_active
@@ -769,17 +769,17 @@
                 .publish((symbol_short!("pair_reg"),), (source, destination));
         }
     }
 
     /// Returns true iff the pair is registered AND has non-zero
     /// reported liquidity. Useful as a quick is-routable check.
     pub fn is_pair_active(env: Env, source: Symbol, destination: Symbol) -> bool {
         let s = env.storage().persistent();
-        if !s
+        if  /* ~ changed by cargo-mutants ~ */s
             .get::<_, bool>(&DataKey::Pair(source.clone(), destination.clone()))
             .unwrap_or(false)
         {
             return false;
         }
         Self::read_pair_liquidity(&env, &source, &destination) > 0
     }

---- test::test_pair_limits_liquidity_and_info_round_trip stdout ----

thread 'test::test_pair_limits_liquidity_and_info_round_trip' (66788) panicked at src/lib.rs:2581:9:
assertion failed: client.is_pair_active(&symbol_short!("USDC"), &symbol_short!("EURC"))
Writing test snapshot file for test "test::test_pair_limits_liquidity_and_info_round_trip" to "test_snapshots/test/test_pair_limits_liquidity_and_info_round_trip.1.json".

---- test_i18_read_surface::test_is_pair_active_requires_registration_and_liquidity stdout ----

thread 'test_i18_read_surface::test_is_pair_active_requires_registration_and_liquidity' (67296) panicked at src/lib.rs:3657:9:
assertion failed: client.is_pair_active(&s, &d)
Writing test snapshot file for test "test_i18_read_surface::test_is_pair_active_requires_registration_and_liquidity" to "test_snapshots/test_i18_read_surface/test_is_pair_active_requires_registration_and_liquidity.1.json".

failures:
    test::test_pair_limits_liquidity_and_info_round_trip
    test_i18_read_surface::test_is_pair_active_requires_registration_and_liquidity

test result: FAILED. 232 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.62s

*** result: Failure(101)
