*** src/lib.rs:848:19: replace <= with > in StableRouteRouter::quote_route

*** mutation diff:
--- src/lib.rs
+++ replace <= with > in StableRouteRouter::quote_route
@@ -840,17 +840,17 @@
     /// Read-only quote of fee + net for a pair without writing the
     /// timestamp / counter. Useful as a planner-only hook.
     pub fn quote_route(
         env: Env,
         source: Symbol,
         destination: Symbol,
         amount: i128,
     ) -> (i128, i128) {
-        if amount <= 0 {
+        if amount > /* ~ changed by cargo-mutants ~ */ 0 {
             panic_with_error!(&env, RouterError::AmountMustBePositive);
         }
         if !env
             .storage()
             .persistent()
             .get::<_, bool>(&DataKey::Pair(source.clone(), destination.clone()))
             .unwrap_or(false)
         {

---- test::prop_quote_matches_compute stdout ----

thread 'test::prop_quote_matches_compute' (77020) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #6)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #6)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #6)], data:["contract call failed", quote_route, [USDC, EURC, 212025219816094370]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #6)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #6)], data:"escalating error to panic"
   4: [Failed Di

---- test::test_quote_route_allowed_while_paused stdout ----

thread 'test::test_quote_route_allowed_while_paused' (77167) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #6)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #6)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #6)], data:["contract call failed", quote_route, [USDC, EURC, 1000]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #6)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #6)], data:"escalating error to panic"
   4: [F

---- test::test_quote_route_and_compute_route_update_counters stdout ----

thread 'test::test_quote_route_and_compute_route_update_counters' (77168) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #6)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #6)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #6)], data:["contract call failed", quote_route, [USDC, EURC, 1000]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #6)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #6)], data:"escalatin

failures:
    test::prop_quote_matches_compute
    test::test_quote_route_allowed_while_paused
    test::test_quote_route_and_compute_route_update_counters
    test::test_quote_route_does_not_mutate_counter_or_emit_route_event
    test::test_quote_route_rejects_unregistered_pair
    test::test_quote_route_rejects_zero_amount
    test_i16_fee_arithmetic::test_quote_and_compute_agree_across_fee_tiers
    test_i16_fee_arithmetic::test_quote_matches_compute_fee
    test_i16_fee_arithmetic::test_quote_route_net_equals_amount_minus_fee_at_max_fee_bps
    test_i16_fee_arithmetic::test_quote_route_net_equals_amount_minus_fee_at_zero_fee
    test_i18_read_surface::test_quote_route_is_non_mutating_and_matches_compute
    test_i230_paused_sweep::test_quote_route_available_while_paused

test result: FAILED. 220 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 23.05s

*** result: Failure(101)
