*** src/lib.rs:851:12: delete ! in StableRouteRouter::quote_route

*** mutation diff:
--- src/lib.rs
+++ delete ! in StableRouteRouter::quote_route
@@ -843,17 +843,17 @@
         env: Env,
         source: Symbol,
         destination: Symbol,
         amount: i128,
     ) -> (i128, i128) {
         if amount <= 0 {
             panic_with_error!(&env, RouterError::AmountMustBePositive);
         }
-        if !env
+        if  /* ~ changed by cargo-mutants ~ */env
             .storage()
             .persistent()
             .get::<_, bool>(&DataKey::Pair(source.clone(), destination.clone()))
             .unwrap_or(false)
         {
             panic_with_error!(&env, RouterError::PairNotRegistered);
         }
         let fee_bps = Self::read_pair_fee_bps(&env, &source, &destination);

---- test::prop_quote_matches_compute stdout ----

thread 'test::prop_quote_matches_compute' (77024) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #5)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #5)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #5)], data:["contract call failed", quote_route, [USDC, EURC, 190603150340149502]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #5)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #5)], data:"escalating error to panic"
   4: [Failed Di

---- test::test_quote_route_allowed_while_paused stdout ----

thread 'test::test_quote_route_allowed_while_paused' (77325) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #5)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #5)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #5)], data:["contract call failed", quote_route, [USDC, EURC, 1000]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #5)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #5)], data:"escalating error to panic"
   4: [F

---- test::test_quote_route_and_compute_route_update_counters stdout ----

thread 'test::test_quote_route_and_compute_route_update_counters' (77327) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #5)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #5)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #5)], data:["contract call failed", quote_route, [USDC, EURC, 1000]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #5)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #5)], data:"escalatin

failures:
    test::prop_quote_matches_compute
    test::test_quote_route_allowed_while_paused
    test::test_quote_route_and_compute_route_update_counters
    test::test_quote_route_does_not_mutate_counter_or_emit_route_event
    test::test_quote_route_rejects_unregistered_pair
    test_i16_fee_arithmetic::test_quote_and_compute_agree_across_fee_tiers
    test_i16_fee_arithmetic::test_quote_matches_compute_fee
    test_i16_fee_arithmetic::test_quote_route_net_equals_amount_minus_fee_at_max_fee_bps
    test_i16_fee_arithmetic::test_quote_route_net_equals_amount_minus_fee_at_zero_fee
    test_i18_read_surface::test_quote_route_is_non_mutating_and_matches_compute
    test_i230_paused_sweep::test_quote_route_available_while_paused
    test_i41_fee_cap::test_quote_and_compute_agree_under_cap

test result: FAILED. 221 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 23.73s

*** result: Failure(101)
