*** src/lib.rs:862:24: replace / with * in StableRouteRouter::quote_route

*** mutation diff:
--- src/lib.rs
+++ replace / with * in StableRouteRouter::quote_route
@@ -854,17 +854,17 @@
             .get::<_, bool>(&DataKey::Pair(source.clone(), destination.clone()))
             .unwrap_or(false)
         {
             panic_with_error!(&env, RouterError::PairNotRegistered);
         }
         let fee_bps = Self::read_pair_fee_bps(&env, &source, &destination);
         let fee = amount
             .checked_mul(fee_bps as i128)
-            .map(|n| n / BPS_DENOMINATOR)
+            .map(|n| n * /* ~ changed by cargo-mutants ~ */ BPS_DENOMINATOR)
             .unwrap_or(0);
         let fee = Self::apply_fee_cap(&env, fee);
         let fee = Self::apply_fee_floor(&env, fee);
         (fee, amount - fee)
     }
 
     /// Read the most recent ledger timestamp at which `compute_route_fee`
     /// touched this pair. None when never routed.

---- test::prop_quote_matches_compute stdout ----
Writing test snapshot file for test "test::prop_quote_matches_compute" to "test_snapshots/test/prop_quote_matches_compute.1.json".
Writing test snapshot file for test "test::prop_quote_matches_compute" to "test_snapshots/test/prop_quote_matches_compute.2.json".
Writing test snapshot file for test "test::prop_quote_matches_compute" to "test_snapshots/test/prop_quote_matches_compute.3.json".
Writing test snapshot file for test "test::prop_quote_matches_compute" to "test_snapshots/test/prop_quote_matches_compute.4.json".
Writing test snapshot file for test "test::prop_quote_matches_compute" to "test_snapshots/test/prop_quote_matches_compute.5.json".
Writing test snapshot file for test "test::prop_quote_matches_compute" to "test_snapshots/test/prop_quote_matches_compute.6.json".
Writing test snapshot file for test "test::prop_quote_matches_co

---- test::test_quote_route_allowed_while_paused stdout ----

thread 'test::test_quote_route_allowed_while_paused' (77817) panicked at src/lib.rs:2117:9:
assertion `left == right` failed
  left: (1000000000, -999999000)
 right: (10, 990)
Writing test snapshot file for test "test::test_quote_route_allowed_while_paused" to "test_snapshots/test/test_quote_route_allowed_while_paused.1.json".

---- test::test_quote_route_and_compute_route_update_counters stdout ----

thread 'test::test_quote_route_and_compute_route_update_counters' (77820) panicked at src/lib.rs:2604:9:
assertion `left == right` failed
  left: (1000000000, -999999000)
 right: (10, 990)
Writing test snapshot file for test "test::test_quote_route_and_compute_route_update_counters" to "test_snapshots/test/test_quote_route_and_compute_route_update_counters.1.json".

failures:
    test::prop_quote_matches_compute
    test::test_quote_route_allowed_while_paused
    test::test_quote_route_and_compute_route_update_counters
    test::test_quote_route_does_not_mutate_counter_or_emit_route_event
    test_i16_fee_arithmetic::test_quote_and_compute_agree_across_fee_tiers
    test_i16_fee_arithmetic::test_quote_matches_compute_fee
    test_i18_read_surface::test_quote_route_is_non_mutating_and_matches_compute
    test_i230_paused_sweep::test_quote_route_available_while_paused
    test_i42_min_fee_floor::test_quote_and_compute_agree_under_floor

test result: FAILED. 225 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 23.70s

*** result: Failure(101)
