*** src/lib.rs:888:26: replace > with == in StableRouteRouter::set_pair_cooldown

*** mutation diff:
--- src/lib.rs
+++ replace > with == in StableRouteRouter::set_pair_cooldown
@@ -880,17 +880,17 @@
     /// for the pair until at least `cooldown_secs` seconds have elapsed
     /// since the pair's last successful route (`PairLastRouteAt`).
     /// Setting `0` (the default) disables the rate limit for the pair.
     /// Rejects values above [`MAX_COOLDOWN_SECS`] with
     /// [`RouterError::CooldownTooLarge`] so an absurdly large value
     /// (e.g. `u64::MAX`) cannot permanently brick the corridor.
     pub fn set_pair_cooldown(env: Env, source: Symbol, destination: Symbol, cooldown_secs: u64) {
         Self::require_admin(&env);
-        if cooldown_secs > MAX_COOLDOWN_SECS {
+        if cooldown_secs == /* ~ changed by cargo-mutants ~ */ MAX_COOLDOWN_SECS {
             panic_with_error!(&env, RouterError::CooldownTooLarge);
         }
         Self::require_pair_registered(&env, &source, &destination);
         env.storage().persistent().set(
             &DataKey::PairCooldown(source.clone(), destination.clone()),
             &cooldown_secs,
         );
         env.events().publish(

*** result: Success
