*** src/lib.rs:888:26: replace > with < in StableRouteRouter::set_pair_cooldown

*** mutation diff:
--- src/lib.rs
+++ replace > with < in StableRouteRouter::set_pair_cooldown
@@ -880,17 +880,17 @@
     /// for the pair until at least `cooldown_secs` seconds have elapsed
     /// since the pair's last successful route (`PairLastRouteAt`).
     /// Setting `0` (the default) disables the rate limit for the pair.
     /// Rejects values above [`MAX_COOLDOWN_SECS`] with
     /// [`RouterError::CooldownTooLarge`] so an absurdly large value
     /// (e.g. `u64::MAX`) cannot permanently brick the corridor.
     pub fn set_pair_cooldown(env: Env, source: Symbol, destination: Symbol, cooldown_secs: u64) {
         Self::require_admin(&env);
-        if cooldown_secs > MAX_COOLDOWN_SECS {
+        if cooldown_secs < /* ~ changed by cargo-mutants ~ */ MAX_COOLDOWN_SECS {
             panic_with_error!(&env, RouterError::CooldownTooLarge);
         }
         Self::require_pair_registered(&env, &source, &destination);
         env.storage().persistent().set(
             &DataKey::PairCooldown(source.clone(), destination.clone()),
             &cooldown_secs,
         );
         env.events().publish(

---- test_i18_read_surface::test_pair_info_ext_reflects_configuration stdout ----

thread 'test_i18_read_surface::test_pair_info_ext_reflects_configuration' (83911) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #20)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #20)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #20)], data:["contract call failed", set_pair_cooldown, [USDC, EURC, 120]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #20)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contra

---- test_i230_paused_sweep::test_set_pair_cooldown_succeeds_while_paused stdout ----

thread 'test_i230_paused_sweep::test_set_pair_cooldown_succeeds_while_paused' (84027) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #20)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #20)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #20)], data:["contract call failed", set_pair_cooldown, [USDC, EURC, 60]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHK3M, topics:[error, Error(Contract, #20)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHK3M, topics:[error, Error

failures:
    test_i18_read_surface::test_pair_info_ext_reflects_configuration
    test_i230_paused_sweep::test_set_pair_cooldown_succeeds_while_paused

test result: FAILED. 232 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.32s

*** result: Failure(101)
