*** src/lib.rs:905:9: replace StableRouteRouter::get_pair_cooldown -> u64 with 1

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::get_pair_cooldown -> u64 with 1
@@ -897,17 +897,17 @@
             (symbol_short!("cd_set"),),
             (source, destination, cooldown_secs),
         );
     }
 
     /// Read the per-pair route cooldown in seconds (0 when absent,
     /// meaning the rate limit is disabled for the pair).
     pub fn get_pair_cooldown(env: Env, source: Symbol, destination: Symbol) -> u64 {
-        Self::read_pair_cooldown(&env, &source, &destination)
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Read the protocol-wide lifetime counter of route quotes.
     pub fn get_total_routes_all_time(env: Env) -> u64 {
         env.storage()
             .persistent()
             .get(&DataKey::TotalRoutesAllTime)
             .unwrap_or(0)

---- test_i18_read_surface::test_i128_max_sentinel_means_unbounded stdout ----

thread 'test_i18_read_surface::test_i128_max_sentinel_means_unbounded' (86538) panicked at src/lib.rs:3762:9:
assertion `left == right` failed: absent PairCooldown must default to 0 (disabled)
  left: 1
 right: 0
Writing test snapshot file for test "test_i18_read_surface::test_i128_max_sentinel_means_unbounded" to "test_snapshots/test_i18_read_surface/test_i128_max_sentinel_means_unbounded.1.json".

---- test_i18_read_surface::test_pair_info_ext_defaults_for_unconfigured_pair stdout ----

thread 'test_i18_read_surface::test_pair_info_ext_defaults_for_unconfigured_pair' (86546) panicked at src/lib.rs:3715:9:
assertion `left == right` failed
  left: 0
 right: 1
Writing test snapshot file for test "test_i18_read_surface::test_pair_info_ext_defaults_for_unconfigured_pair" to "test_snapshots/test_i18_read_surface/test_pair_info_ext_defaults_for_unconfigured_pair.1.json".

---- test_i18_read_surface::test_pair_info_ext_reflects_configuration stdout ----

thread 'test_i18_read_surface::test_pair_info_ext_reflects_configuration' (86550) panicked at src/lib.rs:3829:9:
assertion `left == right` failed
  left: 120
 right: 1
Writing test snapshot file for test "test_i18_read_surface::test_pair_info_ext_reflects_configuration" to "test_snapshots/test_i18_read_surface/test_pair_info_ext_reflects_configuration.1.json".

failures:
    test_i18_read_surface::test_i128_max_sentinel_means_unbounded
    test_i18_read_surface::test_pair_info_ext_defaults_for_unconfigured_pair
    test_i18_read_surface::test_pair_info_ext_reflects_configuration
    test_i230_paused_sweep::test_set_pair_cooldown_succeeds_while_paused

test result: FAILED. 230 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.98s

*** result: Failure(101)
