*** src/lib.rs:910:9: replace StableRouteRouter::get_total_routes_all_time -> u64 with 1

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::get_total_routes_all_time -> u64 with 1
@@ -902,20 +902,17 @@
     /// Read the per-pair route cooldown in seconds (0 when absent,
     /// meaning the rate limit is disabled for the pair).
     pub fn get_pair_cooldown(env: Env, source: Symbol, destination: Symbol) -> u64 {
         Self::read_pair_cooldown(&env, &source, &destination)
     }
 
     /// Read the protocol-wide lifetime counter of route quotes.
     pub fn get_total_routes_all_time(env: Env) -> u64 {
-        env.storage()
-            .persistent()
-            .get(&DataKey::TotalRoutesAllTime)
-            .unwrap_or(0)
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Read the per-pair lifetime count of `compute_route_fee`
     /// invocations for `(source, destination)`. Returns 0 when the pair
     /// has never been routed.
     pub fn get_pair_route_count(env: Env, source: Symbol, destination: Symbol) -> u64 {
         env.storage()
             .persistent()

---- test::test_compute_route_fee_clears_reentrancy_lock_after_success stdout ----

thread 'test::test_compute_route_fee_clears_reentrancy_lock_after_success' (88642) panicked at src/lib.rs:2018:9:
assertion `left == right` failed
  left: 1
 right: 2
Writing test snapshot file for test "test::test_compute_route_fee_clears_reentrancy_lock_after_success" to "test_snapshots/test/test_compute_route_fee_clears_reentrancy_lock_after_success.1.json".

---- test::test_compute_route_fee_counter_is_global_across_pairs stdout ----

thread 'test::test_compute_route_fee_counter_is_global_across_pairs' (88644) panicked at src/lib.rs:3082:9:
assertion `left == right` failed
  left: 1
 right: 0
Writing test snapshot file for test "test::test_compute_route_fee_counter_is_global_across_pairs" to "test_snapshots/test/test_compute_route_fee_counter_is_global_across_pairs.1.json".

---- test::test_compute_route_fee_releases_lock_for_consecutive_calls stdout ----

thread 'test::test_compute_route_fee_releases_lock_for_consecutive_calls' (88672) panicked at src/lib.rs:1924:9:
assertion `left == right` failed
  left: 1
 right: 2
Writing test snapshot file for test "test::test_compute_route_fee_releases_lock_for_consecutive_calls" to "test_snapshots/test/test_compute_route_fee_releases_lock_for_consecutive_calls.1.json".

failures:
    test::test_compute_route_fee_clears_reentrancy_lock_after_success
    test::test_compute_route_fee_counter_is_global_across_pairs
    test::test_compute_route_fee_releases_lock_for_consecutive_calls
    test::test_quote_route_and_compute_route_update_counters
    test_i16_fee_arithmetic::test_route_counter_increments_and_never_panics
    test_i18_read_surface::test_quote_route_is_non_mutating_and_matches_compute
    test_i230_paused_sweep::test_quote_route_available_while_paused

test result: FAILED. 227 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.44s

*** result: Failure(101)
