*** src/lib.rs:920:9: replace StableRouteRouter::get_pair_route_count -> u64 with 0

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::get_pair_route_count -> u64 with 0
@@ -912,20 +912,17 @@
             .get(&DataKey::TotalRoutesAllTime)
             .unwrap_or(0)
     }
 
     /// Read the per-pair lifetime count of `compute_route_fee`
     /// invocations for `(source, destination)`. Returns 0 when the pair
     /// has never been routed.
     pub fn get_pair_route_count(env: Env, source: Symbol, destination: Symbol) -> u64 {
-        env.storage()
-            .persistent()
-            .get(&DataKey::PairRouteCount(source, destination))
-            .unwrap_or(0)
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Read the per-pair cumulative routed volume (sum of `amount` in
     /// source units) for `(source, destination)`. Returns 0 when the
     /// pair has never been routed.
     pub fn get_pair_volume(env: Env, source: Symbol, destination: Symbol) -> i128 {
         env.storage()
             .persistent()

---- test::test_purge_pair_metrics_resets_counters_and_emits_event stdout ----

thread 'test::test_purge_pair_metrics_resets_counters_and_emits_event' (88705) panicked at src/lib.rs:2481:9:
assertion `left == right` failed
  left: 0
 right: 1
Writing test snapshot file for test "test::test_purge_pair_metrics_resets_counters_and_emits_event" to "test_snapshots/test/test_purge_pair_metrics_resets_counters_and_emits_event.1.json".

---- test::test_unregister_then_reregister_preserves_metrics_by_default stdout ----

thread 'test::test_unregister_then_reregister_preserves_metrics_by_default' (88800) panicked at src/lib.rs:2444:9:
assertion `left == right` failed
  left: 0
 right: 1
Writing test snapshot file for test "test::test_unregister_then_reregister_preserves_metrics_by_default" to "test_snapshots/test/test_unregister_then_reregister_preserves_metrics_by_default.1.json".

---- test_i18_read_surface::test_i128_max_sentinel_means_unbounded stdout ----

thread 'test_i18_read_surface::test_i128_max_sentinel_means_unbounded' (88957) panicked at src/lib.rs:3778:9:
assertion `left == right` failed
  left: 0
 right: 1
Writing test snapshot file for test "test_i18_read_surface::test_i128_max_sentinel_means_unbounded" to "test_snapshots/test_i18_read_surface/test_i128_max_sentinel_means_unbounded.1.json".

failures:
    test::test_purge_pair_metrics_resets_counters_and_emits_event
    test::test_unregister_then_reregister_preserves_metrics_by_default
    test_i18_read_surface::test_i128_max_sentinel_means_unbounded
    test_i18_read_surface::test_pair_info_ext_after_routing
    test_i18_read_surface::test_pair_route_count_and_volume_stay_isolated_per_pair
    test_i18_read_surface::test_pair_volume_saturates_near_i128_max_without_panicking

test result: FAILED. 228 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.13s

*** result: Failure(101)
