*** src/lib.rs:930:9: replace StableRouteRouter::get_pair_volume -> i128 with -1

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::get_pair_volume -> i128 with -1
@@ -922,20 +922,17 @@
             .get(&DataKey::PairRouteCount(source, destination))
             .unwrap_or(0)
     }
 
     /// Read the per-pair cumulative routed volume (sum of `amount` in
     /// source units) for `(source, destination)`. Returns 0 when the
     /// pair has never been routed.
     pub fn get_pair_volume(env: Env, source: Symbol, destination: Symbol) -> i128 {
-        env.storage()
-            .persistent()
-            .get(&DataKey::PairVolume(source, destination))
-            .unwrap_or(0)
+        -1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Admin sets the address that receives protocol fees at
     /// settlement time. The router itself never custodies funds.
     pub fn set_fee_recipient(env: Env, recipient: Address) {
         Self::require_admin(&env);
         env.storage()
             .persistent()

---- test::test_purge_pair_metrics_resets_counters_and_emits_event stdout ----

thread 'test::test_purge_pair_metrics_resets_counters_and_emits_event' (91603) panicked at src/lib.rs:2482:9:
assertion `left == right` failed
  left: -1
 right: 2000
Writing test snapshot file for test "test::test_purge_pair_metrics_resets_counters_and_emits_event" to "test_snapshots/test/test_purge_pair_metrics_resets_counters_and_emits_event.1.json".

---- test::test_unregister_then_reregister_preserves_metrics_by_default stdout ----

thread 'test::test_unregister_then_reregister_preserves_metrics_by_default' (91692) panicked at src/lib.rs:2445:9:
assertion `left == right` failed
  left: -1
 right: 1000
Writing test snapshot file for test "test::test_unregister_then_reregister_preserves_metrics_by_default" to "test_snapshots/test/test_unregister_then_reregister_preserves_metrics_by_default.1.json".

---- test_i18_read_surface::test_pair_info_ext_defaults_for_unconfigured_pair stdout ----

thread 'test_i18_read_surface::test_pair_info_ext_defaults_for_unconfigured_pair' (91891) panicked at src/lib.rs:3714:9:
assertion `left == right` failed
  left: 0
 right: -1
Writing test snapshot file for test "test_i18_read_surface::test_pair_info_ext_defaults_for_unconfigured_pair" to "test_snapshots/test_i18_read_surface/test_pair_info_ext_defaults_for_unconfigured_pair.1.json".

failures:
    test::test_purge_pair_metrics_resets_counters_and_emits_event
    test::test_unregister_then_reregister_preserves_metrics_by_default
    test_i18_read_surface::test_pair_info_ext_after_routing
    test_i18_read_surface::test_pair_info_ext_defaults_for_unconfigured_pair
    test_i18_read_surface::test_pair_info_ext_reflects_configuration
    test_i18_read_surface::test_pair_route_count_and_volume_stay_isolated_per_pair
    test_i18_read_surface::test_pair_volume_saturates_near_i128_max_without_panicking

test result: FAILED. 227 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 27.10s

*** result: Failure(101)
