*** src/lib.rs:947:9: replace StableRouteRouter::get_fee_recipient -> Option<Address> with None

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::get_fee_recipient -> Option<Address> with None
@@ -939,17 +939,17 @@
         Self::require_admin(&env);
         env.storage()
             .persistent()
             .set(&DataKey::FeeRecipient, &recipient);
     }
 
     /// Read the configured fee recipient, if any.
     pub fn get_fee_recipient(env: Env) -> Option<Address> {
-        env.storage().persistent().get(&DataKey::FeeRecipient)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Clamp `fee` to the configured absolute ceiling when one is set.
     /// Both the relative `MAX_FEE_BPS` bound and this absolute bound apply;
     /// the tighter of the two wins. No-op when no absolute cap is configured.
     fn apply_fee_cap(env: &Env, fee: i128) -> i128 {
         match env
             .storage()

---- test::test_fee_recipient_round_trip stdout ----

thread 'test::test_fee_recipient_round_trip' (92150) panicked at src/lib.rs:2301:9:
assertion `left == right` failed
  left: None
 right: Some(Contract(CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHK3M))
Writing test snapshot file for test "test::test_fee_recipient_round_trip" to "test_snapshots/test/test_fee_recipient_round_trip.1.json".

---- test_i230_paused_sweep::test_set_fee_recipient_succeeds_while_paused stdout ----

thread 'test_i230_paused_sweep::test_set_fee_recipient_succeeds_while_paused' (92672) panicked at src/lib.rs:5227:9:
assertion `left == right` failed
  left: None
 right: Some(Contract(CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAITA4))
Writing test snapshot file for test "test_i230_paused_sweep::test_set_fee_recipient_succeeds_while_paused" to "test_snapshots/test_i230_paused_sweep/test_set_fee_recipient_succeeds_while_paused.1.json".

failures:
    test::test_fee_recipient_round_trip
    test_i230_paused_sweep::test_set_fee_recipient_succeeds_while_paused

test result: FAILED. 232 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.54s

*** result: Failure(101)
