*** src/lib.rs:954:9: replace StableRouteRouter::apply_fee_cap -> i128 with 0

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::apply_fee_cap -> i128 with 0
@@ -946,24 +946,17 @@
     pub fn get_fee_recipient(env: Env) -> Option<Address> {
         env.storage().persistent().get(&DataKey::FeeRecipient)
     }
 
     /// Clamp `fee` to the configured absolute ceiling when one is set.
     /// Both the relative `MAX_FEE_BPS` bound and this absolute bound apply;
     /// the tighter of the two wins. No-op when no absolute cap is configured.
     fn apply_fee_cap(env: &Env, fee: i128) -> i128 {
-        match env
-            .storage()
-            .persistent()
-            .get::<_, i128>(&DataKey::MaxFeeAbsolute)
-        {
-            Some(cap) => fee.min(cap),
-            None => fee,
-        }
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Read the absolute per-route fee ceiling, or `None` when unset.
     pub fn get_max_fee_absolute(env: Env) -> Option<i128> {
         env.storage().persistent().get(&DataKey::MaxFeeAbsolute)
     }
 
     /// Admin sets the absolute per-route fee ceiling (in source units).

---- test::prop_capped_fee_matches_pure_math stdout ----
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.1.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.2.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.3.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.4.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.5.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_

---- test::test_compute_route_fee_basic stdout ----

thread 'test::test_compute_route_fee_basic' (94431) panicked at src/lib.rs:1871:9:
assertion `left == right` failed
  left: 0
 right: 5000
Writing test snapshot file for test "test::test_compute_route_fee_basic" to "test_snapshots/test/test_compute_route_fee_basic.1.json".

---- test::test_compute_route_fee_clears_reentrancy_lock_after_success stdout ----

thread 'test::test_compute_route_fee_clears_reentrancy_lock_after_success' (94433) panicked at src/lib.rs:1998:9:
assertion `left == right` failed
  left: 0
 right: 5000
Writing test snapshot file for test "test::test_compute_route_fee_clears_reentrancy_lock_after_success" to "test_snapshots/test/test_compute_route_fee_clears_reentrancy_lock_after_success.1.json".

failures:
    test::prop_capped_fee_matches_pure_math
    test::test_compute_route_fee_basic
    test::test_compute_route_fee_clears_reentrancy_lock_after_success
    test::test_compute_route_fee_rejects_reentry_from_mock_callback
    test::test_compute_route_fee_releases_lock_for_consecutive_calls
    test::test_compute_route_fee_resumes_after_unpause
    test::test_quote_route_allowed_while_paused
    test::test_quote_route_and_compute_route_update_counters
    test::test_quote_route_does_not_mutate_counter_or_emit_route_event
    test_i16_fee_arithmetic::test_truncating_division_rounds_toward_zero
    test_i230_paused_sweep::test_all_gated_entrypoints_resume_after_unpause
    test_i230_paused_sweep::test_quote_route_available_while_paused

test result: FAILED. 216 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 28.42s

*** result: Failure(101)
