*** src/lib.rs:966:9: replace StableRouteRouter::get_max_fee_absolute -> Option<i128> with Some(0)

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::get_max_fee_absolute -> Option<i128> with Some(0)
@@ -958,17 +958,17 @@
         {
             Some(cap) => fee.min(cap),
             None => fee,
         }
     }
 
     /// Read the absolute per-route fee ceiling, or `None` when unset.
     pub fn get_max_fee_absolute(env: Env) -> Option<i128> {
-        env.storage().persistent().get(&DataKey::MaxFeeAbsolute)
+        Some(0) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Admin sets the absolute per-route fee ceiling (in source units).
     /// Rejects negative caps with `AmountMustBePositive` (#6). A cap of `0`
     /// makes every route effectively free. Emits a `maxfee` event. The cap
     /// composes with `MAX_FEE_BPS`: a route is charged
     /// `min(amount * fee_bps / 10_000, max_fee_absolute)`.
     pub fn set_max_fee_absolute(env: Env, max_fee: i128) {

---- test_i153_version_uninitialized::test_read_only_operations_work_on_uninitialized_contract stdout ----

thread 'test_i153_version_uninitialized::test_read_only_operations_work_on_uninitialized_contract' (97404) panicked at src/lib.rs:4820:9:
assertion `left == right` failed
  left: Some(0)
 right: None
Writing test snapshot file for test "test_i153_version_uninitialized::test_read_only_operations_work_on_uninitialized_contract" to "test_snapshots/test_i153_version_uninitialized/test_read_only_operations_work_on_uninitialized_contract.1.json".

---- test_i230_paused_sweep::test_set_max_fee_absolute_succeeds_while_paused stdout ----

thread 'test_i230_paused_sweep::test_set_max_fee_absolute_succeeds_while_paused' (97507) panicked at src/lib.rs:5237:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(5000)
Writing test snapshot file for test "test_i230_paused_sweep::test_set_max_fee_absolute_succeeds_while_paused" to "test_snapshots/test_i230_paused_sweep/test_set_max_fee_absolute_succeeds_while_paused.1.json".

---- test_i41_fee_cap::test_fee_below_cap_is_unaffected stdout ----

thread 'test_i41_fee_cap::test_fee_below_cap_is_unaffected' (97541) panicked at src/lib.rs:4182:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(50000)
Writing test snapshot file for test "test_i41_fee_cap::test_fee_below_cap_is_unaffected" to "test_snapshots/test_i41_fee_cap/test_fee_below_cap_is_unaffected.1.json".

failures:
    test_i153_version_uninitialized::test_read_only_operations_work_on_uninitialized_contract
    test_i230_paused_sweep::test_set_max_fee_absolute_succeeds_while_paused
    test_i41_fee_cap::test_fee_below_cap_is_unaffected
    test_i41_fee_cap::test_no_absolute_cap_by_default

test result: FAILED. 230 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.31s

*** result: Failure(101)
