*** src/lib.rs:975:9: replace StableRouteRouter::set_max_fee_absolute with ()

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::set_max_fee_absolute with ()
@@ -967,24 +967,17 @@
     }
 
     /// Admin sets the absolute per-route fee ceiling (in source units).
     /// Rejects negative caps with `AmountMustBePositive` (#6). A cap of `0`
     /// makes every route effectively free. Emits a `maxfee` event. The cap
     /// composes with `MAX_FEE_BPS`: a route is charged
     /// `min(amount * fee_bps / 10_000, max_fee_absolute)`.
     pub fn set_max_fee_absolute(env: Env, max_fee: i128) {
-        Self::require_admin(&env);
-        if max_fee < 0 {
-            panic_with_error!(&env, RouterError::AmountMustBePositive);
-        }
-        env.storage()
-            .persistent()
-            .set(&DataKey::MaxFeeAbsolute, &max_fee);
-        env.events().publish((symbol_short!("maxfee"),), max_fee);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Clamp `fee` to the configured absolute floor when one is set.
     /// Applies after the fee cap; if the floor exceeds the cap, the floor
     /// takes precedence. No-op when no absolute floor is configured.
     fn apply_fee_floor(env: &Env, fee: i128) -> i128 {
         match env
             .storage()

---- test::prop_capped_fee_matches_pure_math stdout ----
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.1.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.2.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.3.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.4.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.5.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_

---- test_i153_version_uninitialized::test_set_max_fee_absolute_panics_on_uninitialized_contract stdout ----
Writing test snapshot file for test "test_i153_version_uninitialized::test_set_max_fee_absolute_panics_on_uninitialized_contract" to "test_snapshots/test_i153_version_uninitialized/test_set_max_fee_absolute_panics_on_uninitialized_contract.1.json".
note: test did not panic as expected at src/lib.rs:4769:8

---- test_i19_authorization::test_set_max_fee_absolute_requires_admin stdout ----
Writing test snapshot file for test "test_i19_authorization::test_set_max_fee_absolute_requires_admin" to "test_snapshots/test_i19_authorization/test_set_max_fee_absolute_requires_admin.1.json".
note: test did not panic as expected at src/lib.rs:4046:8

failures:
    test::prop_capped_fee_matches_pure_math
    test_i153_version_uninitialized::test_set_max_fee_absolute_panics_on_uninitialized_contract
    test_i19_authorization::test_set_max_fee_absolute_requires_admin
    test_i230_paused_sweep::test_set_max_fee_absolute_succeeds_while_paused
    test_i41_fee_cap::test_cap_of_zero_makes_routes_free
    test_i41_fee_cap::test_fee_above_cap_is_clamped
    test_i41_fee_cap::test_fee_below_cap_is_unaffected
    test_i41_fee_cap::test_negative_cap_rejected
    test_i41_fee_cap::test_quote_and_compute_agree_under_cap
    test_i42_min_fee_floor::test_floor_exceeds_cap_floor_takes_precedence

test result: FAILED. 224 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.22s

*** result: Failure(101)
