*** src/lib.rs:976:20: replace < with <= in StableRouteRouter::set_max_fee_absolute

*** mutation diff:
--- src/lib.rs
+++ replace < with <= in StableRouteRouter::set_max_fee_absolute
@@ -968,17 +968,17 @@
 
     /// Admin sets the absolute per-route fee ceiling (in source units).
     /// Rejects negative caps with `AmountMustBePositive` (#6). A cap of `0`
     /// makes every route effectively free. Emits a `maxfee` event. The cap
     /// composes with `MAX_FEE_BPS`: a route is charged
     /// `min(amount * fee_bps / 10_000, max_fee_absolute)`.
     pub fn set_max_fee_absolute(env: Env, max_fee: i128) {
         Self::require_admin(&env);
-        if max_fee < 0 {
+        if max_fee <= /* ~ changed by cargo-mutants ~ */ 0 {
             panic_with_error!(&env, RouterError::AmountMustBePositive);
         }
         env.storage()
             .persistent()
             .set(&DataKey::MaxFeeAbsolute, &max_fee);
         env.events().publish((symbol_short!("maxfee"),), max_fee);
     }

---- test_i41_fee_cap::test_cap_of_zero_makes_routes_free stdout ----

thread 'test_i41_fee_cap::test_cap_of_zero_makes_routes_free' (100936) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-25.0.1/src/host.rs:907:9:
HostError: Error(Contract, #6)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #6)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #6)], data:["contract call failed", set_max_fee_absolute, [0]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #6)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, topics:[error, Error(Contract, #6)], data:"escalating error to pa

failures:
    test_i41_fee_cap::test_cap_of_zero_makes_routes_free

test result: FAILED. 233 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 24.42s

*** result: Failure(101)
