*** src/lib.rs:989:9: replace StableRouteRouter::apply_fee_floor -> i128 with 1

*** mutation diff:
--- src/lib.rs
+++ replace StableRouteRouter::apply_fee_floor -> i128 with 1
@@ -981,24 +981,17 @@
             .set(&DataKey::MaxFeeAbsolute, &max_fee);
         env.events().publish((symbol_short!("maxfee"),), max_fee);
     }
 
     /// Clamp `fee` to the configured absolute floor when one is set.
     /// Applies after the fee cap; if the floor exceeds the cap, the floor
     /// takes precedence. No-op when no absolute floor is configured.
     fn apply_fee_floor(env: &Env, fee: i128) -> i128 {
-        match env
-            .storage()
-            .persistent()
-            .get::<_, i128>(&DataKey::MinFeeAbsolute)
-        {
-            Some(floor) => fee.max(floor),
-            None => fee,
-        }
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Read the absolute per-route fee floor, or `None` when unset.
     pub fn get_min_fee_absolute(env: Env) -> Option<i128> {
         env.storage().persistent().get(&DataKey::MinFeeAbsolute)
     }
 
     /// Admin sets the absolute per-route fee floor (in source units).

---- test::prop_capped_fee_matches_pure_math stdout ----
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.1.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.2.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.3.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.4.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_matches_pure_math.5.json".
Writing test snapshot file for test "test::prop_capped_fee_matches_pure_math" to "test_snapshots/test/prop_capped_fee_

---- test::prop_overflow_fallback_is_zero stdout ----
Writing test snapshot file for test "test::prop_overflow_fallback_is_zero" to "test_snapshots/test/prop_overflow_fallback_is_zero.1.json".
Writing test snapshot file for test "test::prop_overflow_fallback_is_zero" to "test_snapshots/test/prop_overflow_fallback_is_zero.2.json".
Writing test snapshot file for test "test::prop_overflow_fallback_is_zero" to "test_snapshots/test/prop_overflow_fallback_is_zero.3.json".
Writing test snapshot file for test "test::prop_overflow_fallback_is_zero" to "test_snapshots/test/prop_overflow_fallback_is_zero.4.json".
Writing test snapshot file for test "test::prop_overflow_fallback_is_zero" to "test_snapshots/test/prop_overflow_fallback_is_zero.5.json".
Writing test snapshot file for test "test::prop_overflow_fallback_is_zero" to "test_snapshots/test/prop_overflow_fallback_is_zero.6.json".
Writing test

---- test::prop_zero_fee_bps_is_free stdout ----
Writing test snapshot file for test "test::prop_zero_fee_bps_is_free" to "test_snapshots/test/prop_zero_fee_bps_is_free.1.json".
Writing test snapshot file for test "test::prop_zero_fee_bps_is_free" to "test_snapshots/test/prop_zero_fee_bps_is_free.2.json".
Writing test snapshot file for test "test::prop_zero_fee_bps_is_free" to "test_snapshots/test/prop_zero_fee_bps_is_free.3.json".
Writing test snapshot file for test "test::prop_zero_fee_bps_is_free" to "test_snapshots/test/prop_zero_fee_bps_is_free.4.json".
Writing test snapshot file for test "test::prop_zero_fee_bps_is_free" to "test_snapshots/test/prop_zero_fee_bps_is_free.5.json".
Writing test snapshot file for test "test::prop_zero_fee_bps_is_free" to "test_snapshots/test/prop_zero_fee_bps_is_free.6.json".
Writing test snapshot file for test "test::prop_zero_fee_bps_is_free" to "tes

failures:
    test::prop_capped_fee_matches_pure_math
    test::prop_overflow_fallback_is_zero
    test::prop_zero_bps_yields_zero_fee
    test::prop_zero_fee_bps_is_free
    test::test_compute_route_fee_basic
    test::test_compute_route_fee_clears_reentrancy_lock_after_success
    test::test_compute_route_fee_is_zero_when_fee_unset
    test::test_compute_route_fee_rejects_reentry_from_mock_callback
    test::test_compute_route_fee_releases_lock_for_consecutive_calls
    test::test_compute_route_fee_resumes_after_unpause
    test::test_quote_route_allowed_while_paused
    test::test_quote_route_and_compute_route_update_counters

test result: FAILED. 202 passed; 32 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.84s

*** result: Failure(101)
